ItemInfo={}
--newkdef[0小还丹]=function()
ItemInfo[0]={
"Ｌ物品说明：可恢复少量生命",
"Ｎ",
"Ｄ使用效果：+150生命",
                                    -- by 飘夜
}

--newkdef[1天香续命膏]=function()
ItemInfo[01]={
"Ｌ物品说明：可恢复较多生命",
"Ｎ",
"Ｄ使用效果：+300生命",
                                    -- by 飘夜
}

--newkdef[2黑玉断续膏]=function()
ItemInfo[02]={
"Ｌ物品说明：可恢复大量生命",
"Ｎ",
"Ｄ使用效果：+500生命",
                                    -- by 飘夜
}

--newkdef[3白云熊胆丸]=function()
ItemInfo[03]={
"Ｌ物品说明：可恢复少量内力",
"Ｎ",
"Ｄ使用效果：+666内力",
                                    -- by 飘夜
}

ItemInfo[04]={
"Ｌ物品说明：可恢复一些内力",
"Ｎ",
"Ｄ使用效果：+888内力",
                                    -- by 飘夜
}

--newkdef[5九花玉露丸]=function()
ItemInfo[05]={
"Ｌ物品说明：可恢复较多内力",
"Ｎ",
"Ｄ使用效果：+1250内力，中毒-20",
                                    -- by 飘夜
}

--newkdef[6九转熊蛇丸]=function()
ItemInfo[06]={
"Ｌ物品说明：可恢复大量内力",
"Ｎ",
"Ｄ使用效果：+3000内力",
                                    -- by 飘夜
}

--newkdef[7无常丹]=function()
ItemInfo[07]={
"Ｌ物品说明：可恢复一些生命和内力",
"Ｎ",
"Ｄ使用效果：+300生命，+800内力",
                                    -- by 飘夜
}

--newkdef[8天王保命丹]=function()
ItemInfo[08]={
"Ｌ物品说明：最好的药",
"Ｎ",
"Ｄ使用效果：+50体力，+500生命，+1200内力，解毒-25",
                                    -- by 飘夜
}

--newkdef[9黄连解毒丸]=function()
ItemInfo[09]={
"Ｌ物品说明：可少量解毒",
"Ｎ",
"Ｄ使用效果：解毒-20",
                                    -- by 飘夜
}

--newkdef[10牛黄血蝎丹]=function()
ItemInfo[10]={
"Ｌ物品说明：中等解毒药",
"Ｎ",
"Ｄ使用效果：解毒-50",
                                    -- by 飘夜
}

--newkdef[11六阳正气丹]=function()
ItemInfo[11]={
"Ｌ物品说明：高等解毒药",
"Ｎ",
"Ｄ使用效果：解毒-80",
                                    -- by 飘夜
}

--newkdef[12精气丸]=function()
ItemInfo[12]={
"Ｌ物品说明：可恢复一些体力",
"Ｎ",
"Ｄ使用效果：恢复体力+40",
                                    -- by 飘夜
}

--newkdef[13玉灵散]=function()
ItemInfo[13]={
"Ｌ物品说明：可恢复大量体力",
"Ｎ",
"Ｄ使用效果：恢复体力+66",
                                    -- by 飘夜
}

--newkdef[14千年灵芝]=function()
ItemInfo[14]={
"Ｌ物品说明：可增加人物体质",
"Ｎ",
"Ｄ使用效果：人物体质增加1点",
                                    -- by 飘夜
}

--newkdef[15大蟠桃]=function()
ItemInfo[15]={
"Ｌ物品说明：可增加人物系数",
"Ｎ",
"Ｄ使用效果：可选系数+10",
                                    -- by 飘夜
}

--newkdef[16千年人参]=function()
ItemInfo[16]={
"Ｌ物品说明：可增人物属性",
"Ｎ",
"Ｄ使用效果：可选属性+10",
                                    -- by 飘夜
}

--newkdef[17天山雪莲]=function()
ItemInfo[17]={
"Ｌ物品说明：可增加人物实战",
"Ｎ",
"Ｄ使用效果：实战+10",
                                    -- by 飘夜
}

--newkdef[18叫花鸡]=function()
ItemInfo[18]={
"Ｌ物品说明：名菜",
"Ｎ",
"Ｄ使用效果：最大内力值+200",
                                    -- by 飘夜
}

--newkdef[19好逑汤]=function()
ItemInfo[19]={
"Ｌ物品说明：名菜",
"Ｎ",
"Ｄ使用效果：最大内力值+300",
                                    -- by 飘夜
}

ItemInfo[20]={
"Ｌ物品说明：名菜，",
"Ｎ",
"Ｄ使用效果：最大内力值+400",
                                    -- by 飘夜
}

--newkdef[21腊八粥]=function()
ItemInfo[21]={
"Ｌ物品说明：可增加内力最大值",
"Ｎ",
"Ｄ使用效果：最大内力值+500",
                                    -- by 飘夜
}

--newkdef[22梨花酒]=function()
ItemInfo[22]={
"Ｌ物品说明：名酒",
"Ｎ",
"Ｄ使用效果：解除冰封50点并时序恢复1点冰封，持续50时序",
                                    -- by 飘夜
}

--newkdef[23玉露酒]=function()
ItemInfo[23]={
"Ｌ物品说明：名酒",
"Ｎ",
"Ｄ使用效果：解除灼烧20点并时序恢复1点灼烧，持续50时序",
                                    -- by 飘夜
}

--newkdef[24即墨老酒]=function()
ItemInfo[24]={
"Ｌ物品说明：名酒",
"Ｎ",
"Ｄ使用效果：解除流血50点并时序恢复1点流血，持续100时序",
                                    -- by 飘夜
}

--newkdef[25五宝花蜜酒]=function()
ItemInfo[25]={
"Ｌ物品说明：名酒",
"Ｎ",
"Ｄ使用效果：免疫所有攻击基础异常",
                                    -- by 飘夜
}

--newkdef[26莽牯朱蛤]=function()
ItemInfo[26]={
"Ｌ物品说明：万毒之王，百毒不侵，炼制地灵丹的材料之一",
"Ｎ",
"Ｄ使用效果：+100抗毒",
                                    -- by 飘夜
}

--newkdef[27通犀地龙丸]=function()
ItemInfo[27]={
"Ｌ物品说明：西毒炼制，百毒不侵",
"Ｎ",
"Ｄ使用效果：+100抗毒",
                                    -- by 飘夜
}


--newkdef[28飞蝗石]=function()
ItemInfo[28]={
"Ｌ物品说明：最普通的暗器",
"Ｎ",
"Ｄ使用效果：-30生命",
                                    -- by 飘夜
}

--newkdef[29飞刀]=function()
ItemInfo[29]={
"Ｌ物品说明：飞是小李飞刀的刀",
"Ｎ",
"Ｄ使用效果：-50生命",
                                    -- by 飘夜
}

--newkdef[30金蛇锥]=function()
ItemInfo[30]={
"Ｌ物品说明：金蛇郎君成名暗器",
"Ｎ",
"Ｄ使用效果：-80生命",
                                    -- by 飘夜
}

--newkdef[31霹雳弹]=function()
ItemInfo[31]={
"Ｌ物品说明：一硫二硝三碳调制而成",
"Ｎ",
"Ｄ使用效果：-100生命",
                                    -- by 飘夜
}

--newkdef[32毒蒺藜]=function()
ItemInfo[32]={
"Ｌ物品说明：球上有刺，刺上有毒",
"Ｎ",
"Ｄ使用效果：-40生命，+40中毒",
                                    -- by 飘夜
}

ItemInfo[33]={
"Ｌ物品说明：古墓派含毒之暗器",
"Ｎ",
"Ｄ使用效果：-60生命，+60中毒",
                                    -- by 飘夜
}

--newkdef[34冰魄银针]=function()
ItemInfo[34]={
"Ｌ物品说明：古墓派含毒之暗器",
"Ｎ",
"Ｄ使用效果：-70生命，+70中毒",
                                    -- by 飘夜
}

--newkdef[35黑血神针]=function()
ItemInfo[35]={
"Ｌ物品说明：日月神教暗器，含剧毒",
"Ｎ",
"Ｄ使用效果：生命-80，中毒+80",
                                    -- by 飘夜
}

--newkdef[36玄铁剑]=function()
ItemInfo[36]={
"Ｇ装备效果；玄铁剑法威力+100",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：使用玄铁剑法时，增加50%暴击率",
"Ｗ◇LV.2：使用玄铁剑法时，增加60%暴击率",
"Ｗ◇LV.3：使用玄铁剑法时，增加70%暴击率",
"Ｗ◇LV.4：使用玄铁剑法时，增加80%暴击率",
"Ｗ◇LV.5：使用玄铁剑法时，增加90%暴击率",
"Ｗ◇LV.6（MAX）：使用玄铁剑法时，必定暴击，并可发动“破尽天下”",                                  -- by 飘夜
}

--newkdef[37倚天剑]=function()
ItemInfo[37]={
"Ｇ装备效果；倚天剑法威力+200",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：攻击时50%几率造成流血效果",
"Ｗ◇LV.2：攻击时60%几率造成流血效果",
"Ｗ◇LV.3：攻击时70%几率造成流血效果",
"Ｗ◇LV.4：攻击时80%几率造成流血效果",
"Ｗ◇LV.5：攻击时90%几率造成流血效果",
"Ｗ◇LV.6（MAX）：攻击时必定造成流血效果", 
"Ｎ",
"Ｗ◇【倚天一出·谁于争锋】",
"Ｗ◇御剑能力>=200，(御剑系数*0.1)%概率增加一次连击，",                         
}

--newkdef[38流星剑]=function()
ItemInfo[38]={
"Ｇ装备效果；连击率+10%",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：连击率+10%",
"Ｗ◇LV.2：连击率+11%",
"Ｗ◇LV.3：连击率+12%",
"Ｗ◇LV.4：连击率+13%",
"Ｗ◇LV.5：连击率+14%",
"Ｗ◇LV.6（MAX）：连击率+15%",                                  -- by 飘夜
}

--newkdef[39白龙剑]=function()
ItemInfo[39]={
"Ｇ装备效果；苗家剑法威力+100",
"Ｎ",
"Ｄ装备等级：无",                           -- by 飘夜
}

--newkdef[40金蛇剑]=function()
ItemInfo[40]={
"Ｇ装备效果；金蛇剑法威力+200",
"Ｎ",
"Ｄ装备等级：无",                                             -- by 飘夜
}

--newkdef[41凝碧剑]=function()
ItemInfo[41]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",
                                 -- by 飘夜
}

--newkdef[42白虹剑]=function()
ItemInfo[42]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",
                                 -- by 飘夜
}

--newkdef[43屠龙刀]=function()
ItemInfo[43]={
"Ｇ装备效果；使用刀法武功攻击几率触发：",
"Ｎ",
"Ｗ◇【武林至尊·宝刀屠龙】",
"Ｗ◇必定造成流血且追加气攻,追加的气攻数值等于所使用刀法的威力",
"Ｗ◇【号令天下·莫敢不从】",
"Ｗ◇必定造成暴击",
"Ｗ◇屠龙刀法威力+500",
"Ｎ",
"Ｄ装备等级：无",
                              -- by 飘夜
}

--newkdef[44血刀]=function()
ItemInfo[44]={
"Ｇ装备效果；血刀刀法威力+200",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：攻击时，恢复造成伤害5%的血量",
"Ｗ◇LV.2：攻击时，恢复造成伤害6%的血量",
"Ｗ◇LV.3：攻击时，恢复造成伤害7%的血量",
"Ｗ◇LV.4：攻击时，恢复造成伤害8%的血量",
"Ｗ◇LV.5：攻击时，恢复造成伤害9%的血量",
"Ｗ◇LV.6（MAX）：攻击时，恢复造成伤害10%的血量",                                  -- by 飘夜
}

--newkdef[45冷月宝刀]=function()
ItemInfo[45]={
"Ｇ装备效果；胡家刀法威力+200",
"Ｎ",
"Ｄ装备等级：无",
                                  -- by 飘夜
}

--newkdef[46绿波香露刀]=function()
ItemInfo[46]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",
                               -- by 飘夜
}

--newkdef[47金刀]=function()
ItemInfo[47]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",
                                -- by 飘夜
}

--newkdef[48雁翎刀]=function()
ItemInfo[48]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",
                                 -- by 飘夜
}

--newkdef[49打狗棒]=function()
ItemInfo[49]={
"Ｇ装备效果；打狗棒法威力+200",
"Ｎ",
"Ｄ装备等级：无",
                                 -- by 飘夜
}

--newkdef[50伏魔杵]=function()
ItemInfo[50]={
"Ｇ装备效果；伏魔杖法威力+100",
"Ｎ",
"Ｄ装备等级：无",
                                -- by 飘夜
}

--newkdef[51金龙鞭]=function()
ItemInfo[51]={
"Ｇ装备效果；黄沙万里鞭法威力+200",
"Ｎ",
"Ｄ装备等级：无",
                                 -- by 飘夜
}

--newkdef[52鳄嘴剪]=function()
ItemInfo[52]={
"Ｇ装备效果；大剪刀威力+200",
"Ｎ",
"Ｄ装备等级：无",
                                 -- by 飘夜
}

--newkdef[53判官笔]=function()
ItemInfo[44]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",
                                -- by 飘夜
}

--newkdef[54亮银枪]=function()
ItemInfo[54]={
"Ｇ装备效果；破甲+10%",
"Ｎ",
"Ｄ装备等级：无",
                                 -- by 飘夜
}

--newkdef[55神山剑]=function()
ItemInfo[55]={
"Ｇ装备效果；神山剑法威力+200",
"Ｎ",
"Ｄ装备等级：无",
                                -- by 飘夜
}

--newkdef[56玄铁菜刀]=function()
ItemInfo[56]={
"Ｇ装备效果；西瓜刀法威力+200",
"Ｎ",
"Ｄ装备等级：无",
                                -- by 飘夜
}

--newkdef[57犽月]=function()
ItemInfo[57]={
"Ｇ装备效果；犽月流空威力+200",
"Ｎ",
"Ｄ装备等级：无",
                                  -- by 飘夜
}

--newkdef[58软猬甲]=function()
ItemInfo[58]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：减伤20点，被拳指系武功攻击时，使攻击方流血10点",
"Ｗ◇LV.2：减伤22点，被拳指系武功攻击时，使攻击方流血10点",
"Ｗ◇LV.3：减伤24点，被拳指系武功攻击时，使攻击方流血10点",
"Ｗ◇LV.4：减伤26点，被拳指系武功攻击时，使攻击方流血10点",
"Ｗ◇LV.5：减伤28点，被拳指系武功攻击时，使攻击方流血10点",
"Ｗ◇LV.6（MAX）：减伤30点，被拳指系武功攻击时，使攻击方流血10点",                                  -- by 飘夜
}

--newkdef[59乌蚕衣]=function()
ItemInfo[59]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：被攻击时，受到的内伤减少5点",
"Ｗ◇LV.2：被攻击时，受到的内伤减少6点",
"Ｗ◇LV.3：被攻击时，受到的内伤减少7点",
"Ｗ◇LV.4：被攻击时，受到的内伤减少8点",
"Ｗ◇LV.5：被攻击时，受到的内伤减少9点",
"Ｗ◇LV.6（MAX）：被攻击时，受到的内伤减少10点",                                  -- by 飘夜
}

--newkdef[60金丝背心]=function()
ItemInfo[60]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：被攻击时，受到的封穴减少5点",
"Ｗ◇LV.2：被攻击时，受到的封穴减少6点",
"Ｗ◇LV.3：被攻击时，受到的封穴减少7点",
"Ｗ◇LV.4：被攻击时，受到的封穴减少8点",
"Ｗ◇LV.5：被攻击时，受到的封穴减少9点",
"Ｗ◇LV.6（MAX）：被攻击时，受到的封穴减少10点",                                  -- by 飘夜
}

--newkdef[61鳄皮护甲]=function()
ItemInfo[61]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：每次行动结束后解毒25点",
"Ｗ◇LV.2：每次行动结束后解毒35点",
"Ｗ◇LV.3：每次行动结束后解毒45点",
"Ｗ◇LV.4：每次行动结束后解毒55点",
"Ｗ◇LV.5：每次行动结束后解毒65点",
"Ｗ◇LV.6（MAX）：每次行动结束后解毒75点",                                  -- by 飘夜
}

--newkdef[62佛心甲]=function()
ItemInfo[62]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：被攻击时，受到的灼烧减少50%",
"Ｗ◇LV.2：被攻击时，受到的灼烧减少60%",
"Ｗ◇LV.3：被攻击时，受到的灼烧减少70%",
"Ｗ◇LV.4：被攻击时，受到的灼烧减少80%",
"Ｗ◇LV.5：被攻击时，受到的灼烧减少90%",
"Ｗ◇LV.6（MAX）：被攻击时，免疫灼烧状态"                                  -- by 飘夜
}

--newkdef[63皮衣]=function()
ItemInfo[63]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：被攻击时，受到的冰封减少50%",
"Ｗ◇LV.2：被攻击时，受到的冰封减少60%",
"Ｗ◇LV.3：被攻击时，受到的冰封减少70%",
"Ｗ◇LV.4：被攻击时，受到的冰封减少80%",
"Ｗ◇LV.5：被攻击时，受到的冰封减少90%",
"Ｗ◇LV.6（MAX）：被攻击时，免疫冰封状态"                                  -- by 飘夜
}

--newkdef[64北冥神功]=function()
ItemInfo[64]={
"Ｌ习得内功：北冥神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇攻击时，50%几率吸取敌方7%当前内力（下限300）",
"Ｗ◇被攻击时，50%几率发动“北冥神功.百川入海”吸取敌方500点内力，5点怒气并",
"Ｗ  转移到自身",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击时，30%几率吸取敌方7%当前内力（下限300）",
"Ｗ◇被攻击时，50%几率触发“北冥真气”护体，提升800点气防（可叠加）",
"Ｗ◇增加300点内力硬上限（与吸星大法同类效果不叠加）",
"Ｗ *吸取内力时，提升自身内力上限",
"Ｗ◇(15+天书数量)%机率发动“北冥.气吞山河”特效吸怒20点(限主角)",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇逍遥御风：同时学有小无相功/北冥神功/八荒六合功，并完成特定剧情",
"Ｗ             *攻击与被攻击均有机会触发特效“逍遥御风”，累积点数",
"Ｗ             *当累积点数达到9点时，清空封穴",
"Ｗ             *此状态不会被杀气或封穴，直到人物下次行动时累积归零",
"Ｗ             *单次攻击累积“逍遥御风”上限为3次",

}

--newkdef[65吸星大法]=function()
ItemInfo[65]={
"Ｌ习得内功：吸星大法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇攻击时，50%几率吸取敌方7%当前内力（下限200）与少量体力",
"Ｗ◇被攻击时，50%几率发动“万物相吸.吸星大法”吸取敌方400点内力并转移到自身",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击时，30%几率吸取敌方7%当前内力（下限200）与少量体力",
"Ｗ◇增加300点内力硬上限（与北冥神功同类效果不叠加）",
"Ｗ *吸取内力时，提升自身内力上限",

"Ｎ",
"Ｄ组合效果：天魔功 + 吸星大法",
"Ｗ◇主运天魔功额外暴怒一次。",
}

--newkdef[66化功大法]=function()
ItemInfo[66]={
"Ｌ习得内功：化功大法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇攻击时，50%几率化去敌方5%当前内力（上限500，下限200），并强制上毒",
"Ｗ  16~20点",
"Ｗ◇被攻击时，50%几率发动“化功大法”化去敌方300点内力，并强制上毒",
"Ｗ  10~15点",

"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击时，30%几率化去敌方5%当前内力（上限500，下限200），并强制上毒",
"Ｗ  16~20点",
}

--newkdef[67紫霞秘笈]=function()
ItemInfo[67]={
"Ｌ习得内功：紫霞神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇行动结束后回复20%已消耗的内力（覆盖被动效果）",
"Ｗ◇使用剑系武功有50%的几率触发“紫霞剑气”追加1000气攻",
"Ｗ◇剑法出招概率+20%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇行动结束后回复10%已消耗的内力",
"Ｗ◇蓄力必成功，且蓄力效果持续多回合（初始为2回合，每获得7本天书，持续",
"Ｗ  回合数+1）",
"Ｗ◇使用剑系武功有25%的几率触发“紫霞剑气”追加1000气攻",
"Ｗ  触发紫霞蓄力时，无法同时触发蛤蟆，龙象等蓄力的效果",
"Ｗ◇剑法出招+10%",
"Ｗ◇太岳三清峰攻击力上升100点，使用太岳三清峰机率触发「西岳如立」",
"Ｎ",
"Ｄ一脉相承",
"Ｗ◇学习五岳剑诀一脉相承",

}

--newkdef[68混元功法]=function()
ItemInfo[68]={
"Ｌ习得内功：混元功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇每3时序回复1点体力（覆盖被动效果）",
"Ｗ◇造成的封穴效果提高20%",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇混元一气：同时修炼混元掌/混元功",
"Ｗ◇混元一气：攻击时追加5~15点内伤和5~15时序集气混乱",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇行动结束后回复少许内伤",
"Ｗ◇每6时序回复1点体力",
"Ｗ◇造成的封穴效果提高10%",

"Ｎ",
"Ｄ组合效果：混元功 + 蛤蟆功/鲸息功",
"Ｗ◇行动后回复100点生命值200点内力值和5点体力值","Ｗ◇随机获得一种药品BUFF","Ｗ◇每回合结束怒气+10","Ｗ◇内功天赋为蛤蟆功/鲸息功/混元功时10%概率爆怒一次。",

}

--newkdef[69狮吼功法]=function()
ItemInfo[69]={
"Ｌ习得内功：狮子吼",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇攻击时必定发动“狮子吼”，对全场内力低于自身1000点的敌人杀退",
"Ｗ  100点集气，且追加造成5-9点内伤",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击时50%几率发动“狮子吼”，对全场内力低于自身1000点的敌人杀退",
"Ｗ  50点集气",
"Ｎ",
"Ｄ一脉相承：",
"Ｗ◇金刚禅狮子吼",
"Ｎ",
"Ｚ特别说明：",  
"Ｗ◇河东狮吼：女性角色发动“狮子吼”效果翻倍，消耗180点内力",
}

ItemInfo[385]={
"Ｌ习得内功：金刚狮子吼",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇集气不会被杀到300以下",
"Ｗ  减少连击40%伤害、气攻",
"Ｗ◇行动前诵念金刚咒",
"Ｗ  七格范围内敌方伤害降低20%，受到伤害增加20%",
"Ｗ  20%几率敌方集气倒退200",
"Ｗ◇行动前诵念菩提咒",
"Ｗ  七格范围内我方伤害提高10%，受到伤害减少10%",
"Ｗ  七格范围内我方获得200点护盾",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇集气不会被杀到0以下",
"Ｗ  减少连击20%伤害、气攻",
"Ｗ  行动后免疫破绽",
"Ｗ  内伤上限降低成50",
}

--newkdef[70圣火神功]=function()
ItemInfo[70]={
"Ｌ习得内功：圣火神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇奇门招式+30%，奇门武功破防+10%",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇被攻击，降低50%本次攻击所造成的封穴（与其他同类效果乘法叠加）",
"Ｗ◇攻击时60%几率，无视对方集气条位置击中其破绽",
"Ｗ  在人物第一次行动之前是不会被击中破绽的",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇奇门招式+16%，奇门武功破防+6%",
"Ｗ◇进入战斗时的初始集气值+200~300",
"Ｗ◇攻击可造成‘观火’状态",
"Ｗ◇如行动前未移动或者移动格数未消耗完，可在行动后获得一次移动机会",
"Ｎ",
"Ｄ奇门武功：",
"Ｗ◇使用圣火神功攻击算奇门系数"
}

--newkdef[71神照经]=function()
ItemInfo[71]={
   "Ｌ习得内功：神照功",
   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇复活时的回复百分比由（35+天书数量）提高至（70+天书数量×2）",
   "Ｎ",
   "Ｄ被动效果：",
   "Ｗ◇首次被击退时，100%发动“神照功起死回生”复活，之后有6%的几率发动",
   "Ｗ◇复活时回复（35+天书数量）%的生命/耗损内力/耗损体力以及异常状态、",
   "Ｗ  集气值+500",
   "Ｎ",
   "Ｄ一脉相承：",
   "Ｗ◇长生诀",

}

--newkdef[72十八泥偶]=function()
ItemInfo[72]={
"Ｌ习得内功：罗汉伏魔功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇行动结束后恢复10%已损失的生命值（上限200）",
"Ｗ◇每时序额外回复1点流血",
"Ｗ◇被攻击时，降低60%本次攻击所造成的内伤",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇行动结束后恢复5%已损失的生命值（上限100）",
"Ｗ◇本内功加力时发动“罗汉伏魔”，根据以下公式提升伤害与杀气[高优先级]",
"Ｗ  罗汉伏魔提升伤害和杀气效果为：[(当前内力值/30000)+(武功消耗内力/2000)]%",
"Ｗ  同时学有易筋神功+罗汉伏魔功，主运【易筋神功】攻击时必出“罗汉伏魔”",
"Ｗ◇被攻击时，降低60%本次攻击所造成的内伤",
"Ｎ",
"Ｄ世尊降魔(组合特效)：",
"Ｗ◇修炼<伏魔杖法><金刚伏魔圈><无上大力杵><罗汉伏魔功>领悟“世尊降魔”",
"Ｗ◇效果：暴击率增加50%",
"Ｗ◇追加气功/20点伤害，暴怒追加气功/15点伤害",
"Ｗ◇伤害低于100则伤害增加100",
"Ｄ罗汉金身(组合特效)：",
"Ｗ◇学会罗汉伏魔功、金刚不坏体",
"Ｗ◇受到第一次的伤害概率减伤50%",

"Ｎ",
"Ｄ组合效果：擒龙功 + 罗汉伏魔功",
"Ｗ◇飞龙 集气位置不会低于250，暴怒时集气速度3倍",
"Ｗ◇潜龙 行动后几率自动防御，防御状态下集气位置不会低于500 ",
"Ｗ◇亢龙 攻击时按照暴击计算",
"Ｗ◇双龙 几率连击次数翻倍，如果连击被打断，伤害计算到下次攻击",
"Ｗ◇狂龙 自身气攻越高，伤害越高",
"Ｗ◇擒龙奥义·困龙升天 攻击时几率附加负面状态给敌人 ",
"Ｗ◇乔峰学会擒龙功就有以上效果、洪七公学会且主运擒龙功才有以上效果",

"Ｎ",
"Ｄ组合效果：金刚不坏体 + 罗汉伏魔功",
"Ｗ◇被攻击时减伤80点伤害,30%概率减伤150-250。20%概率减伤50%。",

"Ｎ",
"Ｄ组合效果：伏魔杖法 + 罗汉伏魔功",
"Ｗ◇伏魔杖法·大鹏展翅 攻击触发全屏锁足",
"Ｗ◇伏魔杖法·秦王鞭石 攻击触发5*5范围攻击，必封穴、流血、冰封、灼烧",
"Ｗ◇伏魔杖法·罗汉护法 以自身所剩内力的50%、怒气为基础触发杀气伤害，当自身怒气大于0时，所有攻击提升20%",
"Ｗ◇伏魔杖法·拨云见日 每次攻击增加怒气5点，怒气增长速度为双倍",
"Ｗ◇攻击根据自身特系兵器值的1/2为附加伤害",
"Ｗ◇以上效果达摩使用伏魔杖法即可触发效果，其他人物学会罗汉伏魔功、伏魔杖法后即可触发，无需主运",
}

--newkdef[73蛤蟆功法]=function()
ItemInfo[73]={
"Ｌ习得内功：蛤蟆功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇蓄力必成功，并同时执行防御指令，且下回合集气+300",
"Ｗ◇强化蓄力效果，伤害加成从25%提升至50%，气攻加成从600提升至1200",
"Ｗ◇每时序增加1点怒气",
"Ｗ◇被攻击时，降低30%本次攻击所造成的内伤",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇无其他内功护体时，必定触发蛤蟆功护体气防提升900点",
"Ｗ◇受攻击时触发“蛤蟆功.蓄力”，累计蓄力值",
"Ｗ◇蓄力值满100后，下次攻击时可发动“蟾震九天”，根据蓄力值追加气攻",
"Ｄ一脉相承：",
"Ｗ◇鲸息功",

"Ｎ",
"Ｄ组合效果：混元功 + 蛤蟆功/鲸息功",
"Ｗ◇行动后回复100点生命值200点内力值和5点体力值","Ｗ◇随机获得一种药品BUFF","Ｗ◇每回合结束怒气+10","Ｗ◇内功天赋为蛤蟆功/鲸息功/混元功时10%概率爆怒一次。",

}

--newkdef[74乾坤大挪移]=function()
ItemInfo[74]={
"Ｌ习得内功：乾坤大挪移",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇内力高于对方时,被攻击75%几率触发“乾坤大挪移反弹”反弹30%伤害",
"Ｗ◇被攻击，降低50%本次攻击所造成的封穴（与其他同类效果乘法叠加）",
"Ｗ◇每时序额外回复1点流血",
"Ｗ◇被攻击时，降低60%本次攻击所造成的内伤",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇内力高于对方时,被攻击(40+天书)%几率触发“乾坤大挪移反弹”反弹20%伤害",
"Ｎ",
"Ｇ我方专属效果：",
"Ｗ◇每获得一本天书，触发反弹几率+3%（包括主动及被动）",
}

--newkdef[75小无相功]=function()
ItemInfo[75]={
"Ｌ习得内功：小无相功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇总气防提升30%",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇“无我无相”，攻击与被攻击时，兵器值判定必定不低于敌方",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇总气防提升10%",
"Ｗ◇降低修炼武功兵器值需求10点、降低兵器装备需求兵器值10点",
"Ｗ◇小无相功加力时，必定发动武功招式（降龙、六脉无效）",
"Ｗ *战斗结束后获得的经验值翻倍",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇逍遥御风：同时学有小无相功/北冥神功/八荒六合功，并完成特定剧情",
"Ｗ             *攻击与被攻击均有机会触发特效“逍遥御风”，累积点数",
"Ｗ             *当累积点数达到9点时，清空封穴",
"Ｗ             *此状态不会被杀气或封穴，直到人物下次行动时累积归零",
"Ｗ             *单次攻击累积“逍遥御风”上限为3次",
"Ｎ",

}

--newkdef[76纯阳无极功]=function()
ItemInfo[76]={
"Ｌ习得内功：纯阳无极功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每时序回复1点中毒",
"Ｗ◇降低武功内力消耗60%",
"Ｗ◇每时序额外回复1点冰封",
"Ｗ◇【男性专属】减伤气防增加20%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇降低武功内力消耗50%",
"Ｗ◇被攻击时，降低50%本次攻击所造成的冰封",

}

--newkdef[77先天功秘笈]=function()
ItemInfo[77]={
"Ｌ习得内功：先天功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇被攻击时，降低30%本次攻击所造成的内伤",
"Ｗ◇行动前发动“先天调息”，获得一次休息效果",
"Ｗ◇被杀气到-500位置的时候，回复10%生命最大值，集气位置归零",
"Ｗ◇“先天罡气”：攻击时清除目标的蓄力效果，",
"Ｗ  进入战场触发先天罡气护盾 抵消500点伤害，",
"Ｗ  护盾被击破后5个回合后概率再次生成",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇每时序回复1点生命，2点内力",
"Ｗ◇被杀气到-500位置的时候，身上所有内伤清零",
"Ｗ◇被杀气到-500位置的时候，回复5%生命最大值，集气位置归零",
"Ｗ *同时学有先天功+玉女心经，每时序额外回复1点封穴",

}

--newkdef[78辟邪剑谱]=function()
ItemInfo[78]={
"Ｌ习得外功：辟邪剑法",
"Ｎ",
"Ｗ武功威力：140",
"Ｗ武功气攻：随招式变化",
"Ｗ内力消耗：70",
"Ｗ武功范围：米 1+3格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇习得葵花神功后，武功威力提高至1200",
"Ｗ◇习得葵花神功后，必定触发特效“真辟邪剑法·葵花刺目”",
"Ｗ◇被刺目的敌人，本场战斗伤害和杀气均下降15%，攻击时有20%几率落空",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇飞燕穿柳，伤害+100，主运葵花必连击",
"Ｗ◇花开见佛，命中目标虚弱状态50时序",
"Ｗ◇锺馗抉目，必刺目，目标100%概率MISS",
"Ｗ◇扫荡群魔，大范围面攻，如果有流血，则时序损失目标0.5%生命值",
"Ｗ◇紫气东来，最小3连~最大4连击，下回合不可攻击，如果有击杀，则无负面影响",
}

--newkdef[79八荒六合功]=function()
ItemInfo[79]={
"Ｌ习得内功：八荒六合功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇被攻击时，60%几率触发护体气盾，吸收33.3%所受伤害，并回复等量内力",
"Ｗ◇防御状态下，被攻击额外减伤20%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇防御时的效果加成由25%提升至40%，气防由500提升至1000",
"Ｗ◇免疫难5以上NPC根据伤害高低所追加的杀气及龙象的追加杀气",
"Ｗ◇被攻击时，20%几率触发护体气盾，吸收33.3%所受伤害，并回复等量内力",
"Ｗ *触发八荒六合功护体时，必定发动护体气盾减伤",
"Ｗ◇防御状态下，被攻击额外减伤10%",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇逍遥御风：同时学有小无相功/北冥神功/八荒六合功，并完成特定剧情",
"Ｗ             *攻击与被攻击均有机会触发特效“逍遥御风”，累积点数",
"Ｗ             *当累积点数达到9点时，清空封穴",
"Ｗ             *此状态不会被杀气或封穴，直到人物下次行动时累积归零",
"Ｗ             *单次攻击累积“逍遥御风”上限为3次"
}

--newkdef[80太玄经]=function()
ItemInfo[80]={
"Ｌ习得内功：太玄神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇攻击时，有50+（天书数*2+实战/25）%的几率发动“太玄之重”，不造成怒气",
"Ｗ◇发动“太玄之重”时，若敌方已暴怒，则有50+（天书数*2+实战/25）%的几率",
"Ｗ  发动“救赵挥金锤.邯郸先震惊”，使敌方怒气值降低20点",
"Ｗ◇被攻击时，有40%的几率发动“太玄之轻”，将被杀气值转换成提升集气值",
"Ｗ◇发动“太玄之轻”时，免疫内伤和普通中毒",
"Ｗ◇攻击时造成的怒气降低50%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击时，体力消耗减少2点",
"Ｗ◇高优先级提升战场五系系数40%",
"Ｗ◇防御时触发“防御开始.太玄蓄力”，防御的同时执行蓄力指令",

}

--newkdef[81龙象般若功]=function()
ItemInfo[81]={
"Ｌ习得内功：龙象般若功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇高优先级提升10%伤害、降低10%所承受伤害",
"Ｗ◇人物每次行动前自动进行蓄力",
"Ｗ◇“龙象之力”的追加气攻随自身怒气值提高而提高；暴怒时，无视敌方绝对气防",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇“龙之蓄力·象之防御”，蓄力必成功，并同时执行防御指令",
"Ｗ◇使50%攻击伤害转化为额外杀气（需破对方气防才能生效）",
"Ｗ◇攻击时有60%几率发动“龙象之力”，追加1000气攻",
"Ｄ组合特效：",
"Ｗ◇金刚般若：学会大力金刚掌、般若掌、易筋神功，破防目标30%",
"Ｗ◇大力金刚掌必暴击,般若掌攻击范围变成点，威力提高。",
"Ｗ◇主运易筋神功，概率对敌方附加【业力引爆】效果。",

}

--newkdef[82逆运真经]=function()
ItemInfo[82]={
"Ｌ习得内功：逆运经脉",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇被攻击时，降低30%本次攻击所造成的内伤",
"Ｗ◇暴击率提高50%",
"Ｗ◇暴击的攻击效果增加20%",
"Ｗ◇每时序回复1点中毒",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇每6时序回复1点体力",
"Ｗ◇减少暴击伤害30%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇免疫封穴10点",
"Ｗ◇集气概率向前跳跃50时序，学会九阴后跳跃100时序",
"Ｗ◇暴击率提高30%",
"Ｗ◇暴击伤害增加10%",
"Ｎ",
"Ｄ特别说明：",
"Ｗ◇学有逆运真经，进入战场后会进入「逆运走火状态」，此状态下攻击有机率",
"Ｗ◇二连、大幅增加暴击机率，自身集气速度会在0.8~1.5倍之间跳跃。",
"Ｗ◇逆运走火状态同时学有九阴时，取消集气跳跃，改为固定＋10。",
"Ｗ◇若学有逆运蛤蟆组合并主运逆运，则逆运走火变为「逆运暴走状态」。",
"Ｗ◇逆运暴走：必二连、必然大幅增加暴击率，大幅增加加力护体机率，自身集气在2~2.5倍之间跳跃。",

}

--wkdef[83九阳真经]=function()
ItemInfo[83]={
"Ｌ习得内功：九阳神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇【阳内专属】高优先级降低30%所承受伤害（不与被动叠加）",
"Ｗ◇【阳内专属】内力消耗降低70%",
"Ｗ◇【阳内专属】每7时序自动解除自身封穴",
"Ｗ◇【阳内专属】每时序回复6点内力值",
"Ｗ◇每时序额外回复1点冰封",
"Ｗ◇每时序回复1点中毒",
"Ｗ◇每3时序回复1点内伤（内伤大于50时，效果加倍）",
"Ｗ◇【氤氲紫气】伤害大于99时，如果伤害大于199减伤99点，否则减伤66点",
"Ｗ◇【阳内专属】行动前发动“九阳.抱元守一” 清除自身所有不良状态",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇【阳内专属】高优先级降低15%所承受伤害",
"Ｗ◇【阳内专属】灼烧系武功必出灼烧",
"Ｗ◇【阳内专属】被攻击有（20+天书数×3）%几率，发动“九阳真气”提升",
"Ｗ   650点气防（可叠加）",
"Ｗ *同时学有九阳神功+九阴神功，可获得“森罗万象”的特效，免疫敌方暴击",
"Ｗ  的额外伤害，以及会心一击的额外气攻",

"Ｎ",
"Ｄ组合特效：九阳神功 + 两个阳内内功",
"Ｗ◇九阳护盾：自带九层九阳护盾，被攻击时一层护盾抵消一次伤害，30时序恢复一","Ｗ◇层护盾",
"Ｗ◇生生不息：内力不会低于30%，低于30%自动恢复",
"Ｗ◇抱元守一：休息后恢复生命、内力、体力、内伤、中毒值",
"Ｗ◇氤氲紫气：被攻击后根据伤害恢复生命、内力、气防值",
"Ｗ◇诸法不侵：被攻击后强制反弹封穴，自己封穴值清0",
"Ｗ◇九阳神功反震：根据自身内力值来反弹伤害并且自身集气速度上升",
"Ｗ◇他强由他强·清风拂山岗：被攻击时绝对气防，若受到的攻击大于150点会消耗自","Ｗ◇身500内力值来降低80%的伤害",
"Ｗ◇他横任他横·明月照大江：被攻击时根据敌方1/4的攻击反弹给对方",
"Ｗ◇他自狠来他自恶·我自一口真气足：被攻击强制减伤80%",
"Ｗ◇被攻击后杀气转变为集气，攻击必灼烧，攻击后自身恢复10点内力，如果保持阳","Ｗ◇性内力所有武功伤害增加40%，时序恢复生命、内力，如果自身处于受伤状态恢复加倍",

}

--newkdef[84九阴真经]=function()
ItemInfo[84]={
"Ｌ习得内功：九阴神功",
"Ｄ运功效果：",
"Ｗ◇【阴内专属】提升20%伤害",
"Ｗ◇【阴内专属】连击率提高50%",
"Ｗ◇【阴内专属】每时序额外回复5点生命值",
"Ｗ◇【阴内专属】第一击必定触发,连击30%概率触发“九阴破体”无视目标20%防御",
"Ｗ◇每时序额外回复1点灼烧",
"Ｗ◇每6时序回复1点体力",
"Ｗ◇每3时序回复1点内伤（内伤大于50时，效果加倍）",
"Ｄ被动效果：",
"Ｗ◇【阴内专属】高优先级降低10%所承受伤害",
"Ｗ◇【阴内专属】冰封系武功必出冰封",
"Ｗ◇【阴内专属】被攻击有（20+天书数×3）%几率，发动“九阴真气”提升",
"Ｗ   650点气防（可叠加）",
"Ｗ◇【阴内专属】攻击时概率触发“飞絮劲”攻击必中，并附加100点伤害，暴怒必触发",
"Ｗ  同时学有九阴神功+九阳神功，可获得“森罗万象”的特效，免疫敌方暴击",
"Ｗ  的额外伤害，以及会心一击的额外气攻",
"Ｄ组合特效1：",
"Ｗ◇主运九阴神功使用九阴白骨爪必触发九阴神爪极意",
"Ｗ◇九阴神爪极意：必连击，增加1500点伤害杀气，范围为7*7",
"Ｗ  (黄衫女与黄赏有连击次数增加，具体看人物天赋)",
"Ｄ组合特效2：九阴三阴（主运九阴，学有两个额外阴内内功）",
"Ｎ",
"Ｄ组合特效：九阴神功 + 九阴白骨爪",
"Ｎ",
}

--newkdef[85易筋经]=function()
ItemInfo[85]={
"Ｌ习得内功：易筋神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇被攻击时，40%几率触发“易筋真谛”绝对气防",
"Ｗ◇每3时序回复1点内伤（内伤大于50时，效果加倍）",
"Ｗ◇每时序回复1点中毒",
"Ｗ◇同时学有易筋神功+罗汉伏魔功，攻击时必出“罗汉伏魔”特效",
"Ｗ *此状态触发的“罗汉伏魔”，且有1.1倍效果",
"Ｗ◇同时学有易筋神功+金刚不坏体，被攻击必出“金刚不坏”特效",
"Ｗ◇少林武功威力+200",
"Ｗ◇每时序回复6点内力值",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇战场三围增加30%",
"Ｗ◇每时序额外回复1点封穴",
"Ｗ◇使用罗汉掌，60%几率触发“般若掌”伤害+50",
"Ｗ◇使用大力金刚掌，40%几率触发“达摩掌”伤害+100",
"Ｗ◇被攻击有（20+天书数×3）%几率，发动“易筋真气”提升650点气防（可叠加）",
}

--newkdef[86降龙十八掌]=function()
ItemInfo[86]={
"Ｌ习得外功：降龙十八掌",
"Ｎ",
"Ｗ武功威力：750",
"Ｗ武功气攻：1500",
"Ｗ内力消耗：490",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ招式特效：（实际拳掌系数/14，最大25%；拳主和乔峰/10，最大35%）",
"Ｗ◇双龙取水：攻击两次",
"Ｗ◇亢龙有悔：无视目标防御30%",
"Ｗ◇潜龙勿用：行动后自动防御",
"Ｗ◇震惊百里：对目标造成昏迷",
"Ｗ◇飞龙在天：下回合速度增加50%",
"Ｗ◇见龙在田：必中，造成的伤害增加200",
"Ｗ◇时乘六龙：连击加1",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇盖世无双：需同时修炼降龙十八掌与打狗棒法到极",
"Ｗ◇盖世无双：被攻击时，有50%几率绝对气防",
"Ｗ◇降龙十八掌·极意：限拳系主角、萧峰、郭靖、洪七公",
"Ｗ◇降龙十八掌·极意：攻击范围变成面攻，无误伤，气攻提升至2300",
"Ｗ◇降龙十八掌·三叠浪：限拳系主角、萧峰，降龙十八掌几率三连击",
"Ｗ◇降龙十八掌·三叠浪：拳系主角暴怒是几率触发（资质/4+25%）",
"Ｗ◇降龙十八掌·三叠浪：萧峰几率触发，暴怒必定触发",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇出招式攻击范围变大",                       --飘夜
"Ｗ◇习得打狗棒法后，再学习降龙十八掌的需求降低40点",
"Ｗ◇有余不尽：拳系大于200后使用降龙攻击几率触发6连击，暴怒必出",
"Ｗ◇亢龙有悔：拳系大于200后使用降龙攻击几率是敌人处于昏迷状态，暴怒必出",
}

--newkdef[87黯然销魂掌]=function()
ItemInfo[87]={
"Ｌ习得外功：黯然销魂掌",
"Ｎ",
"Ｗ武功威力：750",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：490",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ招式特效：（实际拳掌系数/28，最大15%；拳主和杨过/20，最大21%）",
"Ｗ根据损失生命值额外提升出招概率，最大50%",
"Ｗ◇行尸走肉：封印敌人攻击能力一回合",
"Ｗ◇无中生有：自身回合结束后再次行动",
"Ｗ◇六神不安：敌人集气混乱20时序，行动混乱一回合",
"Ｗ◇倒行逆施：攻击时敌人按负系数计算",
"Ｗ◇穷途末路：追加自身损失生命值20%的伤害",
"Ｗ◇饮恨吞声：下回合敌人攻击时会损失伤害同等的生命",
"Ｎ",
"Ｚ特别说明：无",                                --飘夜


}

--newkdef[88须弥山神掌]=function()
ItemInfo[88]={
"Ｌ习得外功：须弥山神掌",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：420",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带灼烧", 
"Ｗ◇对生命值低于50%的目标概率附加目标最大生命值8%的伤害 对生命值低于10%的目标概率直接斩杀",                                        --飘夜
}

--newkdef[89七伤拳谱]=function()
ItemInfo[89]={
"Ｌ习得外功：七伤拳",
"Ｎ",
"Ｗ武功威力：540",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：350",
"Ｗ武功范围：■ 5+5×5",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇一震七伤:无视敌方气防追加17点内伤",
"Ｗ◇使用七伤拳攻击，几率触发（暴怒必触发）",
"Ｗ◇自身内力<5000时，每个目标都会反伤自己内伤+7",
"Ｎ",
"Ｚ特别说明：无",                                --飘夜
}

--newkdef[90大力金刚掌]=function()
ItemInfo[90]={
"Ｌ习得外功：大力金刚掌",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：350",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇达摩掌：同时修炼易筋神功后，使用大力金刚掌40%几率触发",
"Ｗ◇达摩掌：提高100伤害",
"Ｄ组合特效：",
"Ｗ◇金刚般若：学会大力金刚掌、般若掌、龙象般若功，破防目标30%",
"Ｗ◇大力金刚掌必暴击,般若掌攻击范围变成点，威力提高。",
"Ｗ◇主运龙象般若功，概率触发【十龙十象】击晕目标。",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇附带灼烧", 
"Ｚ一脉相承：",
"Ｗ◇学会罗汉拳，满足条件可一脉相承大力金刚掌",                                        --飘夜
}

--newkdef[91玄冥神掌]=function()
ItemInfo[91]={
"Ｌ习得外功：玄冥神掌",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：350",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇玄冥·极意：主角攻击时有40%几率触发，暴怒必定触发",
"Ｗ◇玄冥·极意：攻击范围变为面攻，攻击无误伤，并追加1500气攻",
"Ｗ◇增加暴击率",
"Ｗ◇附带冰封、中毒（30）",                                --飘夜
"Ｄ组合特效：",
"Ｗ◇紫气天罗：同时学有寒冰绵掌+化骨绵掌or玄冥神掌",
"Ｗ◇紫气天罗：攻击随机附加1~3层“冰冻状态”，每层减缓1%集气速度，上限50层",
"Ｗ◇紫气天罗：被攻击时冻结敌人5时序",
"Ｗ◇紫气天罗：寒冰绵掌/化骨绵掌/玄冥神掌威力提升300点",
}

--newkdef[92龙爪手]=function()
ItemInfo[92]={
"Ｌ习得外功：龙爪手",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：210",
"Ｗ武功范围：米 5格",

"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高几率流血",                                         --飘夜

"Ｎ",
"Ｄ组合特效：学有龙爪手，成为星宿派掌门",
"Ｗ◇1. ：爪影重重：攻击时机率打出大极意范围",
"Ｗ◇2. ：星宿派的淬毒手效果独立判定触发机率，并可与门派效果叠加。",
"Ｗ◇3. ：攻击时机率为对手附加「九死毒劲」，此毒有以下效果：",
"Ｄ◇a. 敌方中毒上限为300",
"Ｄ◇b. 每攻击一次，毒劲增加一道，并根据毒劲数有以下效果：",
"Ｗ◇1-3道：机率打空。",
"Ｗ◇4-6道：打空机率上升，且打空时给自己附加蛊毒、剧毒效果",
"Ｗ◇7-9道：打空机率不变，但打空时会根据自身中毒量扣减自身血量，并且对全场敌方","Ｗ◇附加剧毒、毒击以及杀气效果。",
"Ｄ◇c. 插件：",
"Ｗ◇i. 学有鹰爪功，集气速度恒增加10点。被攻击时有10%机率闪避。",
"Ｗ◇ii. 学有九阴白骨爪，则机率对敌方附加「撕裂」和等同于中毒值的流血值。",
"Ｗ◇iii. 三爪齐全并练有化功大法：必定三连击。",
"Ｗ◇若敌方中毒程度超过100，指系数低于我方时，机率将对方的内力打空并上满中毒。","Ｗ◇若敌方血量低于20%，低机率秒杀。",
"Ｗ◇4. 必定触发化功大法，并强化上毒效果。	",
}

--newkdef[93葵花宝典]=function()
ItemInfo[93]={
"Ｌ习得内功：葵花神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇体力消耗-2",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇每5时序回复1点体力",
"Ｗ◇基础集气速度提升20%",
"Ｗ◇被攻击，30%的几率发动“葵花移形”，降低30%的所受伤害和杀气",
"Ｗ◇攻击20%机率触发“葵花刺目”：给敌添加肓目BUFF，20%机率攻击MISS", 
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇集气速度+3",
"Ｗ◇攻击40%机率触发“葵花点穴手”：增加气攻1000必封穴",
"Ｗ◇习得葵花神功后，辟邪剑法可发挥出真实威力",

"Ｎ",
"Ｚ特别说明：",
"Ｗ◇正常人需自宫后方可修炼",
"Ｗ◇标主剑神可无视条件修炼",
"Ｗ◇笑傲线打赢葵花尊者后可修炼到葵花奥义【空蝉】：被攻击概率闪现到攻击范围外"
}

--newkdef[94幻阴指法]=function()
ItemInfo[94]={
"Ｌ习得外功：幻阴指",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：315",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带冰封、中毒（40）",                                         --飘夜
}

--newkdef[95弹指神通]=function()
ItemInfo[95]={
"Ｌ习得外功：弹指神通",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：350",
"Ｗ武功范围：米 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇桃花绝技：同时修炼弹指/落英/玉箫到极，三种武功威力+200",
"Ｗ◇桃花绝技：40%几率三连击，暴怒必出",
"Ｗ◇桃花绝技：弹指神通：必暴击，气攻+1500",
"Ｗ◇桃花绝技：落英神剑掌：攻击范围变为可移动，并根据敌方内力耗损量增加伤害",
"Ｗ◇桃花绝技：玉箫剑法：攻击距离提升至8格，有60%几率冰封",
"Ｗ◇修炼其中之一后，修炼其余两个的兵器值需求-10",
"Ｗ◇弹指神通·无影神石：使用弹指神通攻击发动",
"Ｗ◇弹指神通·无影神石：追加1000气攻，追加高几率流血，提高60%暴击率",
"Ｗ◇弹指神通·无影神石：黄药师、谢烟客发动时必定暴击",
"Ｗ◇弹指神通·无影神石：*必须学会桃花绝技",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇高几率封穴",                                         --飘夜
}

--newkdef[96一阳指法]=function()
ItemInfo[96]={
"Ｌ习得外功：一阳指",
"Ｎ",
"Ｗ武功威力：560",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：245",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇一指破蟾：一阳指可以克制蛤蟆功",
"Ｗ◇一指破蟾：可以清除对方身上50%蛤蟆功蓄力值",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇六脉神剑招式几率提升至60%",
"Ｗ◇增加暴击率",
"Ｗ◇附带灼烧、高封穴",                                         --飘夜

"Ｎ",
"Ｄ组合特效：六脉神剑 + 一阳指",
"Ｗ◇少商剑 必冰封，根据攻击者指法系数的33%附加伤害，每次攻击触发内伤25点",
"Ｗ◇商阳剑 必灼烧，根据被攻击者的2被内伤附加伤害，6倍内伤削减内力",
"Ｗ◇中冲剑 根据内力和生命值之差附加流血值和伤害，在根据自身最大生命值增加杀气",
"Ｗ◇关冲剑 根据敌人的冰封、灼烧的6倍总和增加伤害",
"Ｗ◇少冲剑 攻击翻倍，封印1回合，利刃寒锋10时序",
"Ｗ◇少泽剑 攻击翻倍，点燃、沉睡1回合",
"Ｗ◇六脉剑气 攻击时触发全体敌人减6点体力，封穴附加30-50点",
"Ｗ◇攻击必连击，30%三连击，攻击时敌人的的防御按0计算",
"Ｗ◇以上效果段誉学会六脉即可触发，其他人物学会六脉、一阳后用六脉攻击时即可触发",
}

--newkdef[97太极拳经]=function()
ItemInfo[97]={
"Ｌ习得外功：太极拳",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：70",
"Ｗ武功范围：十 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇太极奥义：同时修炼太极拳和太极剑法到极",
"Ｗ◇太极奥义：被攻击时有（资质/4+45）%的几率触发，降低35%所受到的杀气",
"Ｗ◇太极奥义：触发太极奥义时，有35%的几率触发“太极真义·四两拨千斤”",
"Ｗ            完全绝对气防",
"Ｗ◇太空卸劲：同时修炼太极拳和空明拳到极",
"Ｗ◇太空卸劲：被攻击时35%几率减伤1/3，并降低攻击方行动后的集气位置120",
"Ｎ",
"Ｄ组合特效：",
"Ｚ◇<开太极>",
"Ｗ◇主运太极神功，使用太极拳法或太极剑法",
"Ｗ◇蓄力值超过500且暴怒触发",
"Ｗ◇根据当前生命值跟内力值追加大范围伤害，生命越低/内力越高伤害越高",

}

--newkdef[98空明拳谱]=function()
ItemInfo[98]={
"Ｌ习得外功：空明拳",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：140",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇太空卸劲：同时修炼太极拳和空明拳到极",
"Ｗ◇太空卸劲：被攻击时35%几率减伤1/3，并降低攻击方行动后的集气位置120",
"Ｎ",
"Ｚ特别说明：无",  
"Ｗ◇增加连击率",                                        --飘夜
}

--newkdef[99天山折梅手]=function()
ItemInfo[99]={
"Ｌ习得外功：天山折梅手",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：140",
"Ｗ武功范围：▽ 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇天山折梅：天山折梅手修炼到极后，每多一个其他武功到极：",
"Ｗ◇天山折梅：气攻增加100（对所有人有效，此处有具体提示）",
"Ｗ◇天山折梅：威力增加50（仅对虚竹/无崖子/天山童姥/李秋水有效）",
"Ｎ",
"Ｚ特别说明：无",                                  --飘夜
}

ItemInfo[100]={
"Ｌ习得外功：铁掌",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：105",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇铁甲依然在：同时修炼铁掌/铁剑/铁布衫",
"Ｗ◇铁甲依然在：护甲提升20%，被攻击时20%几率抵挡生命最大值2%伤害",
"Ｎ",
"Ｚ特别说明：", 
"Ｗ◇强上内伤：使用铁掌攻击，几率触发",
"Ｗ◇强上内伤：无视对方气防追加12-15点内伤",                                 --飘夜
}

ItemInfo[101]={
"Ｌ习得外功：落英神剑掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：900",
"Ｗ内力消耗：105",
"Ｗ武功范围：十 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇桃花绝技：同时修炼弹指/落英/玉箫到极，三种武功威力+200",
"Ｗ◇桃花绝技：40%几率三连击，暴怒必出",
"Ｗ◇桃花绝技：弹指神通：必暴击，气攻+1500",
"Ｗ◇桃花绝技：落英神剑掌：攻击范围变为可移动，并根据敌方内力耗损量增加伤害",
"Ｗ◇桃花绝技：玉箫剑法：攻击距离提升至8格，有60%几率冰封",
"Ｗ◇修炼其中之一后，修炼其余两个的兵器值需求-10",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇高几率封穴",                                         --飘夜
}

ItemInfo[102]={
"Ｌ习得外功：九阴白骨爪",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：105",
"Ｗ武功范围：米 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇主运九阴神功使用九阴白骨爪必触发九阴神爪极意",
"Ｗ◇九阴神爪极意：必连击，增加1500点伤害杀气，范围为7*7",
"Ｗ  (黄衫女与黄赏有连击次数增加，具体看人物天赋)",
"Ｚ特别说明：无",                                  --飘夜
}

ItemInfo[103]={
"Ｌ习得外功：百花错拳",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：800",
"Ｗ内力消耗：70",
"Ｗ武功范围：■ 5+7×7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",
"Ｗ◇增加连击率",                             --飘夜
}

ItemInfo[104]={
"Ｌ习得外功：灵蛇拳",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：800",
"Ｗ内力消耗：70",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带冰封、中毒(10)",                                         --飘夜
}

ItemInfo[105]={
"Ｌ习得外功：天山六阳掌",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：900",
"Ｗ内力消耗：7",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带灼烧", 

                                        --飘夜
}

--newkdef[106绵掌掌谱]=function()
ItemInfo[106]={
"Ｌ习得外功：绵掌",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：700",
"Ｗ内力消耗：28",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高连击",                                         --飘夜
}

--newkdef[107美女拳法]=function()
ItemInfo[107]={
"Ｌ习得外功：美女拳法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：700",
"Ｗ内力消耗：14",
"Ｗ武功范围：■ 4+7×7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                        --飘夜
}

--newkdef[108寒冰绵掌]=function()
ItemInfo[108]={
"Ｌ习得外功：寒冰绵掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：35",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带冰封、中毒(10)",                                         --飘夜
"Ｄ组合特效：",
"Ｗ◇紫气天罗：同时学有寒冰绵掌+化骨绵掌or玄冥神掌",
"Ｗ◇紫气天罗：攻击随机附加1~3层“冰冻状态”，每层减缓1%集气速度，上限50层",
"Ｗ◇紫气天罗：被攻击时冻结敌人5时序",
"Ｗ◇紫气天罗：寒冰绵掌/化骨绵掌/玄冥神掌威力提升300点",
}

--newkdef[109鹰爪功法]=function()
ItemInfo[109]={
"Ｌ习得外功：鹰爪功",
"Ｎ",
"Ｗ武功威力：375",
"Ｗ武功气攻：700",
"Ｗ内力消耗：35",
"Ｗ武功范围：米 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高几率流血",                                         --飘夜
}

--newkdef[110五毒秘传]=function()
ItemInfo[110]={
"Ｌ习得外功：五毒神掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：21",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带冰封、中毒(20)", 
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇毒布武林：同时修炼五毒神掌/五毒神功/冰蚕毒掌or千蛛万毒手/连环腐尸毒/五毒神功",
"Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
"Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
}

--2
--newkdef[111逍遥游]=function()
ItemInfo[111]={
"Ｌ习得轻功：逍遥游",
"Ｄ主运效果：",
"Ｗ◇基础：被连击、暴击时，降低50%连击、暴击伤害",
"Ｗ◇进阶：进一步降低连击伤害，当敌方四连或以上则机率闪避，连击越多机率越大",
"Ｗ◇高阶：包裹里有任意酒时，每15时序喝酒并触发一次以下效果之一：",
"Ｗ	逍遥醉步 命：十时序的持续回血状态，可与天香续命等效果叠加",
"Ｗ	逍遥醉步 气：十时序的持续回内状态，可与其他时序回内效果叠加",
"Ｗ	逍遥醉步 速：到下一次出手前集气速度上升",
"Ｗ◇触发醉步时，给自己叠加「微醺」状态，攻击伤害上升但低机率打空",
"Ｗ◇叠加到八层微醺后，再触发逍遥醉步，就会开启「醉八仙」状态，持续三回合",
"Ｗ◇【醉八仙】拳特系武功伤害大增，被拳、特系攻击必然闪避",
"Ｗ◇【醉八仙】被其他三系攻击，免疫普通杀气并减伤",
"Ｗ◇门派：使用物品的效果翻倍。降低逍遥醉步的时序要求",
"Ｗ◇天轻：被集气速度低于自己的敌人攻击时机率免疫杀气",
"Ｗ◇特殊人物：",
"Ｗ	萧峰：【万水千山纵横】所有集气速度低于自己的敌人，被其攻击时受双倍伤害",
"Ｗ	洪七公：【九指神丐】当偷到的东西是食、药时，立刻享受该药品的效果",
"Ｗ◇【特殊福利】满足高阶条件，装备酒神秘籍，战斗后增加酿酒的数量",
"Ｎ",                                       --飘夜
}

--newkdef[112罗汉拳谱]=function()
ItemInfo[112]={
"Ｌ习得外功：罗汉拳",
"Ｎ",
"Ｗ武功威力：140",
"Ｗ武功气攻：-",
"Ｗ内力消耗：7",
"Ｗ武功范围：米 3格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇般若掌：同时修炼易筋神功，使用罗汉拳60%几率触发",
"Ｗ◇般若掌：伤害提高50点",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高连击",  
"Ｚ一脉相承：",
"Ｗ◇学会罗汉拳，满足条件可一脉相承大力金刚掌",                                         --飘夜
}

--newkdef[113六脉神剑]=function()
ItemInfo[113]={
"Ｌ习得外功：六脉神剑",
"Ｎ",
"Ｗ武功威力：1000",
"Ｗ武功气攻：2000",
"Ｗ内力消耗：700",
"Ｗ武功范围：《 9格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇剑气碧烟横：使用六脉神剑攻击50%几率触发",
"Ｗ◇剑气碧烟横：本次攻击敌方的指法系数按50%计算",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇中冲剑,剑逆天光--无视敌方气防 且必破防50%。",
"Ｗ◇关冲剑,剑煌镜影--增加一次连击 附带灼烧效果。",
"Ｗ◇少冲剑,南柯万剑--必暴击,且暴击攻击加成提升至200％。",
"Ｗ◇少泽剑,皇玺剑印--对目标造成随机造成眩晕/虚弱/定身。"  ,
}

--newkdef[114独孤九剑]=function()
ItemInfo[114]={
"Ｌ习得外功：独孤九剑",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1600",
"Ｗ内力消耗：140",
"Ｗ武功范围：米 7格",
"Ｗ无视闪避、刺目必造成伤害，自带九层独孤剑气，每道剑气伤害为200，参考九阴破体真气","Ｗ◇并且根据自身实战触发额外伤害",
"Ｗ奥义·总决式 攻击随机触发1-9级剑气，必封穴、流血、冰封、灼烧，自我恢复状态",
"Ｗ奥义·破剑式 攻击时造成流血效果，流血不会恢复",
"Ｗ奥义·破刀式 昏迷、点燃1回合",
"Ｗ奥义·破枪式 敌人集气速度降低，行动后初始集气降低，我方增加集气",
"Ｗ奥义·破鞭式 附加扣血伤害，被攻击的2-9格根据内力扣除敌人生命",
"Ｗ奥义·破索式 对敌人下一回锁足",
"Ｗ奥义·破掌式 攻击暴怒目标时使敌人怒气减半",
"Ｗ奥义·破箭式 攻击敌人使其致盲并降低集气追加内伤",
"Ｗ奥义·破气式 一次性秒掉所有敌人当前所剩内力",
"Ｗ九剑奥义·破尽天下 每次攻击减掉敌人所有兵器值1点，最低下限为15点",
"Ｗ以上效果修炼独孤九剑达到500剑系后几率触发，独孤无条件触发",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇九剑真传：华山论剑打败风清扬奖励，需已学会独孤九剑",
"Ｗ◇九剑真传：用独孤九剑攻击70%几率触发四种招式：",
"Ｗ◇九剑真传：离剑式：伤害不随距离递减",
"Ｗ◇九剑真传：倒剑式：敌方集气强制倒退200点",
"Ｗ◇九剑真传：撩剑式：伤害提高30%",
"Ｗ◇九剑真传：荡剑式：攻击后回气+200点",
"Ｗ◇九剑真传：被攻击时，有70%几率减伤20%，并降低攻击方下回合集气位置200",
"Ｗ◇剑胆琴心：同时修炼独孤九剑和持瑶琴到极",
"Ｗ◇剑胆琴心：战斗中受到的伤害会转化为临时的御剑系数提高",
"Ｗ            *持续整场战斗有效，系数加成后的总和不会超过320",
"Ｗ◇剑胆琴心：使用持瑶琴攻击时，自身恢复5%当前血量并减少10点内伤",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                         --飘夜
"Ｗ◇习得持瑶琴后，再学习独孤九剑的需求降低40点",

     
}

--newkdef[115太极剑法]=function()
ItemInfo[115]={
"Ｌ习得外功：太极剑法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：280",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇太极奥义：同时修炼太极拳和太极剑法到极",
"Ｗ◇太极奥义：被攻击时有（资质/4+45）%的几率触发，降低35%所受到的杀气",
"Ｗ◇太极奥义：触发太极奥义时，有35%的几率触发“太极真义·四两拨千斤”",
"Ｗ            完全绝对气防",
"Ｗ◇以柔克刚：同时修炼柔云剑法和太极剑法到极",
"Ｗ◇以柔克刚：被攻击时有50%的几率触发，将所受杀气值的一半转化为回血",
"Ｎ",
"Ｚ组合特效：",
"Ｚ◇<开太极>",
"Ｗ◇主运太极神功，使用太极拳法或太极剑法",
"Ｗ◇蓄力值超过500且暴怒触发",
"Ｗ◇根据当前生命值跟内力值追加大范围伤害，生命越低/内力越高伤害越高",
"Ｗ◇触发将消耗自己10%当前体力值+10%当前内力值",                                  --飘夜

}

--newkdef[116玄铁剑法]=function()
ItemInfo[116]={
"Ｌ习得外功：玄铁剑法",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1500",
"Ｗ内力消耗：420",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ重剑真传（剑主、杨过、大雕、独孤专属）：",
"Ｗ◇玄铁极意：玄铁剑法可移动，增加300威力",
"Ｗ◇重剑真传·浪如山涌剑如虹：攻击概率随御剑增加范围，暴怒必然触发",
"Ｎ",
"Ｚ重剑无锋：",                                        --飘夜
"Ｗ◇重剑无锋·破尽天下：学会怒涛海潮功",
"Ｗ◇重剑无锋·破尽天下：暴击时破气防，增加2000气攻",
"Ｗ◇重剑无锋·破尽天下：暴击概率随实战增长",

"Ｎ",   
"Ｄ组合效果：主运怒涛海潮功 + 玄铁剑法",
"Ｗ◇详见电子书",
}

--newkdef[117苗家剑法]=function()
ItemInfo[117]={
"Ｌ习得外功：苗家剑法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：350",
"Ｗ武功范围：《 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇胡刀苗剑·归真合一：同时修炼胡家刀法与苗家剑法到极，",
"Ｗ◇胡刀苗剑·归真合一：用其中一种武功攻击时几率触发",
"Ｗ◇胡刀苗剑·归真合一：攻击效果提升40%，追加1500气攻",
"Ｎ",
"Ｚ特别说明：",                                        --飘夜
"Ｗ◇习得胡家刀法后，再学习苗家剑法的需求降低40点"
}

--newkdef[118斗转星移]=function()
ItemInfo[118]={
"Ｌ习得秘技：斗转星移",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇斗转星移无法主动攻击，但受到攻击（资质-30）几率以同样的武功反击回去",
"Ｗ◇北斗移辰：总兵器值<240，以50%的威力斗转反击",
"Ｗ◇斗转星移：240≤总兵器值<360，以60%的威力斗转反击",
"Ｗ◇离合参商：360≤总兵器值<520，以70%的威力斗转反击",
"Ｗ◇幻梦星辰：总兵器值≥520，以80%的威力斗转反击",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇30%几率转移攻击于敌人",
"Ｎ",
"Ｚ特别说明：",    
"Ｗ◇需资质大于79",                                  --飘夜
"Ｎ",
"Ｄ进阶方式：限定天邪，获得天龙天书，队伍中有慕容复，对话扫地僧书架，战胜扫地",

"Ｎ",
"Ｄ组合效果：斗转星移 + 参合指",
"Ｗ◇慕·玄指为先 敌全体减集气200点，附加30-50点流血值，流血值附加内伤",
"Ｗ◇容·混气柔刚 以自身指法系数的50%附加伤害",
"Ｗ◇参·海运洞显 以自身现有内力值的1.5倍量削减敌内力值，伤害增加1.5倍",
"Ｗ◇合·日月济世 以自身30%最大内力值附加伤害",
"Ｗ◇以上效果慕容博学会参合指后即可触发，其他人物主运斗转即可触发",
}

--newkdef[119玉女剑法]=function()
ItemInfo[119]={
"Ｌ习得外功：玉女剑法",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：280",
"Ｗ武功范围：《 5格",
"Ｎ",
"Ｄ组合特效：双剑合璧",
"Ｗ同时学会武功全真剑法、玉女剑法、左右互搏",
"Ｗ连击率+30%",
"Ｗ使用全真剑法/玉女剑法攻击时触发<双剑合壁.攻>，必击中对方破绽",
"Ｗ防守时触发<双剑合壁.守>，免疫破绽，免疫被杀气到-100以下",
"Ｗ使用玉女剑/全真剑法攻击范围+1",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                         --飘夜
}

--newkdef[120倚天剑谱]=function()
ItemInfo[120]={
"Ｌ习得外功：倚天剑法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：210",
"Ｗ武功范围：《 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带灼烧",                                         --飘夜
}

--newkdef[121金蛇剑法]=function()
ItemInfo[121]={
"Ｌ习得外功：金蛇剑法",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：900",
"Ｗ内力消耗：210",
"Ｗ武功范围：米 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇附带灼烧",                                         --飘夜
}

--newkdef[122七星剑谱]=function()
ItemInfo[122]={
"Ｌ习得外功：全真剑法",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：800",
"Ｗ内力消耗：140",
"Ｗ武功范围：《 7格",
"Ｎ",
"Ｄ组合特效：双剑合璧",
"Ｗ同时学会武功全真剑法、玉女剑法、左右互搏",
"Ｗ连击率+30%",
"Ｗ使用全真剑法/玉女剑法攻击时触发<双剑合壁.攻>，必击中对方破绽",
"Ｗ防守时触发<双剑合壁.守>，免疫破绽，免疫被杀气到-100以下",
"Ｗ使用玉女剑/全真剑法攻击范围+1",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",                                         --飘夜

"Ｎ",
"Ｄ组合效果：全真剑法 + 先天功",
"Ｗ◇全真剑气 自带7道全真剑气，每道剑气伤害300，杀气1250点，40时序恢复1道",
"Ｗ◇全真剑法·明河共影 自身剑系1/3为附加伤害，点燃状态",
"Ｗ◇全真剑法·兰烬蕉暗 敌方剑系1/3为附加伤害，昏迷状态",
"Ｗ◇全真剑法·胡霜千里 以自身所剩余内力的1/30为附加伤害，封印状态",
"Ｗ◇以上效果王重阳学会全真剑法即可触发，其他人物主运先天功即可触发",
}

--newkdef[123玉箫剑法]=function()
ItemInfo[123]={
"Ｌ习得外功：玉箫剑法",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：800",
"Ｗ内力消耗：140",
"Ｗ武功范围：《 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇桃花绝技：同时修炼弹指/落英/玉箫到极，三种武功威力+200",
"Ｗ◇桃花绝技：40%几率三连击，暴怒必出",
"Ｗ◇桃花绝技：弹指神通：必暴击，气攻+1500",
"Ｗ◇桃花绝技：落英神剑掌：攻击范围变为可移动，并根据敌方内力耗损量增加伤害",
"Ｗ◇桃花绝技：玉箫剑法：攻击距离提升至8格，有60%几率冰封",
"Ｗ◇修炼其中之一后，修炼其余两个的兵器值需求-10",
"Ｎ",
"Ｚ特别说明：无",                                        --飘夜
}

--newkdef[124两仪剑谱]=function()
ItemInfo[124]={
"Ｌ习得外功：两仪剑法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：-",
"Ｗ内力消耗：105",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇两仪守护：同时练有两仪剑法和反两仪刀法到极，",
"Ｗ◇两仪守护：被攻击时50%几率减伤32点，并降低地方320气攻",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高连击",                                         --飘夜
}

--newkdef[125柔云剑谱]=function()
ItemInfo[125]={
"Ｌ习得外功：柔云剑法",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：105",
"Ｗ武功范围：《 7格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇以柔克刚：同时修炼柔云剑法和太极剑法到极",
"Ｗ◇以柔克刚：被攻击时有50%的几率触发，将所受杀气值的一半转化为回血",
"Ｎ",
"Ｚ特别说明：无",                                         --飘夜
}

--newkdef[126雪山剑谱]=function()
ItemInfo[126]={
"Ｌ习得外功：雪山剑法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：600",
"Ｗ内力消耗：49",
"Ｗ武功范围：米 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带冰封",            
"Ｗ◇天外连击时随机增加0.5-3倍原武功威力",                               --飘夜
}

--newkdef[127太岳三青峰]=function()
ItemInfo[127]={
"Ｌ习得外功：太岳三青峰",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：600",
"Ｗ内力消耗：49",
"Ｗ武功范围：《 6",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
"Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20 连击率+5%",
"Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
"Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
"Ｗ◇五岳剑法：暴怒必定发动",
"Ｗ◇五岳剑法：被攻击时如未护体几率发动“以剑御气”降低50%气攻",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高连击",                                                                        --飘夜
}

--newkdef[128万岳朝宗]=function()
ItemInfo[128]={
"Ｌ习得外功：万岳朝宗",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：70",
"Ｗ武功范围：《 6",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
"Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20 连击率+5%",
"Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
"Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
"Ｗ◇五岳剑法：暴怒必定发动",
"Ｗ◇五岳剑法：被攻击时如未护体几率发动“以剑御气”降低50%气攻",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高暴击",
"Ｗ◇附带冰封",                                                                        --飘夜
}

--newkdef[129云雾十三式]=function()
ItemInfo[129]={
"Ｌ习得外功：云雾十三式",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：600",
"Ｗ内力消耗：35",
"Ｗ武功范围：《 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
"Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20 连击率+5%",
"Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
"Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
"Ｗ◇五岳剑法：暴怒必定发动",
"Ｗ◇五岳剑法：被攻击时如未护体几率发动“以剑御气”降低50%气攻",
"Ｎ",
"Ｚ特别说明：无",                                                                        --飘夜
}

--newkdef[130泰山十八盘]=function()
ItemInfo[130]={
"Ｌ习得外功：泰山十八盘",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：35",
"Ｗ武功范围：米 7格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
"Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20 连击率+5%",
"Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
"Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
"Ｗ◇五岳剑法：暴怒必定发动",
"Ｗ◇五岳剑法：被攻击时如未护体几率发动“以剑御气”降低50%气攻",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                                                       --飘夜
}

--newkdef[131万花剑法]=function()
ItemInfo[131]={
"Ｌ习得外功：万花剑法",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：500",
"Ｗ内力消耗：35",
"Ｗ武功范围：■ 6+7×7",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
"Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20 连击率+5%",
"Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
"Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
"Ｗ◇五岳剑法：暴怒必定发动",
"Ｗ◇五岳剑法：被攻击时如未护体几率发动“以剑御气”降低50%气攻",
"Ｎ",
"Ｚ特别说明：无",                                                                      --飘夜
}

--newkdef[132三分剑术]=function()
ItemInfo[132]={
"Ｌ习得外功：三分剑法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：400",
"Ｗ内力消耗：9",
"Ｗ武功范围：《 7格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇素质三连：同时修炼三分剑法/连城剑法",
"Ｗ◇素质三连：暴怒时使用剑法必定三连击",
"Ｚ特别说明：",
"Ｗ◇高连击",                                         --飘夜
}

--newkdef[133雷震剑法]=function()
ItemInfo[133]={
"Ｌ习得外功：雷震剑法",
"Ｎ",
"Ｗ武功威力：110",
"Ｗ武功气攻：300",
"Ｗ内力消耗：7",
"Ｗ武功范围：《 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高暴击",                                         --飘夜
}

--newkdef[134松风剑法]=function()
ItemInfo[134]={
"Ｌ习得外功：松风剑法",
"Ｎ",
"Ｗ武功威力：140",
"Ｗ武功气攻：300",
"Ｗ内力消耗：4",
"Ｗ武功范围：《 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                         --飘夜
}

--newkdef[135火焰刀法]=function()
ItemInfo[135]={
"Ｌ习得外功：火焰刀法",
"Ｎ",
"Ｗ武功威力：650",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：350",
"Ｗ武功范围：△ 7格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇举火燎原：同时修炼金乌/燃木/火焰刀到极",
"Ｗ◇举火燎原：攻击时，有50%几率追加10时序的引燃状态，暴怒必触发",
"Ｗ            *引燃状态下，每时序损失2%当前血量",
"Ｎ",
"Ｚ特别说明：",                                        --飘夜
"Ｗ◇大轮密宗·火焰刀：使用火焰刀法攻击30%几率触发（鸠摩智100%触发）",
"Ｗ◇大轮密宗·火焰刀：全场敌方受到内伤30点，且追加1000气攻",
"Ｗ◇大轮密宗·火焰刀：*刀主有二次判定",
"Ｗ◇附带灼烧",

"Ｎ",
"Ｚ组合特效：龙象般若功 + 火焰刀法",
"Ｗ◇火焰刀·凝集 强制杀气200或500点不等，并强制封穴30或60点不等",
"Ｗ◇火焰刀·虚无缥缈 根据自身内力值和最大内力值总和强制杀气",
"Ｗ◇火焰刀·虚劲伤人 攻击后出会触发9*9范围伤害，敌人处于锁足状态",
"Ｗ◇ 以上效果必须主运龙象般若功",

"Ｎ",
"Ｄ组合特效：小无相功 + 火焰刀法",
"Ｗ◇根据资质触发火焰刀气，每道火焰刀伤害100",
"Ｗ◇攻击敌人后会给敌人种下火焰刀气劲，效果同龙象气劲",
"Ｗ◇以上效果无需主运小无相功，学会小无相功即可",
}

--newkdef[136胡家刀法]=function()
ItemInfo[136]={
"Ｌ习得外功：胡家刀法",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：210",
"Ｗ武功范围：井 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇胡刀苗剑·归真合一：同时修炼胡家刀法与苗家剑法到极，",
"Ｗ◇胡刀苗剑·归真合一：用其中一种武功攻击时几率触发",
"Ｗ◇胡刀苗剑·归真合一：攻击效果提升40%，追加1500气攻",
"Ｗ◇胡刀刀法·极意：限主角与胡斐胡一刀，用胡家刀法攻击时几率触发",
"Ｗ◇胡刀刀法·极意：攻击无误伤，攻击范围变为9*9，气攻提升至1500",
"Ｗ◇胡刀刀法·极意：暴怒时必触发",
"Ｎ",
"Ｚ特别说明：",                                        --飘夜
"Ｗ◇习得苗家剑法后，再学习胡家刀法的需求降低40点"
}

--newkdef[137燃木刀法]=function()
ItemInfo[137]={
"Ｌ习得外功：燃木刀法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：900",
"Ｗ内力消耗：175",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇举火燎原：同时修炼金乌/燃木/火焰刀到极",
"Ｗ◇举火燎原：攻击时，有50%几率追加10时序的引燃状态，暴怒必触发",
"Ｗ            *引燃状态下，每时序损失2%当前血量",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇据当前加力内功提升攻击效果",
"Ｗ◇增加暴击率",
"Ｗ◇附带灼烧",                                         --飘夜
}

--newkdef[138玄虚刀法]=function()
ItemInfo[138]={
"Ｌ习得外功：玄虚刀法",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：-",
"Ｗ内力消耗：175",
"Ｗ武功范围：井 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇炼神还虚：同时修炼神门十三剑/玄虚刀法",
"Ｗ◇炼神还虚：玄虚刀法必封穴，神门十三剑必冰封灼烧",
"Ｗ◇炼神还虚：受到攻击30%几率使用双倍内力抵消一半伤害",
"Ｎ",
"Ｚ特别说明：无",                                        --飘夜
}

--newkdef[139血刀经]=function()
ItemInfo[139]={
"Ｌ习得外功：血刀刀法",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：800",
"Ｗ内力消耗：140",
"Ｗ武功范围：井 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：", 
"Ｗ◇修炼后生命上限降低200",                                       --飘夜
}

--newkdef[140夫妻刀法]=function()
ItemInfo[140]={
"Ｌ习得外功：夫妻刀法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：140",
"Ｗ武功范围：△ 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇天衣无缝：同时修炼鸳鸯刀法和夫妻刀法到极",
"Ｗ◇天衣无缝：使用任意刀系武功增加30%连击率",
"Ｎ",
"Ｚ特别说明：无",                                        --飘夜
"Ｗ◇连击时伤害、气攻不会减少",
"Ｎ",
"Ｄ组合效果：冰火阴阳诀 + 夫妻刀法",
"Ｗ◇女貌郎才珠万斛 天教艳质为眷属 破气防、无视敌人20%防御",
"Ｗ◇清风引佩下瑶台 明月照妆成金屋 必冰封、根据敌人刀系的1/2恢复生命、内力",
"Ｗ◇刀光掩映孔雀屏 喜结丝萝在乔木 必灼烧、根据自身刀系的1/3增加伤害和削减内力",
"Ｗ◇英雄无双风流婿 却扇洞房燃花烛 额外攻击加200，每次攻击附加5点内伤值","Ｗ◇如果内伤大于50点触发昏迷状态",
"Ｗ◇碧箫声里双鸣凤 今朝有女颜如玉 额外攻击加200，敌人身上流血值大于50点触发点燃效果",
"Ｗ◇千金一刻庆良宵 占断人间天上福 根据敌我攻击力总和的1/6增加伤害",
"Ｗ◇以上效果学会冰火阴阳诀、夫妻刀法后即可触发效果，无需主运",
}

--newkdef[141金乌刀法]=function()
ItemInfo[141]={
"Ｌ习得外功：金乌刀法",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：700",
"Ｗ内力消耗：105",
"Ｗ武功范围：△ 7格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇举火燎原：同时修炼金乌/燃木/火焰刀到极",
"Ｗ◇举火燎原：攻击时，有50%几率追加10时序的引燃状态，暴怒必触发",
"Ｗ            *引燃状态下，每时序损失2%当前血量",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇附带灼烧",                                         --飘夜

"Ｎ",
"Ｄ组合效果：太玄神功 + 金乌刀法",
"Ｗ◇烈阳·开门揖盗 以自身所剩余内力的1/3增加杀气",
"Ｗ◇烈阳·梅雪逢夏 蓄力攻击时伤害提升100%",
"Ｗ◇烈阳·千钧压驼 追加杀气300点",
"Ｗ◇烈阳·大海沉沙 以自身内力值的35%附加伤害，敌人处于流血状态",
"Ｗ◇烈阳·赤日炎炎 以自身刀系的1/3附加伤害，根据敌人攻击力削减内力","Ｗ◇并附加15点内伤值，当敌人内伤值达到100点后直接按150点计算",
"Ｗ◇金乌烈阳 攻击时几率自身进入蓄力状态",
"Ｗ◇以上效果石破天学会金乌刀法即可触发，其他人物学会太玄、金乌后主运太玄即可触发效果",
}

--newkdef[142反两仪刀法]=function()
ItemInfo[142]={
"Ｌ习得外功：反两仪刀法",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：105",
"Ｗ武功范围：井 7格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇两仪守护：同时练有两仪剑法和反两仪刀法到极，",
"Ｗ◇两仪守护：被攻击时50%几率减伤32点，并降低地方320气攻",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                         --飘夜
}

--newkdef[143五虎断门刀]=function()
ItemInfo[143]={
"Ｌ习得外功：五虎断门刀",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：600",
"Ｗ内力消耗：70",
"Ｗ武功范围：井 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇五虎闹东京：同时修炼五虎断门刀和五虎棍法",
"Ｗ◇赞天虎身轻如燕：一虎在场，攻击时30%几率提升全队100集气",
"Ｗ◇彻地虎是条好汉：二虎在场，被攻击时30%几率提高1000点气防",
"Ｗ◇穿山虎铁臂神拳：三虎在场，攻击时30%几率增加100点伤害",
"Ｗ◇翻江虎身手不凡：四虎在场，集气条30%几率跳跃10点集气速度",
"Ｗ◇锦毛虎一身是胆：五虎在场，被攻击时30%几率反弹10%伤害",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高暴击",                                         --飘夜
}

--newkdef[144飞狐外传]=function()
ItemInfo[144]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[145雪山飞狐]=function()
ItemInfo[145]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[146连城诀]=function()
ItemInfo[146]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[147天龙八部]=function()
ItemInfo[147]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[148射雕英雄传]=function()
ItemInfo[148]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[149白马啸西风]=function()
ItemInfo[149]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[14千年灵芝]=function()
ItemInfo[14]={
"Ｌ物品说明：可增加人物体质",
"Ｎ",
"Ｄ使用效果：人物体质增加1点",
                                    -- by 飘夜
}

--newkdef[150鹿鼎记]=function()
ItemInfo[150]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[151笑傲江湖]=function()
ItemInfo[151]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[152书剑恩仇录]=function()
ItemInfo[152]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[153神雕侠侣]=function()
ItemInfo[153]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[154侠客行]=function()
ItemInfo[154]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[155倚天屠龙记]=function()
ItemInfo[155]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[156碧血剑]=function()
ItemInfo[156]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[157鸳鸯刀]=function()
ItemInfo[157]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[158修罗刀谱]=function()
ItemInfo[158]={
"Ｌ习得外功：修罗刀",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：70",
"Ｗ武功范围：△ 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇利刃寒锋：同时修炼修罗/阴风/沧溟刀到极",
"Ｗ◇利刃寒锋：攻击时，有50%几率追加10时序的冻结状态，暴怒必触发",
"Ｗ            *冻结状态下，无法集气，亦无法时序回复状态",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高暴击",
"Ｗ◇附带冰封" ,                                        --飘夜

"Ｎ",
"Ｄ组合效果：修罗刀法 + 紫霞神功",
"Ｗ◇集气速度增加10点",
"Ｗ◇根据怒气值来增加杀气量",
"Ｗ◇根据怒气值来提升伤害，攻击人物越多怒气越高，闪避或者不","Ｗ◇破防的情况下无法增加怒气",
"Ｗ◇根据自身最大生命值和所剩生命值总和的1/20来增加伤害",
"Ｗ◇所有人物学会紫霞、修罗刀法后即可触发效果，无需主运",
}

--newkdef[159奇门三才刀]=function()
ItemInfo[159]={
"Ｌ习得外功：奇门三才刀",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：600",
"Ｗ内力消耗：35",
"Ｗ武功范围：井 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",                                        --飘夜
}

--newkdef[160慈悲刀法]=function()
ItemInfo[160]={
"Ｌ习得外功：慈悲刀法",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：600",
"Ｗ内力消耗：35",
"Ｗ武功范围：△ 7格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇慈悲为怀：同时修炼慈悲刀法和大慈大悲手",
"Ｗ◇慈悲为怀：道德高于60时，如果伤害大于120减伤（道德-60）点",
"Ｚ特别说明：",
"Ｗ◇高连击",                                         --飘夜
}

--newkdef[161狂风刀法]=function()
ItemInfo[161]={
"Ｌ习得外功：狂风刀法",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：700",
"Ｗ内力消耗：21",
"Ｗ武功范围：米 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇你是风儿我是沙：同时修炼狂风刀法和黄沙万里鞭到极",
"Ｗ◇你是风儿我是沙：使用狂风刀法/黄沙万里鞭必双击，伤害提升30%",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高连击",                                         --飘夜

"Ｎ",
"Ｄ组合效果：混元功 + 狂风刀法",
"Ｗ◇狂风刀法·风雨交加 攻击触发6*6范围攻击，气功加1000点，在根据自身刀系的3被附加杀气",
"Ｗ◇狂风刀法·斩 攻击破防，根据敌我内力差来增加杀气量，额外增加内伤20点","Ｗ◇流血20时序，如果流血值超过30点以50点计算",
"Ｗ◇狂风刀法·破 根据自身内力来增加杀气",
"Ｗ◇攻击根据这身刀系的1/30增加伤害",
"Ｗ◇每次攻击附加内伤20，生命减75，内力减100，体力减1",
"Ｗ◇田伯光学会狂风刀法后即可触发效果，其他人物学会狂风刀、混元功后即可触发效果",
}

--newkdef[162鸳鸯刀法]=function()
ItemInfo[162]={
"Ｌ习得外功：鸳鸯刀法",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：21",
"Ｗ武功范围：井 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇天衣无缝：同时修炼鸳鸯刀法和夫妻刀法到极",
"Ｗ◇天衣无缝：使用任意刀系武功增加30%连击率",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                        --飘夜
}

--newkdef[163南山刀谱]=function()
ItemInfo[163]={
"Ｌ习得外功：南山刀法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：600",
"Ｗ内力消耗：14",
"Ｗ武功范围：△ 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                        --飘夜
}

--newkdef[164鬼头刀法]=function()
ItemInfo[164]={
"Ｌ习得外功：鬼头刀法",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：600",
"Ｗ内力消耗：14",
"Ｗ武功范围：井 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                        --飘夜
}

--newkdef[165万劫刀法]=function()
ItemInfo[165]={
"Ｌ习得外功：万劫刀法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：-",
"Ｗ内力消耗：7",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                         --飘夜
}

--newkdef[166柴刀十八路]=function()
ItemInfo[166]={
"Ｌ习得外功：柴刀十八路",
"Ｎ",
"Ｗ武功威力：140",
"Ｗ武功气攻：500",
"Ｗ内力消耗：7",
"Ｗ武功范围：井 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --飘夜
}

--newkdef[167打狗棒法]=function()
ItemInfo[167]={
"Ｌ习得外功：打狗棒法",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1400",
"Ｗ内力消耗：70",
"Ｗ武功范围：米 3格",
"Ｎ",
"Ｄ招式特效：（实际奇门系数/14，最大25%；奇门主和洪七/10，最大35%）",
"Ｗ◇绊字决：造成锁足",
"Ｗ◇封字决：敌方下回合无法攻击",
"Ｗ◇转字决：连击加1",
"Ｗ◇缠字决：造成迟缓20时序",
"Ｗ◇挑字决：无视敌方30%防御",
"Ｗ◇戳字决：必定封穴，封穴+10，40%概率造成刺目",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇盖世无双：需同时修炼降龙十八掌与打狗棒法到极",
"Ｗ◇盖世无双：被攻击时，有50%几率绝对气防",
"Ｗ◇天下无狗：使用打狗棒法40%几率发动，暴怒必定发动",
"Ｗ◇天下无狗：攻击无误伤，攻击范围变为面攻，气攻提升至2400",


"Ｎ",
"Ｄ组合效果：擒龙功 + 打狗棒法",
"Ｗ◇打狗棒法·挑字诀：强制封穴10点",
"Ｗ◇打狗棒法·封字诀：伤害倍增，额外增加杀气值，根据敌方所剩体力值附加内伤值",
"Ｗ◇打狗棒法·戳字诀：被攻击后敌人处于刺目状态",
"Ｗ◇打狗棒法·引字诀：强制杀气150点，300点，450点",
"Ｗ◇打狗棒法·绊字诀：被攻击后敌人处于锁足状态",
"Ｗ◇劈字诀·天下无狗：空挥敌全体生命-80，内力-100，可直接致死",
"Ｗ◇以上效果必须主运擒龙功",

"Ｎ",
"Ｚ特别说明：无",                      --飘夜
"Ｗ◇习得降龙十八掌后，再学习打狗棒法的需求降低40点",
}

--newkdef[168伏魔杖法]=function()
ItemInfo[168]={
"Ｌ习得外功：伏魔杖法",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：210",
"Ｗ武功范围：田 5格",
"Ｎ",
"Ｄ世尊降魔(组合特效)：",
"Ｗ◇修炼<伏魔杖法><金刚伏魔圈><无上大力杵><罗汉伏魔功>领悟“世尊降魔”",
"Ｗ◇效果：暴击率增加50%",
"Ｗ *如果造成的伤害<300,则伤害等于300，暴怒追加一定气攻伤害",
"Ｗ *如果造成的伤害>300则追加少量气攻值伤害暴怒则追加大量气攻值伤害",
"Ｚ特别说明：无",                                      
}

--newkdef[169倚天屠龙功]=function()
ItemInfo[169]={
"Ｌ习得外功：倚天屠龙功",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：63",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
"Ｗ◇琴棋书画·秉笔直书：攻击必定造成封穴，",
"Ｗ◇琴棋书画·秉笔直书：且伤害提升20%几率发动",
"Ｎ",
"Ｚ特别说明：无",                                         --飘夜
}

--newkdef[170无上大力杵]=function()
ItemInfo[170]={
"Ｌ习得外功：无上大力杵",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：350",
"Ｗ武功范围：■ 5+5×5",
"Ｎ",
"Ｚ特别说明：", 
"Ｗ◇附带灼烧",                                     --飘夜
}

--newkdef[171金刚伏魔圈]=function()
ItemInfo[171]={
"Ｌ习得外功：金刚伏魔圈",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：56",
"Ｗ武功范围：田 3格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇金刚伏魔阵：战场上队伍里同时修炼金刚伏魔圈2人以上",
"Ｗ◇金刚伏魔圈护体：2人，提升15%防御且气防+500",
"Ｗ◇真·金刚伏魔圈护体：2+人，提升30%防御且气防+1000",
"Ｎ",
"Ｄ世尊降魔(组合特效)：",
"Ｗ◇修炼<罗汉伏魔功>后领悟“世尊降魔”",
"Ｗ◇效果：暴击率增加50%",
"Ｗ *如果造成的伤害<300,则伤害等于300，暴怒追加一定气攻伤害",
"Ｗ *如果造成的伤害>300则追加少量气攻值伤害暴怒则追加大量气攻值伤害",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带灼烧",                                         --飘夜
}

--newkdef[172妙笔丹青]=function()
ItemInfo[172]={
"Ｌ习得外功：妙笔丹青",
"Ｎ",
"Ｗ武功威力：444",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：56",
"Ｗ武功范围：◇ 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
"Ｗ◇琴棋书画·画地为牢：使妙笔丹青攻击附带冰封，高几率发动",
"Ｗ◇琴棋书画·江山如画：大幅提升妙笔丹青冰封效果，几率发动",
"Ｎ",
"Ｚ特别说明：无"                                         --飘夜
}

--newkdef[173黄沙万里鞭]=function()
ItemInfo[173]={
"Ｌ习得外功：黄沙万里鞭",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：600",
"Ｗ内力消耗：49",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效一：",
"Ｗ◇你是风儿我是沙：同时修炼狂风刀法和黄沙万里鞭到极",
"Ｗ◇你是风儿我是沙：狂风刀法/黄沙万里鞭必双击，伤害提升30%",
"Ｗ◇攻击机率触发「万里风沙」，回气150点",
"Ｎ",
"Ｄ组合特效二：",
"Ｗ◇同时修炼黄沙万里鞭和南山刀法到极，使用黄沙鞭攻击触发",
"Ｗ◇黄沙万里·风沙漫天：必四连，附加敌方刺目状态",
"Ｗ◇黄沙万里·飞沙扬砾：每次攻击敌人增加7点流血，根据现有的2倍流血扣除生命",
"Ｎ",
"Ｄ组合特效三：",
"Ｗ◇同时修炼黄沙万里鞭、玄武真功、天罗地网轻功到极，被攻击时触发天地玄黄",
"Ｗ◇天：受击时有10％机率，反弹伤害",
"Ｗ◇地：受击时有10％机率，强制伤害为0",
"Ｗ◇玄：受击时有10％机率，吸收25％的伤害回复生命",
"Ｗ◇黄：受击时有10％机率，吸收50％的伤害回复内力",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇附带灼烧",                                         --飘夜
}

--newkdef[174银两]=function()
ItemInfo[174]={
"Ｌ物品说明：有钱能使鬼推磨",                                        --飘夜
}

--newkdef[175银索金铃]=function()
ItemInfo[175]={
"Ｌ习得外功：银铃金锁",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：900",
"Ｗ内力消耗：49",
"Ｗ武功范围：■ 4+5×5",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率", 
"Ｚ组合：",
"Ｗ◇学会海叟钓法和银铃金锁。",                                      
"Ｗ◇自身范围内一格15%概率不受到伤害。",                                      
}

--newkdef[176阴阳倒乱刃]=function()
ItemInfo[176]={
"Ｌ习得外功：阴阳倒乱刃",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：600",
"Ｗ内力消耗：36",
"Ｗ武功范围：◇ 3格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇同时修炼阴阳倒乱刃及铁布衫到极，使用刀法、剑法攻击触发",
"Ｗ◇当未学有左右互搏时，独立享受30%的互搏几率；学有左右互搏则几率加10%",
"Ｗ◇使用刀法或剑法攻击时，触发刀剑顺行或刀剑逆转攻击特效，增幅伤害、扣除敌方内力并一定机率全屏攻击",
"Ｗ◇触发左右互搏时，根据先刀后剑或先剑后刀，有不同特效",
"Ｗ◇先剑后刀：触发「阳刃化刀」特效",
"Ｗ◇ 渔网阵：附加锁足、二回合的脆弱状态害",
"Ｗ◇ 烈阳舞：附加10点灼烧值，以及30时序的无明业火",
"Ｗ◇ 一文字：必封穴、额外增加300点杀气、敌方防御下降20%",
"Ｗ◇先刀后剑：触发「阴刃化剑」特效",
"Ｗ◇ 枣核钉：攻击根据暗器增加额外伤害，攻击结束后增加3-5点暗器值",
"Ｗ◇ 霜雪扬：对敌人附加冰冻、冻结状态并在冰冻状态中会持续掉血",
"Ｗ◇ 天丛云：对敌方附加恐惧一回合、剧毒20时序并自身回复血内",
"Ｗ◇特别效果：如果触发左右互搏真谛，则第二次互搏时用刀或剑都可触发大招，享有以上全部效果。",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高连击",                                         --飘夜
}

--newkdef[177渔叟钓法]=function()
ItemInfo[177]={
"Ｌ习得外功：海叟钓法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：-",
"Ｗ内力消耗：42",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",  
"Ｚ组合：",
"Ｗ◇学会海叟钓法和银铃金锁。",                                      
"Ｗ◇自身范围内一格15%概率不受到伤害。",                                         --飘夜
}

--newkdef[178大剪刀刀法]=function()
ItemInfo[178]={
"Ｌ习得外功：大剪刀",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：800",
"Ｗ内力消耗：0",
"Ｗ武功范围：田 3格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高暴击",                                         --飘夜
}

--newkdef[179鹤蛇八打]=function()
ItemInfo[179]={
"Ｌ习得外功：鹤蛇八打",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：700",
"Ｗ内力消耗：35",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇附带冰封、中毒（20）",                                         --飘夜
}


--newkdef[180持瑶琴]=function()
ItemInfo[180]={
"Ｌ习得外功：持瑶琴",
"Ｎ",
"Ｗ武功威力：333",
"Ｗ武功气攻：-",
"Ｗ内力消耗：28",
"Ｗ武功范围：■ 5+9×9",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
"Ｗ◇琴棋书画·琴音悦耳：攻击不造成怒气，100%发动",
"Ｗ◇琴棋书画·菩提清心：使敌方怒气减半，几率发动",
"Ｗ◇剑胆琴心：同时修炼独孤九剑和持瑶琴到极",
"Ｗ◇剑胆琴心：战斗中受到的伤害会转化为临时的御剑系数提高",
"Ｗ            *持续整场战斗有效，系数加成后的总和不会超过320",
"Ｗ◇剑胆琴心：使用持瑶琴攻击时，自身恢复5%当前血量并减少10点内伤",
"Ｎ",
"Ｚ特别说明：",                                         --飘夜
"Ｗ◇习得独孤九剑后，再学习持瑶琴的需求降低40点"
}

--newkdef[181棋盘招式]=function()
ItemInfo[181]={
"Ｌ习得外功：棋盘招式",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：28",
"Ｗ武功范围：田 3格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
"Ｗ◇琴棋书画·棋高一着：追加1200气攻，100%发动",
"Ｗ◇琴棋书画·星罗棋布：额外提升1000气攻，几率发动",
"Ｎ",
"Ｚ特别说明：无",                                         --飘夜
}

--newkdef[182罗盘]=function()
ItemInfo[182]={
"Ｌ物品说明：显示坐标",                                    -- by 飘夜
}

--newkdef[183裴将军帖]=function()
ItemInfo[183]={
"Ｌ习得外功：裴将军帖",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：14",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇附带冰封",                                         --飘夜
}

--newkdef[184中平枪法]=function()
ItemInfo[184]={
"Ｌ习得外功：中平枪法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：600",
"Ｗ内力消耗：14",
"Ｗ武功范围：田 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇必连击",
"Ｗ◇附带灼烧",                                         --飘夜
}

--newkdef[185毒龙鞭法]=function()
ItemInfo[185]={
"Ｌ习得外功：毒龙鞭法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：-",
"Ｗ内力消耗：14",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带冰封、中毒（10）",                                         --飘夜
}

--newkdef[186杨家枪]=function()
ItemInfo[186]={
"Ｌ习得外功：杨家枪法",
"Ｎ",
"Ｗ武功威力：140",
"Ｗ武功气攻：500",
"Ｗ内力消耗：7",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｚ特别说明：",                      
"Ｚ一脉相承：",
"Ｗ◇学会杨家枪法，满足条件可一脉相承岳家枪法",      
"Ｗ◇增加暴连击率",                                         --飘夜
}

--newkdef[187子午针灸经]=function()
ItemInfo[187]={
"Ｌ消耗药材获得药品：九转熊蛇丸",                                         --飘夜
}

--newkdef[188华佗内昭图]=function()
ItemInfo[188]={
"Ｌ消耗药材获得药品：无常丹、九花玉露丸",                                         --飘夜
}

--newkdef[189胡青牛医书]=function()
ItemInfo[189]={
"Ｌ消耗药材获得药品：黑玉断续膏",                                         --飘夜
}

--newkdef[190千金方]=function()
ItemInfo[190]={
"Ｌ消耗药材获得药品：小还丹、白云熊胆丸",                                         --飘夜
}

--newkdef[191黄帝内经]=function()
ItemInfo[191]={
"Ｌ消耗药材获得药品：天香续命膏、田七鲨胆散",                                         --飘夜
}

--newkdef[192毒经]=function()
ItemInfo[192]={
"Ｌ消耗药材获得药品：无",                                         --飘夜
}

--newkdef[193药王神篇]=function()
ItemInfo[193]={
"Ｌ消耗药材获得药品：黄连解毒丸、牛黄血竭丹、六阳正气丹",                                         --飘夜
}

--newkdef[194翡翠杯]=function()
ItemInfo[194]={
"Ｌ物品说明：喝酒的杯子",                                         --飘夜
}

--newkdef[195铁铲]=function()
ItemInfo[195]={
"Ｌ物品说明：用于挖土",                                         --飘夜
}

--newkdef[196大燕传国玉玺]=function()
ItemInfo[196]={
"Ｌ物品说明：大燕传国玉玺",                                         --飘夜
}

--newkdef[197大燕皇帝世系谱表]=function()
ItemInfo[197]={
"Ｌ物品说明：大燕皇帝世系谱表",                                         --飘夜
}

--newkdef[198赏善罚恶令]=function()
ItemInfo[198]={
"Ｌ物品说明：一块令牌",                                         --飘夜
}

--newkdef[199两页刀法]=function()
ItemInfo[199]={
"Ｌ物品说明：胡家刀法中的两页纸",                                         --飘夜
}

--newkdef[200七宝指环]=function()
ItemInfo[200]={
"Ｌ物品说明：逍遥派掌门信物", 
"Ｇ装备效果；逍遥派武功威力+100",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇50%发动“七宝琉璃”，减少敌方气防值50%",                            
}

--newkdef[201断肠草]=function()
ItemInfo[201]={
"Ｌ物品说明：有剧毒",                                   -- by 飘夜
}

--newkdef[202闯王军刀]=function()
ItemInfo[202]={
"Ｇ装备效果；胡家刀法威力+100",
"Ｎ",
"Ｄ装备等级：无",                                 -- by 飘夜
}

--newkdef[203玄冰碧火酒]=function()
ItemInfo[203]={
"Ｌ物品说明：内力中和的药酒",                                   -- by 飘夜
}

--newkdef[204苗人凤眼毒解药]=function()
ItemInfo[204]={
"Ｌ物品说明：苗人凤眼毒解药",                                   -- by 飘夜
}

--newkdef[205神杖]=function()
ItemInfo[205]={
"Ｌ物品说明：武林盟主之杖",                                   -- by 飘夜
}

--newkdef[206唐诗选集]=function()
ItemInfo[206]={
"Ｌ物品说明：唐诗选集",                                   -- by 飘夜
}

--newkdef[207七心海棠]=function()
ItemInfo[207]={
"Ｌ物品说明：有剧毒",                                   -- by 飘夜
}

--newkdef[208金钥匙]=function()
ItemInfo[208]={
"Ｌ物品说明：纯金钥匙",                                   -- by 飘夜
}

--newkdef[209药材]=function()
ItemInfo[209]={
"Ｌ物品说明：用于炼药",                                   -- by 飘夜
}

--newkdef[210食材]=function()
ItemInfo[210]={
"Ｌ物品说明：用于做饭",                                   -- by 飘夜
}

--newkdef[211一撮金毛]=function()
ItemInfo[211]={
"Ｌ物品说明：谢逊的呆毛",                                   -- by 飘夜
}

--newkdef[212广陵散琴曲]=function()
ItemInfo[212]={
"Ｌ物品说明：珍贵的琴谱",                                   -- by 飘夜
}

--newkdef[213刘仲甫呕血棋谱]=function()
ItemInfo[213]={
"Ｌ物品说明：珍贵的棋谱",                                   -- by 飘夜
}

--newkdef[214张旭率意帖]=function()
ItemInfo[214]={
"Ｌ物品说明：珍贵的字帖",                                   -- by 飘夜
}

--newkdef[215溪山行旅图]=function()
ItemInfo[215]={
"Ｌ物品说明：珍贵的画作",                                   -- by 飘夜
}

--newkdef[216带头大哥书信]=function()
ItemInfo[216]={
"Ｌ物品说明：一封信",                                   -- by 飘夜
}

--newkdef[217鸳刀]=function()
ItemInfo[217]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：使用夫妻刀法时，必定连击",
"Ｗ◇LV.5：使用夫妻刀法时，必定连击，追加500气攻",
"Ｗ◇LV.6（MAX）：使用夫妻刀法时，必定连击，追加500气攻，伤害提高20%",                                -- by 飘夜
}

--newkdef[218鸯刀]=function()
ItemInfo[218]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：使用夫妻刀法时，必定连击",
"Ｗ◇LV.5：使用夫妻刀法时，必定连击，追加500气攻",
"Ｗ◇LV.6（MAX）：使用夫妻刀法时，必定连击，追加500气攻，伤害提高20%",                                -- by 飘夜
}

--newkdef[219一颗头颅]=function()
ItemInfo[219]={
"Ｌ物品说明：成昆的头",                                   -- by 飘夜
}

--newkdef[220食神秘籍]=function()
ItemInfo[220]={
"Ｌ消耗食材获得食物：叫花鸡、好逑汤、玉笛谁家听落梅、腊八粥",  
"Ｎ",
"Ｗ◇萧中慧、黄蓉修炼必得：玉笛谁家听落梅（15食材）",
"Ｗ◇人厨子修炼必得：腊八粥（25食材）",                                       --飘夜
}

--newkdef[221酒神秘籍]=function()
ItemInfo[221]={
"Ｌ消耗食材获得酒：梨花酒、玉露酒、即墨老酒、五宝花蜜酒",  
"Ｎ",
"Ｗ◇祖千秋修炼必得：五宝花蜜酒（25食材）",                                       --飘夜
}

--newkdef[222手帕]=function()
ItemInfo[222]={
"Ｌ物品说明：一块手帕",                                   -- by 飘夜
}

--newkdef[223手帕]=function()
ItemInfo[223]={
"Ｌ物品说明：一块手帕",                                   -- by 飘夜
}

--newkdef[224手帕]=function()
ItemInfo[224]={
"Ｌ物品说明：一块手帕",                                   -- by 飘夜
}

--newkdef[225闯王藏宝图]=function()
ItemInfo[225]={
"Ｌ物品说明：闯王藏宝图",                                   -- by 飘夜
}

--newkdef[226闯王藏宝图]=function()
ItemInfo[226]={
"Ｌ物品说明：闯王藏宝图",                                   -- by 飘夜
}

--newkdef[227闯王藏宝图]=function()
ItemInfo[227]={
"Ｌ物品说明：闯王藏宝图",                                   -- by 飘夜
}

--newkdef[228半部四十二章经]=function()
ItemInfo[228]={
"Ｌ物品说明：半部四十二章经，4本？不知道是哪4本",                                   -- by 飘夜
}

--newkdef[229四十二章经]=function()
ItemInfo[229]={
"Ｌ物品说明：全部的四十二章经，8本全了",                                   -- by 飘夜
}

--newkdef[230白马]=function()
ItemInfo[230]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：集气速度增加2点",
"Ｗ◇LV.3：集气速度增加3点",
"Ｗ◇LV.5：集气速度增加4点",                                  -- by 飘夜
}

--newkdef[231火蟾]=function()
ItemInfo[231]={
"Ｌ物品说明：一只蟾蜍而已，炼制地灵丹的材料之一",                                   -- by 飘夜
}

--newkdef[232太白三英的书信]=function()
ItemInfo[232]={
"Ｌ物品说明：一封信",                                   -- by 飘夜
}

--newkdef[233金娃娃]=function()
ItemInfo[233]={
"Ｌ物品说明：一条鱼",                                   -- by 飘夜
}

--newkdef[234介绍信]=function()
ItemInfo[234]={
"Ｌ物品说明：一封信",                                   -- by 飘夜
}

--newkdef[235左右互搏之术]=function()
ItemInfo[235]={
"Ｌ习得奇术：左右互搏术",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇左右互搏几率：（71-资质）%",
"Ｎ",
"Ｚ特别说明：",                                         --飘夜
"Ｗ◇需资质低于31",
}

--newkdef[237连城剑诀]=function()
ItemInfo[237]={
"Ｌ习得外功：连城剑法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：900",
"Ｗ内力消耗：105",
"Ｗ武功范围：《 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇素质三连：同时修炼三分剑法/连城剑法",
"Ｗ◇素质三连：暴怒时使用剑法必定三连击",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",
"Ｗ◇高暴击",                                         --飘夜
}

--newkdef[238祖传护身符]=function()
ItemInfo[238]={
"Ｌ物品说明：MOD龙的传人中有用，黑山中暂时没有用，金书中也没有用",                                   -- by 飘夜
}

--newkdef[239金丝手套]=function()
ItemInfo[239]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",                                -- by 飘夜
}

--newkdef[240玄铁匕首]=function()
ItemInfo[240]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",                                 -- by 飘夜
}

--newkdef[241君子剑]=function()
ItemInfo[241]={
"Ｇ装备效果；全真剑法威力+100",
"Ｎ",
"Ｄ装备等级：无",                                 -- by 飘夜
}

--newkdef[242淑女剑]=function()
ItemInfo[242]={
"Ｇ装备效果；玉女剑法威力+100",
"Ｎ",
"Ｄ装备等级：无",                                -- by 飘夜
}

--newkdef[243金刀黑剑]=function()
ItemInfo[243]={
"Ｇ装备效果；阴阳倒乱刃威力+200",
"Ｎ",
"Ｄ装备等级：无",                                -- by 飘夜
}

--newkdef[244西毒蛇杖]=function()
ItemInfo[244]={
"Ｇ装备效果；灵蛇杖法威力+200",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：攻击时无视敌方毒抗强制上毒10点",
"Ｗ◇LV.2：攻击时无视敌方毒抗强制上毒15点",
"Ｗ◇LV.3：攻击时无视敌方毒抗强制上毒20点",
"Ｗ◇LV.4：攻击时无视敌方毒抗强制上毒25点",
"Ｗ◇LV.5：攻击时无视敌方毒抗强制上毒30点",
"Ｗ◇LV.6（MAX）：攻击时无视敌方毒抗强制上毒35点",                                  -- by 飘夜
}

--newkdef[245达摩剑谱]=function()
ItemInfo[245]={
"Ｌ习得外功：达摩剑法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：140",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇同时修炼达摩剑法、少林九阳功到极",
"Ｗ◇防御状态下，受击触发格挡；受击时依照伤害增加「苦难达摩」值，苦难值达1600时，立刻进入无敌状态5时序",
"Ｗ◇使用达摩剑法攻击时附带「苦难达摩」增伤，最高增加1000点",
"Ｗ◇「苦难达摩」值可提升暴击机率、伤害、集气跳气机率",
"Ｗ◇拙劲破巧：「苦难达摩」值达2000时，使用达摩剑法攻击概率伤害翻倍，附加随机负面状态，之后苦难达摩值清零",
"Ｗ◇使用达摩剑法攻击必封穴，攻击封穴敌人必杀气；敌人封穴值超过20则附加封气绝脉陷阱",
"Ｎ",
"Ｚ特别说明：无",                                        --飘夜
}

--newkdef[246百胜刀法]=function()
ItemInfo[246]={
"Ｌ习得外功：百胜刀法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：140",
"Ｗ武功范围：△ 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                      --飘夜
}

--newkdef[247灵蛇杖法]=function()
ItemInfo[247]={
"Ｌ习得外功：灵蛇杖法",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1400",
"Ｗ内力消耗：70",
"Ｗ武功范围：田 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇同时学有灵蛇杖法、逆运经脉，并主运逆运，使用灵蛇杖法攻击触发",
"Ｗ◇攻击根据自身特系和敌方2倍中毒量增加伤害",
"Ｗ◇双蛇剧毒·寒毒--敌人中毒量超过30点时必触发，敌人冰封增加20，内力减300",
"Ｗ◇双蛇剧毒·赤毒--敌人中毒量超过30点时必触发，敌人灼烧增加20，体力减5",
"Ｗ◇万蛇天化·赤尾青竹--增加流血值12点，集气紊乱10时序",
"Ｗ◇万蛇天化·眼镜王蛇--怒气值减少8点，昏迷1回合",
"Ｗ◇万蛇天化·金银双环--无法进行攻击1回合",
"Ｗ◇万蛇天化三式每次攻击敌方强制中毒15点",
"Ｗ◇攻击时几率对敌方附加以下毒素：",
"Ｗ◇出血毒：流血所带来的血量损失增加，撕裂的血量损失增加。",
"Ｗ◇神经毒：10时序内，几率判定必然失败",
"Ｗ◇破甲毒：当普通武功伤害最终统计低于2000时，伤害翻倍。",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇攻击附带中毒",                                         --飘夜
}

--newkdef[248三花聚顶掌]=function()
ItemInfo[248]={
"Ｌ习得外功：三花聚顶掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：35",
"Ｗ武功范围：米 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：必连击",                                     --飘夜
}

--newkdef[249铁指诀]=function()
ItemInfo[249]={
"Ｌ习得外功：铁指诀",
"Ｎ",
"Ｗ武功威力：140",
"Ｗ武功气攻：300",
"Ｗ内力消耗：7",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇附带中毒",                                         --飘夜
}

--newkdef[250天竺佛指]=function()
ItemInfo[250]={
"Ｌ习得外功：天竺佛指",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：300",
"Ｗ内力消耗：14",
"Ｗ武功范围：▽ 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高暴击",
"Ｄ一脉相承",
"Ｗ◇学习无相劫指一脉相承",                                        --飘夜
}

--newkdef[251夺魄指]=function()
ItemInfo[251]={
"Ｌ习得外功：夺魄指",
"Ｎ",
"Ｗ武功威力：175",
"Ｗ武功气攻：400",
"Ｗ内力消耗：350",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                         --飘夜
}

--newkdef[252凌波微步]=function()
ItemInfo[252]={
"Ｌ习得轻功：凌波微步",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
"Ｗ◇基础：被攻击20%的几率完全闪避攻击,并使之后5时序闪避几率翻倍",
"Ｗ◇基础：没闪避时，有30%的几率触发凌波微步减伤，降低40%的伤害及杀气",
"Ｗ◇进阶：「踏海还潮」根据移动距离，回合后回复内力、体力",
"Ｗ◇进阶：学有北冥神功则内力回复量增加",
"Ｗ◇高阶：无视所有必中效果，并根据不同性别，在闪避时触发以下效果：",
"Ｗ◇男性：「烟雨谪仙」对自己附加防御上升、集气速度上升、回血等效果。",
"Ｗ◇女性：「羞月洛神」降低攻击者一定时序内的特效机率，并且机率魅惑敌人",
"Ｗ◇阴阳：「邪魅苍生」使敌人附加锁足及15时序内封穴不减，自身增加10点怒气",
"Ｗ◇天轻：未触发闪避时，减伤和减杀气效果增强",
"Ｗ◇门派：「逍遥派」，逍遥御风延长至30时序，逍遥御风的累积改为8次就触发",
"Ｗ◇特殊人物：李秋水：凌波闪避有二次判定；童姥：凌波微步触发闪避时回血",
"Ｗ◇特殊人物：无崖子：触发凌波减伤时，机率扣减当前内力的20%，抵销等值伤害",
"Ｗ◇特殊人物：逍遥子：以上全包且加强"
}

--newkdef[253去烦恼指]=function()
ItemInfo[253]={
"Ｌ习得外功：去烦恼指",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：700",
"Ｗ内力消耗：175",
"Ｗ武功范围：▽ 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                         --飘夜
}

--newkdef[254袖中指]=function()
ItemInfo[254]={
"Ｌ习得外功：袖中指",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：140",
"Ｗ武功范围：▽ 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                         --飘夜
}

--newkdef[255兰花拂穴手]=function()
ItemInfo[255]={
"Ｌ习得外功：兰花拂穴手",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：140",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高几率封穴",                                         --飘夜
}


--newkdef[256透骨打穴]=function()
ItemInfo[256]={
"Ｌ习得外功：透骨打穴",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：105",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇同时学有透骨打穴、蛤蟆功，使用透骨打穴攻击触发",
"Ｗ◇攻击时必触发10点封穴、内伤值，根据自身气攻附加额外伤害",
"Ｗ◇攻击根据指系附加伤害",
"Ｗ◇攻击必中毒，2倍中毒值恢复自身生命，敌人最多50时序内处于迟缓状态",
"Ｗ◇攻击必中毒，5倍中毒值恢复自生内力",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高几率封穴",                                         --飘夜
}

--newkdef[257旋风扫叶腿]=function()
ItemInfo[257]={
"Ｌ习得外功：旋风扫叶腿",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：35",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                        --飘夜
}

--newkdef[258玄天指]=function()
ItemInfo[258]={
"Ｌ习得外功：玄天指",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：700",
"Ｗ内力消耗：140",
"Ｗ武功范围：▽ 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高暴击",
"Ｗ◇附带冰封",                                         --飘夜
}

--newkdef[259黑风指法]=function()
ItemInfo[259]={
"Ｌ习得外功：黑风指",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：150",
"Ｗ武功范围：▽ 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",
"Ｗ◇附带冰封",                                         --飘夜
}

--newkdef[260大智无定指]=function()
ItemInfo[260]={
"Ｌ习得外功：大智无定指",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：35",
"Ｗ武功范围：▽ 6格",
"Ｎ",
"Ｄ组合特效一：",
"Ｗ◇除却四相：同时修炼多罗叶指/大智无定指/无相劫指/拈花指到极",
"Ｗ◇除却四相：被攻击50%几率触发",
"Ｗ◇无我相：免疫本次攻击造成的内伤/封穴/冰封/灼烧",
"Ｗ◇无人相：集气条前进100",
"Ｗ◇无众生相：无视敌方武常",
"Ｗ◇无寿者相：恢复100点生命",
"Ｄ组合特效二：",
"Ｗ◇魔心四相：多罗叶指/大智无定指/无相劫指/拈花指到极，并主运天魔功/道德为零时主运血河神鉴，根据学习指法数量触发特效",
"Ｗ◇特殊条件：自身不是少林派",
"Ｗ◇学一指触发魔执我相：攻击必定封穴、灼烧、冰封、内伤。并几率附加火毒、寒毒、封穴陷阱（封穴解除时集气向后150～200）、残劲袭魄 ",
"Ｗ◇学二指触发魔执人相：根据敌方人数增幅攻击力（有保底）",
"Ｗ◇学三指触发众生魔相：大范围极意攻击且使敌方混乱。",
"Ｗ◇学四指触发无佛冥相：必定使敌方受到（敌方道德X4）的真伤（无视护盾）",
"Ｎ",
"Ｚ特别说明：",                                       --飘夜
}

--newkdef[261凝血神爪]=function()
ItemInfo[261]={
"Ｌ习得外功：凝血神爪",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：70",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",
                                         --飘夜
}

--newkdef[262汗血宝马]=function()
ItemInfo[262]={
"Ｇ物品说明；集气+8，时序回复流血值2点",                                  -- by 飘夜
}

--newkdef[263天外玄铁]=function()
ItemInfo[263]={
"Ｇ物品说明；修复断刀断剑",                                  -- by 飘夜
}

--newkdef[264飞云骓]=function()
ItemInfo[264]={
"Ｇ装备效果；集气+12",                                -- by 飘夜
}

--newkdef[265金刚不坏体]=function()
ItemInfo[265]={
"Ｌ习得内功：金刚不坏体",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇被攻击时60%几率发动“金刚不坏”，高优先级降低30%所承受伤害及杀气",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇被攻击时35%几率发动“金钟罩护体”，高优先级降低20%所承受伤害及杀气",
"Ｗ *同时学有易筋神功+金刚不坏体，主运【易筋神功】被攻击必出“金刚不坏”",
"Ｎ",
"Ｄ组合特效一：",
"Ｗ◇罗汉金身：学会罗汉伏魔功、金刚不坏体",
"Ｗ◇罗汉金身：受到第一次的伤害概率减伤40%",
"Ｗ◇罗汉金身·固若金刚：伤害大于0时，20%概率减伤50%，否则减伤100点",
"Ｎ",
"Ｄ组合特效二：",
"Ｗ◇十三太保横练：学会金刚不坏体、铁布衫、龙象般若功",
"Ｗ◇十三太保横练：免疫破绽，免疫杀气，受到伤害降低13％",
"Ｗ◇十三太保横练：自身生命大于50％，受到致死伤害时，消耗当前生命的60%，免疫此次攻击伤害并获得霸体一回合。",  
"Ｎ",
"Ｄ组合特效三：",
"Ｗ◇学会并主运金刚不坏体，同时学有铁布衫或少林九阳功",
"Ｗ◇1.金光罩体：被连击时伤害下降，无视暴击伤害并回血。",
"Ｗ◇不灭法身：基础防御力以浮动3～7倍结算，若敌方攻击力低于结算后防御力，则该回合免疫杀气，真伤量减半。",
"Ｗ◇不坏金身：免疫封穴，爆怒时被杀气量减半。伤害高优先级大幅减少，机率进化为不漏琉璃，免疫被攻击伤害。",
"Ｗ◇罡气反噬：被攻击时根据自身内力值反弹对手内伤（高资有加成），并根据敌方内伤直接扣除敌方血量（满内伤一次扣300)",

}

--newkdef[266四象步法]=function()
ItemInfo[266]={
"Ｌ习得轻功：飞天神行",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
"Ｗ◇基础：行动结束后，下回合集气+200（可与其他效果叠加）",
"Ｗ◇进阶：被机率攻击时减少25％的伤害",
"Ｗ◇高阶：被攻击机率减少30％的伤害",
"Ｗ◇高阶：若减少后的伤害不为零，则高机率依轻功值再减伤",
"Ｗ◇天轻：触发减伤效果时，下一回合移动距离＋1。",
"Ｗ◇门派：暂无",
"Ｗ◇特殊人物：胡家父子：触发减伤时反弹冰封",
"Ｗ◇特殊人物：苗人凤：触发减伤时反弹灼烧",
"Ｗ◇特殊人物：袁紫衣：减伤时以奇门增加减伤量；被奇门攻击则闪避"
}

--newkdef[267神行百变]=function()
ItemInfo[267]={
"Ｌ习得轻功：神行百变",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
"Ｗ◇基础：被攻击时机率将杀气转为集气，转化值为杀气值的0.5",
"Ｗ◇进阶：被攻击时机率将杀气转为等值集气",
"Ｗ◇高阶：被攻击时机率将杀气乘以1.5倍并转化为集气；",
"Ｗ◇高阶：攻击时第一击必定触发、之后机率触发「神行背刺」",
"Ｗ◇神行背刺：攻击时附加25点流血，并根据流血值附加伤害",
"Ｗ◇天轻：触发杀气转集气时，额外附加100点集气",
"Ｗ◇门派：「崆峒派」，增加触发杀气转集气的机率",
"Ｗ◇特殊人物：阿九：触发杀气转集气效果时，机率满怒气",
"Ｗ◇特殊人物：小宝：触发杀气转集气效果时，机率闪避。"
}

--newkdef[268拈花指法]=function()
ItemInfo[268]={
"Ｌ习得外功：拈花指",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：180",
"Ｗ武功范围：米 6格",
"Ｎ",
"Ｄ组合特效一：",
"Ｗ◇除却四相：同时修炼多罗叶指/大智无定指/无相劫指/拈花指到极",
"Ｗ◇除却四相：被攻击50%几率触发",
"Ｗ◇无我相：免疫本次攻击造成的内伤/封穴/冰封/灼烧",
"Ｗ◇无人相：集气条前进100",
"Ｗ◇无众生相：无视敌方武常",
"Ｗ◇无寿者相：恢复100点生命",
"Ｄ组合特效二：",
"Ｗ◇魔心四相：多罗叶指/大智无定指/无相劫指/拈花指到极，并主运天魔功/道德为零时主运血河神鉴，根据学习指法数量触发特效",
"Ｗ◇特殊条件：自身不是少林派",
"Ｗ◇学一指触发魔执我相：攻击必定封穴、灼烧、冰封、内伤。并几率附加火毒、寒毒、封穴陷阱（封穴解除时集气向后150～200）、残劲袭魄 ",
"Ｗ◇学二指触发魔执人相：根据敌方人数增幅攻击力（有保底）",
"Ｗ◇学三指触发众生魔相：大范围极意攻击且使敌方混乱。",
"Ｗ◇学四指触发无佛冥相：必定使敌方受到（敌方道德X4）的真伤（无视护盾）",
"Ｎ",
"Ｚ特别说明：",                                       --飘夜
}

--newkdef[269无相劫指法]=function()
ItemInfo[269]={
"Ｌ习得外功：无相劫指",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：240",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｄ组合特效一：",
"Ｗ◇除却四相：同时修炼多罗叶指/大智无定指/无相劫指/拈花指到极",
"Ｗ◇除却四相：被攻击50%几率触发",
"Ｗ◇无我相：免疫本次攻击造成的内伤/封穴/冰封/灼烧",
"Ｗ◇无人相：集气条前进100",
"Ｗ◇无众生相：无视敌方武常",
"Ｗ◇无寿者相：恢复100点生命",
"Ｄ组合特效二：",
"Ｗ◇魔心四相：多罗叶指/大智无定指/无相劫指/拈花指到极，并主运天魔功/道德为零时主运血河神鉴，根据学习指法数量触发特效",
"Ｗ◇特殊条件：自身不是少林派",
"Ｗ◇学一指触发魔执我相：攻击必定封穴、灼烧、冰封、内伤。并几率附加火毒、寒毒、封穴陷阱（封穴解除时集气向后150～200）、残劲袭魄 ",
"Ｗ◇学二指触发魔执人相：根据敌方人数增幅攻击力（有保底）",
"Ｗ◇学三指触发众生魔相：大范围极意攻击且使敌方混乱。",
"Ｗ◇学四指触发无佛冥相：必定使敌方受到（敌方道德X4）的真伤（无视护盾）",
"Ｎ",
"Ｚ特别说明：",                                       --飘夜
}

--newkdef[270参合指法]=function()
ItemInfo[270]={
"Ｌ习得外功：参合指",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1500",
"Ｗ内力消耗：350",
"Ｗ武功范围：▽ 8格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：", 
"Ｗ◇参合状态：参合指攻击会给敌人添加参合状态", 
"Ｗ◇参合状态：攻击时伤害降低10%~20%", 
"Ｗ◇参合状态：被攻击时受到伤害增加15%~30%",    

"Ｎ",
"Ｄ组合效果：斗转星移 + 参合指",

"Ｗ◇慕·玄指为先 敌全体减集气200点，附加30-50点流血值，流血值附加内伤",
"Ｗ◇容·混气柔刚 以自身指法系数的50%附加伤害",
"Ｗ◇参·海运洞显 以自身现有内力值的1.5倍量削减敌内力值，伤害增加1.5倍",
"Ｗ◇合·日月济世 以自身30%最大内力值附加伤害",
"Ｗ◇以上效果慕容博学会参合指后即可触发，其他人物主运斗转即可触发",                                         --飘夜
}

--newkdef[271沧溟刀法]=function()
ItemInfo[271]={
"Ｌ习得外功：沧溟刀法",
"Ｎ",
"Ｗ武功威力：650",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：210",
"Ｗ武功范围：△ 7格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇利刃寒锋：同时修炼修罗/阴风/沧溟刀到极",
"Ｗ◇利刃寒锋：攻击时，有50%几率追加10时序的冻结状态，暴怒必触发",
"Ｗ            *冻结状态下，无法集气，亦无法时序回复状态",
"Ｗ◇攻击变为可移动，行动机率回气一百。",
"Ｗ◇杀人后可获得「人头」，人头数上限为五，未触发绝技时，人头固定增加500伤害。",
"Ｗ◇杀人时会减少全场的集气并提高自身集气速度。",
"Ｗ◇侠客行邪线打赢谢烟客、取得沧溟刀法后可学绝技。",
"Ｗ◇攻击时若身上有人头，有20%机率（爆怒必触发）绝技：霜之哀伤。",
"Ｗ◇此次攻击将增加「人头数乘以500」的伤害量。若敌人死亡则全场敌人减少集气、附加封穴并怒气值减半。",

"Ｎ",
"Ｚ特别说明：",
"Ｗ◇颠动沧溟：使用沧溟刀法攻击30%几率触发",
"Ｗ◇颠动沧溟：额外杀气，且必定造成流血",
"Ｗ◇颠动沧溟：刀主有二次判定",                                        --飘夜
"Ｗ◇附带冰封",




}

--newkdef[272茯苓花雕猪]=function()
ItemInfo[272]={
"Ｌ物品说明：这头猪很牛",                                   -- by 飘夜
}

--newkdef[273皇宫通行令]=function()
ItemInfo[273]={
"Ｌ物品说明：顾名思义",                                   -- by 飘夜
}

--newkdef[274一指禅]=function()
ItemInfo[274]={
"Ｌ习得外功：一指禅",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：105",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                      --飘夜
}

--newkdef[275化骨绵掌]=function()
ItemInfo[275]={
"Ｌ习得外功：化骨绵掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：-",
"Ｗ内力消耗：70",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带冰封、中毒(30)",                                         --飘夜
"Ｄ组合特效：",
"Ｗ◇紫气天罗：同时学有寒冰绵掌+化骨绵掌or玄冥神掌",
"Ｗ◇紫气天罗：攻击随机附加1~3层“冰冻状态”，每层减缓1%集气速度，上限50层",
"Ｗ◇紫气天罗：被攻击时冻结敌人5时序",
"Ｗ◇紫气天罗：寒冰绵掌/化骨绵掌/玄冥神掌威力提升300点",
}

--newkdef[276火枪]=function()
ItemInfo[276]={
"Ｌ物品说明：",
"Ｎ",
"Ｗ武功威力：0",
"Ｗ武功气攻：-",
"Ｗ内力消耗：0",
"Ｗ武功范围：点 25格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇鳌拜密道开启宝箱后洗",
"Ｗ◇装备武器火枪才有威力",                                         --飘夜
}

--newkdef[277多罗叶指]=function()
ItemInfo[277]={
"Ｌ习得外功：多罗叶指",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：150",
"Ｗ武功范围：▽ 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇除却四相：同时修炼多罗叶指/大智无定指/无相劫指/拈花指到极",
"Ｗ◇除却四相：被攻击50%几率触发",
"Ｗ◇无我相：免疫本次攻击造成的内伤/封穴/冰封/灼烧",
"Ｗ◇无人相：集气条前进100",
"Ｗ◇无众生相：无视敌方武常",
"Ｗ◇无寿者相：恢复100点生命",
"Ｄ组合特效二：",
"Ｗ◇魔心四相：多罗叶指/大智无定指/无相劫指/拈花指到极，并主运天魔功/道德为零时主运血河神鉴，根据学习指法数量触发特效",
"Ｗ◇特殊条件：自身不是少林派",
"Ｗ◇学一指触发魔执我相：攻击必定封穴、灼烧、冰封、内伤。并几率附加火毒、寒毒、封穴陷阱（封穴解除时集气向后150～200）、残劲袭魄 ",
"Ｗ◇学二指触发魔执人相：根据敌方人数增幅攻击力（有保底）",
"Ｗ◇学三指触发众生魔相：大范围极意攻击且使敌方混乱。",
"Ｗ◇学四指触发无佛冥相：必定使敌方受到（敌方道德X4）的真伤（无视护盾）",
"Ｎ",
"Ｚ特别说明：",                                       --飘夜
}

--newkdef[278越女剑法]=function()
ItemInfo[278]={
"Ｌ习得外功：越女剑法",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：7",
"Ｗ武功范围：■ 10+11X11",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                       --飘夜
}

--newkdef[279毛驴]=function()
ItemInfo[279]={
"Ｇ装备效果；血量越低，集气速度越快",
"Ｎ",
"Ｄ装备等级：无",                               -- by 飘夜
}

--newkdef[280玉女心经]=function()
ItemInfo[280]={
"Ｌ习得内功：玉女心经",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇连击时有（30+天书数×2）%的几率触发“夭矫空碧”特效，此次连击伤害、",
"Ｗ  杀气不减",
"Ｗ◇攻击的第一击有（天书数×2）%几率触发“进趋如风”特效，追加一次连击",
"Ｗ *主角使用时几率增加5%，且爆豆时在每回合的第一次出手必发动",
"Ｗ 【女性专属】气攻伤害增加20%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇集气速度增加3点",
"Ｗ◇被攻击时，降低50%本次攻击所造成的灼烧",
"Ｗ *同时学有玉女心经+先天功，每时序额外回复1点封穴",
"Ｎ",
"Ｄ组合效果：玉女心经 + 黯然销魂掌",
"Ｗ◇天地妒·未信与杀内500点，低几率触发杀内1000，两个杀内效果能叠加",
"Ｗ◇相思无用·惟别而已60%暴击，暴击时伤害提升4倍",
"Ｗ◇别期若有定·千般煎熬又何如必封穴",
"Ｗ◇莫道黯然销魂·何处柳暗花明攻击结束后回气300点",
"Ｗ◇黯然销魂者·唯别而已矣以自身拳系30%附加伤害",
"Ｗ◇杨过学会黯然后即可触发效果，无需主运玉女即可触发效果",

"Ｎ",
"Ｄ组合效果：玉女心经 + 先天功",
"Ｗ◇目标暴怒速度减半  ",
"Ｗ◇自身怒气不增加，敌方目标怒气越高对自身的伤害越低 ",
"Ｗ◇自身免疫灼伤；被冰封时伤害减半，回血回内",
"Ｗ◇自身在场时，目标时序增加怒气，攻击时对自身造成200%怒气值的伤害",
"Ｗ◇林朝英学会玉女心经后即可触发效果",

"Ｎ",
"Ｄ组合效果：玉女心经 + 玉女素心剑法",
"Ｗ◇玉女素心·浪迹天涯 根据自身轻功的1/3增加伤害，每次增加5点内伤",
"Ｗ◇玉女素心·花前月下 根据自身剑系的1/3增加伤害，敌人处于盲目状态",
"Ｗ◇玉女素心·冷月窥人 附加冰封值50点，敌人处于沉睡状态",
"Ｗ◇玉女素心·清饮小酌 伤害加100，如果敌人内伤大于50点就处于昏迷状态",
"Ｗ◇玉女素心·小园艺菊 利刃寒锋状态10时序",
"Ｗ◇玉女素心·举案齐眉 根据敌我双方所剩内力值总和的1/30附加伤害",
"Ｗ◇以上效果林朝英使用玉女素心剑法即可触发，其他人物主运玉女心经即可触发",
}

--newkdef[281商会令牌]=function()
ItemInfo[281]={
"Ｌ物品说明：很值钱",                                   -- by 飘夜
}

--newkdef[282天罗地网]=function()
ItemInfo[282]={
"Ｌ习得轻功：天罗地网",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
"Ｗ◇基础：攻击时无视敌方的闪避效果强制命中，且自身攻击范围+1",
"Ｗ◇基础：击中的敌方下回合移动格数-1",
"Ｗ *强制命中可针对敌方真葵花移行、凌波微步等特效",
"Ｗ *强制命中还可无视我方被刺目等状态",
"Ｗ◇进阶：若自身轻功大于敌方轻功值（以0.5倍计算）时，根据差距增加伤害",
"Ｗ◇进阶：若自身轻功小于敌方轻功值（以0.5倍计算）时，增加100~200点伤害",
"Ｗ◇高阶：被攻击的敌方触发挪移效果的机率下降30%，若挪移失败，附加锁足状态",
"Ｗ◇天轻：攻击时低机率对敌附加锁足；攻击锁足、缠足状态敌人附加内伤和冰封",
"Ｗ◇门派：「古墓派」使用古墓派武功会以轻功值附加气攻",
"Ｗ◇门派：「古墓派」夭矫空碧改为连击增伤",
"Ｗ◇特殊人物：杨过，行动后机率触发回气100点",
"Ｗ◇特殊人物：小龙女，自身八格内的敌人被攻击时闪避失效",
"Ｗ◇特殊人物：李莫愁，触发赤练神掌时，自身八格内敌人机率被附加中毒",
"Ｗ◇特殊人物：黄衫女，攻击时为自己附加疾风状态，最高10层",
"Ｗ◇特殊人物：林朝英，除李莫愁效果外，以上全包"
}

--newkdef[283五轮大法]=function()
ItemInfo[283]={
"Ｌ习得外功：五轮大法",
"Ｎ",
"Ｗ武功威力：650",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：180",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                    --飘夜
}

--newkdef[284瘦黄马]=function()
ItemInfo[284]={
"Ｇ装备效果；血量越低，集气速度越快",
"Ｎ",
"Ｄ装备等级：无",                               -- by 飘夜
}

--newkdef[285血河神鉴]=function()
ItemInfo[285]={
"Ｌ习得内功：血河神鉴",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇高优先级提升10%伤害",
"Ｗ◇攻击时必定造成流血",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击时，恢复造成伤害10%的血量（单次攻击上限100点）",
"Ｄ一脉相承：",
"Ｗ◇天魔功",

"Ｎ",
"Ｄ魔心四相：自身不为少林派且「道德为零及主运血河神鉴」或「主运天魔功」",
"Ｗ◇根据四相指学习数量，使用四相指法触发以下效果：",
"Ｗ◇学一指：魔执我相：攻击必定封穴、灼烧、冰封、内伤。并机率附加火毒、寒毒、","Ｗ◇封穴陷阱（封穴解除时集气向后150～200）、残劲破体",
"Ｗ◇学二指：魔执人相：根据敌方人数增幅攻击力（有保底）",
"Ｗ◇学三指：众生魔相：大范围极意攻击且使敌方混乱。",
"Ｗ◇学四指：无佛者相：必定使敌方受到（敌方道德X4）的真实伤害（无视护盾）",
}

--newkdef[286九阴真经上卷]=function()
ItemInfo[286]={
"Ｌ物品说明：上卷，下卷合起来有用。这是上卷",                                   -- by 飘夜
}

--newkdef[287九阴真经下卷]=function()
ItemInfo[287]={
"Ｌ物品说明：上卷，下卷合起来有用。这是下卷",                                   -- by 飘夜
}

--newkdef[288断裂的倚天剑]=function()
ItemInfo[288]={
"Ｌ物品说明：断剑，不能用了，要用天外玄铁修补",                                   -- by 飘夜
}

--newkdef[289断裂的屠龙刀]=function()
ItemInfo[289]={
"Ｌ物品说明：断刀，不能用了，要用天外玄铁修补",                                   -- by 飘夜
}

--newkdef[290白蟒鞭法]=function()
ItemInfo[290]={
"Ｌ习得外功：白蟒鞭法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：？？",
"Ｗ内力消耗：70",
"Ｗ武功范围：田 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                        --飘夜
}

--newkdef[291大力金刚指]=function()
ItemInfo[291]={
"Ｌ习得外功：大力金刚指",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：700",
"Ｗ内力消耗：245",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                         --飘夜
}

--newkdef[292呼延枪法]=function()
ItemInfo[292]={
"Ｌ习得外功：呼延枪法",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：-",
"Ｗ内力消耗：14",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇寸长寸强：同时修炼呼延枪法和呼延鞭法到极",
"Ｗ◇寸长寸强：使用任意奇门武功攻击不随距离递减，距离每远一格伤害增加1%",
"Ｎ",
"Ｚ特别说明：无",                                         --飘夜
}

--newkdef[293楞伽经]=function()
ItemInfo[293]={
"Ｌ物品说明：梵文版中含有九阳神功",                                   -- by 飘夜
}

--newkdef[294瑜伽密乘]=function()
ItemInfo[294]={
"Ｌ习得内功：瑜伽密乘",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇被攻击时，集气不会被杀至300以下",
"Ｗ◇被连击时，受到的攻击效果/气攻降低40%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇被攻击时，受内伤上限降低为50",
"Ｗ◇被攻击时，集气不会被杀至0以下",
"Ｗ◇被连击时，受到的攻击效果/气攻降低20%",
"Ｎ",
"Ｚ组合特效：",
"Ｗ◇梵我合一：学会神足经、瑜伽密乘",
"Ｗ◇梵我合一：受到会暴击或连击的攻击时，20%几率终止敌方行动",
"Ｎ",

"Ｎ",
"Ｄ组合特效：龙象般若功 + 瑜伽密乘",
"Ｗ◇龙象之力·调息 选择休息后自身恢复相应的生命、内力、内伤、中毒",
"Ｗ◇龙象气劲·爆 攻击时给敌人种下龙象气劲，敌人行动后扣除生命，无视闪避",
"Ｗ◇根据自身资质攻击附加一道龙象气劲，气劲附加额外伤害",
"Ｗ◇被阳内武功攻击减伤70%，被调和武功攻击减伤40%",
"Ｄ◇隐蔽:",
"Ｗ◇效果：与闪避相同",
}

--newkdef[295太极神功]=function()
ItemInfo[295]={
"Ｌ习得内功：太极神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇被攻击时，有60%几率获得“太极之形”（可累积，上限10个）",
"Ｗ◇每个“太极之形”可提高自身集气1点",
"Ｗ◇主动攻击时，可释放累积的“太极之形”，增加连击数",
"Ｗ （每个5太极之形增加一次连击）",
"Ｗ◇被攻击储存蓄力值，使用太极拳/剑跟据蓄力值增加效果",
"Ｗ◇太极拳/剑蓄力值300～600，攻击范围+2",
"Ｗ◇太极拳/剑蓄力值超过600，攻击范围变为可移动面攻，且必定连击",
"Ｗ◇根据蓄力值增加防御跟减伤",
"Ｗ◇太极拳太极剑法威力+200",
"Ｄ太极特效：",
"Ｚ◇<转阴阳>",
"Ｗ◇被攻击时30%概率反弹自身所有异常",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇触发太极奥义时，必定触发“太极真义·四两拨千斤”",
"Ｗ◇触发太极奥义时，降低10%所承受伤害",
"Ｗ◇行动后自动执行防御防御指令",
"Ｄ太极特效：",
"Ｚ◇<开太极>",
"Ｗ◇主运太极神功，使用太极拳法或太极剑法",
"Ｗ◇蓄力值超过500且暴怒触发",
"Ｗ◇根据当前生命值跟内力值追加大范围伤害，生命比例越低、内力比例越高伤害越高",

"Ｎ",
"Ｄ组合效果：纯阳无极功 + 太极神功",
"Ｗ◇纯阳奥义·万物无极 杀气转移给敌方随机目标，减伤50%",
"Ｗ◇纯阳无极 攻击后必回气150",
"Ｗ◇必免疫杀气，伤害增加20%",
"Ｗ◇以上效果张三丰自带，张无忌学会纯阳后即可触发效果",

"Ｎ",
"Ｄ组合效果：太极神功 + 纯阳无极功",
"Ｗ◇如封似闭 被封穴后自身集气不变并保持减伤",
"Ｗ◇白鹤亮翅 被攻击后敌人的集气位置减半",
"Ｗ◇后发先至 被攻击后增加怒气，伤害提升",
"Ｗ◇无极阴阳 增加反弹伤害，可弹死敌人",
"Ｗ◇后发制人 被攻击后吸收杀气，集气速度提升",
"Ｗ◇厚积薄发 自身被攻击暴怒后，攻击以怒气值、伤害值、气攻值为伤害攻击敌人",
"Ｗ◇以上效果张三丰自带，张无忌学会太极并且主运即可触发效果",

"Ｎ",
"Ｄ组合特效：九阴三阴（主运九阴，学有额外两个阴内内功）",
"Ｗ◇【九阴破体真气】：初始自带9层真气，每道真气增加伤害100点",
"Ｗ   攻击一次减少一道，30时序恢复一道，20%几率触发必中",
"Ｗ◇【九阴飞絮劲】：攻击时几率触发13道飞絮劲",
"Ｗ   1～4道：气攻增加2500点",
"Ｗ	  5～8道：攻击后自身加怒气15点",
"Ｗ	  9～12道：攻击后敌人昏迷状态",
"Ｗ	  13道：以自身现有内力的1/20作为附加伤害",
"Ｗ◇【螺旋九影】：蓄力必成功且自身集气上升，攻击时以拳系数附加伤害及内伤",
"Ｗ◇【九阴摄魂】：机率使敌人下回合攻击必定偏移",
"Ｗ◇【摧坚神爪·无坚不摧】：自身所有攻击增加40%，无视敌人防御50%",
"Ｗ◇【九阴极阴真气】：修炼者保持阴性内力伤害增加30%",
"Ｗ◇【九阴奥义·蛇形狸翻】：被攻击后，免疫杀气并打断连击，恢复100点生命",
"Ｗ◇【天之道】：休息后自身恢复血内体、内伤、中毒，机率清除异常",
"Ｗ◇攻击必触发封穴、流血、灼烧、冰封",
"Ｗ◇自身有内伤会根据内伤的5倍效果恢复生命，并时序清空内伤",

"Ｎ",
"Ｄ组合效果：太极剑法 + 太极神功",
"Ｗ◇以慢打快·后发先至 被攻击时触发，根据防御力反击敌人的杀气",
"Ｗ◇神在剑先·连绵不绝 被攻击时触发，领悟者集气增加200点或者免疫杀气",
"Ｗ◇意在剑先·连绵不绝 攻击时触发封印效果",
"Ｗ◇太极剑法·太极圆转 攻击时触发7*7攻击范围，气攻1500",
"Ｗ◇太极剑法·阴阳动静 被攻击后，如果敌人怒气为50,减10点",
"Ｗ◇以上效果张三丰无条件触发",
}

--newkdef[296梯云纵横]=function()
ItemInfo[296]={
"Ｌ习得轻功：梯云纵横",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
"Ｗ◇基础：攻击伤害不随距离递减",
"Ｗ◇基础：被攻击时，降低50%的杀气。",
"Ｗ◇进阶：触发减杀气时，根据是否破防决定以下两种效果：",
"Ｗ		  煌煌道威 虚怀若云：无破防时触发，自身异常状态皆有一半机会清零",
"Ｗ       煌煌道威 封魔玄坤：被破防时触发，我方所有成员下一回合攻击必极意，机率锁足",
"Ｗ◇高阶：杀气减少70％，并将杀气储存。当被储存的杀气到一定量以上时，开启「登云」特效",
"Ｗ       登云：30时序内集气速度1.5倍，行动后行动后清除所有异常状态并可以再次移动",
"Ｗ◇天轻：提升减杀气机率、登云开启条件下调",
"Ｗ◇门派：「武当派」行动前机率使太极蓄力值增加当前额的20%",
"Ｗ◇特殊人物：张三丰，提升以柔克刚的回血量、无视门派要求享受门派效果且加强"
}

--newkdef[297瞬息千里]=function()
ItemInfo[297]={
"Ｌ习得轻功：瞬息千里",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
"Ｗ◇基础：暴怒时集气速度提升至3倍、免疫封穴",
"Ｗ◇进阶：内伤对于集气速度的负面影响转为正面",
"Ｗ◇高阶：当自身集气位置低于零时，机率打断敌方攻击并立刻行动",
"Ｗ◇高阶：内伤越高、生命越低，触发高阶效果机率越高",
"Ｗ◇天轻：时序减少1封穴，爆怒时清除所有封穴",
"Ｗ◇门派：「白驼山」，减轻内伤带来的攻防削弱，并无视内伤对移动能力的影响",
"Ｗ◇特殊人物：欧阳锋：内伤增加集气速度的幅度增加",
"Ｗ◇特殊人物：欧阳克：时序机率增加一点怒气"
}

--newkdef[298阴风刀]=function()
ItemInfo[298]={
"Ｌ习得外功：阴风刀",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：140",
"Ｗ武功范围：《 7格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇利刃寒锋：同时修炼修罗/阴风/沧溟刀到极",
"Ｗ◇利刃寒锋：攻击时，有50%几率追加10时序的冻结状态，暴怒必触发",
"Ｗ            *冻结状态下，无法集气，亦无法时序回复状态",
"Ｎ",
"Ｚ特别说明：无"
}

ItemInfo[299]={
"Ｌ习得特技：五岳剑诀",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇被攻击时如未触发真气护体，则发动“以剑御气”",
"Ｗ  降低50%气攻",
"Ｗ◇五岳剑法威力+200",
"Ｗ◇使用五岳剑法，必出“气贯五岳”，追加气攻提高至1500，且无视绝对气防",
"Ｎ",
"Ｗ◇五岳剑法分别获得如下的强化效果：",
"Ｗ  *太岳：连击时变为三连击",
"Ｗ  *云雾：对于血量低于一半的敌人伤害加倍",
"Ｗ  *万花：杀伤范围+1格",
"Ｗ  *泰山：攻击后20时序内有30%几率闪避",
"Ｗ  *万岳：对敌方造成伤害同时扣除对其伤害量的内力",

"Ｎ",
"Ｄ组合效果：",
"Ｌ◇a. 五岳神剑 北：",
	"Ｄ◇I. 触发方式：",
		"Ｗ◇i. 取得「五岳派真传盟主」身份，并学有五岳神剑，攻击时使用「五岳神剑 北」触发。",
		"Ｗ◇ii. 取得「五岳派真传盟主」身份，并学有五岳神剑，攻击时使用任一方位的五岳神剑，机率触发。",
		"Ｗ◇iii. 学全五岳派五个进阶内功，并主运「古针禅功」，使用万花剑法触发。",
	"Ｄ◇II. 效果：	",
		"Ｗ◇五岳神剑专属：对冰冻状态的敌人伤害增加。",
		"Ｗ◇i.  惊涛拍岸：连击数小于三时，变为三到五连击。并对敌人附加冰冻状态。",
		"Ｗ◇ii. 千里冰封：对全屏附加冰封。并根据敌方冰封程度扣除内力",
		"Ｗ◇iii.润物无声：扣除敌人25点体力，并附加「虚弱（降低攻击伤害）」、「脆弱（减伤效果无效）」、「迟缓」",
		"Ｗ◇iv. 阴寒侵袭：扣除敌人我方攻击伤害两倍的内力。并附加「寒读侵脉」。",
"Ｌ◇b. 五岳神剑 东：",
	"Ｄ◇I. 触发方式：",
		"Ｗ◇i. 取得「五岳派真传盟主」身份，并学有五岳神剑，攻击时使用「五岳神剑 东」触发。",
		"Ｗ◇ii. 取得「五岳派真传盟主」身份，并学有五岳神剑，攻击时使用任一方位的五岳神剑，机率触发。",
		"Ｗ◇iii. 学全五岳派五个进阶内功，并主运「磐石法决」，使用泰山十八盘触发。",
	"Ｄ◇II. 效果：	",
		"Ｗ◇五岳神剑专属：对中毒状态的敌人伤害增加。",
		"Ｗ◇i.  巨木槌击：以敌方内力缺少值附加伤害，并止杀敌方一回合",
		"Ｗ◇ii. 茂木成林：对自己附加「徐如林」状态，回复集气",
		"Ｗ◇iii.藤蔓纠缠：附加剧毒状态最高50时序、基础蛊毒1回合（下回合回气降低、毒性爆发会杀更多血）",
		"Ｗ◇iv. 青霉蔓延：对全场敌人附加大量中毒，且一定时序内中毒无法以任何方法解除。",
"Ｌ◇c. 五岳神剑 南：",
	"Ｄ◇I. 触发方式：",
		"Ｗ◇i. 取得「五岳派真传盟主」身份，并学有五岳神剑，攻击时使用「五岳神剑 南」触发。",
		"Ｗ◇ii. 取得「五岳派真传盟主」身份，并学有五岳神剑，攻击时使用任一方位的五岳神剑，机率触发。",
		"Ｗ◇iii. 学全五岳派五个进阶内功，并主运「镇岳决」，使用云雾十三式触发。",
	"Ｄ◇II. 效果：	",
		"Ｗ◇五岳神剑专属：对灼烧状态的敌人伤害增加。",
		"Ｗ◇i.  烈火焚城：对全场附加灼烧，并根据当前灼烧值扣除生命",
		"Ｗ◇ii. 松明抚斩：以自身轻功、敌方内力现值来增加伤害",
		"Ｗ◇iii.火毒攻心：对敌方附加火毒攻心。若敌方当前灼烧值大于40，机率附加点燃",
		"Ｗ◇iv. 怒火中烧：对敌方埋下陷阱，敌方因任何原因怒气爆发时，附加50点内伤、30点灼烧以及25时序集气紊乱状态。",
"Ｌ◇d. 五岳神剑 中：",
	"Ｄ◇I. 触发方式：",
		"Ｗ◇i. 取得「五岳派真传盟主」身份，并学有五岳神剑，攻击时使用「五岳神剑 中」触发。",
		"Ｗ◇ii. 取得「五岳派真传盟主」身份，并学有五岳神剑，攻击时使用任一方位的五岳神剑，机率触发。",
		"Ｗ◇iii. 学全五岳派五个进阶内功，并主运「寒冰真气」，使用万岳朝宗触发。",
	"Ｄ◇II. 效果：	",
		"Ｗ◇五岳神剑专属：对内伤状态的敌人伤害增加。",
		"Ｗ◇i.  峰峦如聚：为自己附加如山特效。下一次被攻击时，第一击大量减少伤害。",
		"Ｗ◇ii. 乱石穿空：对全场附加内伤，并减少等同于内伤值的集气。",
		"Ｗ◇iii.沙瀑大葬：对全场附加迟缓，并减少等同于内伤值的生命。",
		"Ｗ◇iv. 流沙囚牢：对全场附加锁足以及「残劲破体（攻击加力会对攻击者自己附加内伤）」状态。",
"Ｌ◇e. 五岳神剑 西：",
	"Ｄ◇I. 触发方式：",
		"Ｗ◇i. 取得「五岳派真传盟主」身份，并学有五岳神剑，攻击时使用「五岳神剑 西」触发。",
		"Ｗ◇ii. 取得「五岳派真传盟主」身份，并学有五岳神剑，攻击时使用任一方位的五岳神剑，机率触发。",
		"Ｗ◇iii. 学全五岳派五个进阶内功，并主运「紫霞神功」，使用太岳三清峰触发。",
	"Ｄ◇II. 效果：	",
		"Ｗ◇五岳神剑专属：对流血状态的敌人伤害增加。",
		"Ｗ◇i.  金石可镂：根据敌我攻击力差增幅伤害。",
		"Ｗ◇ii. 电光连环：全屏攻击，并根据敌人数量增加伤害（群战收割机）。",
		"Ｗ◇iii.经脉寸断：附加「撕裂」状态。",
		"Ｗ◇iv. 金光夺目：对全场附加盲目状态。		",
"Ｌ◇B. 新增五岳剑派第六等级「真传盟主」:",
"Ｄ◇a. 取得方法",
	"Ｗ◇1.身为五岳门人，身上练有五岳心法＋五岳剑法（共十个武功）。",
	"Ｗ◇2.达成条件1.，选择修炼「五岳剑诀」时，选择将心法以及剑法都一脉，即可升阶(十个武功会洗剩两个)。",
"Ｄ◇b. 效果：",
	"Ｗ◇1. 若本身天赋内功为五岳心法其一，会洗为五岳剑诀",
	"Ｗ◇2. 若本身天赋外功1为五岳剑法其一，会洗为五岳神剑",
	"Ｗ◇3. 升阶时增加御剑值250点。",
	"Ｗ◇4. 五岳剑诀在面板上即可享有五岳心法所有的被动效果（不包含组合）、必出基础五岳剑效果。",
	"Ｗ◇5. 独立计算触发「气贯五岳」、「以剑御气」的机率。",
	"Ｗ◇6. 前述效果皆不需主运五岳剑诀（包含五岳神剑效果）",
}

ItemInfo[300]={
"Ｇ装备效果；50%机率触发“降龙四叠浪”，增加降龙三叠浪机率。",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：增加降龙三叠浪机率5%",
"Ｗ◇LV.2：增加降龙三叠浪机率10%",
"Ｗ◇LV.3：增加降龙三叠浪机率15%",
"Ｗ◇LV.4：增加降龙三叠浪机率20%",
"Ｗ◇LV.5：增加降龙三叠浪机率25%",
"Ｗ◇LV.6（MAX）：增加降龙三叠浪机率30%",
"Ｄ装备特效：",
"Ｚ特别说明："
}

ItemInfo[308]={
"Ｌ习得内功：鲸息功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇时序增加怒气值2点",
"Ｗ◇每3时序回1内伤",
"Ｗ◇每时序回1点中毒",
"Ｗ◇30%概率造成目标集气紊乱",
"Ｗ◇时序回复3点生命/6点内力",
"Ｗ◇使用碧海惊涛掌攻击必触发六大奇劲之一：",
    "Ｗ陷空力：忽视绝对气防+破防50%",	
	"Ｗ滔天炁：触发大范围伤害",	
	"Ｗ生灭道：攻击后触发霸体一回合",
	"Ｗ漩涡劲：增加一次连击",		
	"Ｗ阴阳流：必冰封必灼烧",	
	"Ｗ滴水劲：附加气攻值5%伤害",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇根据蓄力值增加气防值",
"Ｗ◇被攻击跟据伤害值蓄力，蓄力值大于1000自身攻击必暴击",
"Ｗ◇根据蓄力值提升气攻",
"Ｗ◇免疫冰封",
"Ｗ◇使用碧海惊涛掌攻击概率触发六大奇劲之一：",
    "Ｗ陷空力：忽视绝对气防+破防50%",	
	"Ｗ滔天炁：触发大范围伤害",	
	"Ｗ生灭道：攻击后触发霸体一回合",
	"Ｗ漩涡劲：增加一次连击",		
	"Ｗ阴阳流：必冰封必灼烧",	
	"Ｗ滴水劲：附加气攻值5%伤害",
}

ItemInfo[309]={
"Ｌ习得外功：无",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：李寻欢专属"
}

ItemInfo[310]={
"Ｌ习得外功：碧海惊涛掌",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1400",
"Ｗ内力消耗：140",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：学会“鲸息功”使用碧海惊涛掌可概率触发六大奇劲，主运必触发",
"Ｗ◇陷空力：忽视绝对气防+破防40%",	
"Ｗ◇滔天炁：触发大范围伤害",	
"Ｗ◇生灭道：攻击后触发霸体一回合",
"Ｗ◇漩涡劲：增加一次连击，最多增加两次",		
"Ｗ◇阴阳流：必冰封必灼烧",	
"Ｗ◇滴水劲：附加气攻值5%伤害",
"Ｗ◇梁萧任意攻击触发，其他人使用碧海惊涛掌",
"Ｚ特别说明：无"
}

--newkdef[311太虚剑意]=function()
ItemInfo[311]={
"Ｌ习得内功：太虚剑意",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回1内伤",
"Ｗ◇每时序回2点气血",
"Ｗ◇ “坐忘无我 韬光养晦”：被攻击时，受到气攻大于1500发动，吸收气攻值为自身的气防",
"Ｗ◇ “三环套月”：使用剑法时太虚剑意加力50%机率三连击",
"Ｗ◇ “万剑归宗”：使用剑法时太虚剑意加力高概率造成封穴，追加气攻值1500点",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇每5时序回1内伤",
"Ｗ◇每时序回内力+4点",
"Ｗ◇ “三环套月”：使用剑法时太虚剑意加力20%机率三连击",
"Ｗ◇ “万剑归宗”：使用剑法时太虚剑意加力高概率封穴，追加气攻值600点",
}

--newkdef[312神秘护符]=function()
ItemInfo[312]={

"Ｚ特别说明：神秘力量的护符"
}

--newkdef[313斩流剑术]=function()
ItemInfo[313]={
"Ｌ习得外功：斩流剑术",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1600",
"Ｗ内力消耗：140",
"Ｗ武功范围：线型 8格",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：无"
}

--newkdef[314千年冰蚕]=function()
ItemInfo[314]={
"Ｌ物品说明：千年冰蚕，炼制地灵丹的药材之一",
"Ｎ",
"Ｄ使用效果：+100抗毒",
                                    
}

--newkdef[315神木王鼎]=function()
ItemInfo[315]={
"Ｌ物品说明：星宿派至宝，炼制地灵丹的鼎炉",
"Ｎ",
"Ｄ使用效果：无",
                                    -- by 飘夜
}

--newkdef[316地灵丹]=function()
ItemInfo[316]={
"Ｌ物品说明：增加武常50点",  
}

--newkdef[317不老长春功]=function()
ItemInfo[317]={
"Ｌ习得内功：不老长春功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇血量百分比高于内力百分比时",
"Ｗ◇时序回复百分之一内力",
"Ｗ◇血量百分比低于内力百分比时",
"Ｗ◇时序回复百分之一生命",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇时序回复(5+天书数量)的生命值",
"Ｗ◇时序回复(5+天书数量)的内力值",

"Ｎ",
"Ｄ组合效果：不老长春功 + 北冥神功",
}

--newkdef[318阳春白雪曲]=function()
ItemInfo[318]={
"Ｌ习得外功：阳春白雪曲",
"Ｎ",
"Ｗ武功威力：650",
"Ｗ武功气攻：1400",
"Ｗ内力消耗：140",
"Ｗ武功范围：面 4格",
"Ｎ",
"Ｄ组合特效：",


"Ｚ特别说明：无",                                     
}

--newkdef[319一苇渡江]=function()
ItemInfo[319]={
"Ｌ习得轻功：一苇渡江",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
"Ｗ◇基础：被攻击时受到封穴减少50%，回合结束后机率减少5~10的封穴",
"Ｗ◇基础：「步法足相」：回合结束后机率减少5~10点封穴",
"Ｗ◇进阶：免疫迟缓等使集气速度下降的陷阱状态",
"Ｗ◇高阶：「西天坦途」：时序将自身冻结等重大影响集气特效换成封穴",
"Ｗ◇高阶：「空如我相」：被攻击时封穴不为零，则以封穴值计算机率触发闪避",
"Ｗ◇门派：「少林寺」，被打出破绽时，减少气攻并获得加速效果",
"Ｗ◇特殊人物：扫地老僧，时序机率完全清除封穴",
"Ｗ◇特殊人物：达摩，攻击爆怒状态敌人时，自身增加20点怒气",

"Ｎ",
"Ｄ被动效果：",
"Ｗ◇集气速度不受异常影响",
}

--newkdef[320狼牙]=function()
ItemInfo[320]={
"Ｇ装备效果；攻击时50%几率造成流血",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：攻击时50%几率造成流血",
"Ｗ◇LV.2：攻击时60%几率造成流血",
"Ｗ◇LV.3：攻击时70%几率造成流血",
"Ｗ◇LV.4：攻击时80%几率造成流血",
"Ｗ◇LV.5：攻击时90%几率造成流血",
"Ｗ◇LV.6（MAX）：攻击时必造成流血，50%机率发动“天狼啸月”",
"Ｄ装备特效：",
 "Ｗ◇“天狼啸月”：造成敌全体集气-100",
}

--newkdef[321井月八法]=function()
ItemInfo[321]={
"Ｌ习得外功：井月八法",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：140",
"Ｗ武功范围：井字 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：无",                                        
"Ｗ◇暴击率提升5%",
"Ｗ◇根据学会的刀法提升暴击伤害，一个刀法提升30%", 

}

--newkdef[322擒龙手]=function()
ItemInfo[322]={
"Ｌ习得外功：擒龙手",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：140",
"Ｗ武功范围：米字 5格",
"Ｎ",
"Ｚ组合特效：",
"Ｗ◇必连击",
"Ｗ◇虎鹤双形：学会擒龙手、虎爪绝户手。",
"Ｗ◇攻击时概率触发“虎啸”、“龙吟”。", 
"Ｗ◇虎啸：周身六格内目标概率混乱", 
"Ｗ◇龙吟：被击的目标击集气位置倒退300。",                                       --飘夜
}

--newkdef[23伏魔禅杖]=function()
ItemInfo[323]={
"Ｇ装备效果；伏魔杖法威力+200，增加世尊降魔触发机率(装备等级*2)",
"Ｎ",
"Ｄ装备等级：无",                               -- by 飘夜
}

--newkdef[324般若掌]=function()
ItemInfo[324]={
"Ｌ习得外功：般若掌",
"Ｎ",
"Ｗ武功威力：650",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：140",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇金刚般若：学会大力金刚掌、般若掌、龙象般若功，破防目标30%",
"Ｗ◇大力金刚掌必暴击,般若掌攻击范围变成点，威力提高。",
"Ｗ◇主运龙象般若功，概率触发【十龙十象】击晕目标。",
"Ｚ特别说明：",                                       --飘夜
}

--newkdef[325猿公剑法]=function()
ItemInfo[325]={
"Ｌ习得外功：猿公剑法",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：35",
"Ｗ武功范围：线 8格",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：",                                       --飘夜
"Ｗ◇必连击",
}

--newkdef[326白猿]=function()
ItemInfo[326]={
"Ｇ装备效果；猿公剑法/越女剑法威力+200",
"Ｎ",
"Ｄ装备等级：无",                               -- by 飘夜
}

--newkdef[327天魔功]=function()
ItemInfo[327]={
"Ｌ习得外功：天魔功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇吸血20%",
"Ｗ◇攻击必暴击",
"Ｗ◇无视目标30%防御",
"Ｗ◇“天魔大法”：暴怒时30%几率入魔",
"Ｗ◇“天魔大法”：免疫封穴杀气，额外吸血20%，必连击概率三连击",
"Ｗ◇“天魔大法”：暴怒结束入魔结束",
"Ｗ◇“天魔金身”：受攻击时如自身生命值低于一半，免疫攻击10时序，CD50时序",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇行动后增加10点怒气值",
"Ｗ◇无视目标10%防御",

"Ｎ",
"Ｄ组合效果：天魔功 + 易筋神功 + 忘情天书",
"Ｗ◇天魔气场：周身八格内的敌人，被附加虚弱状态，若敌人在自身八格内怒气爆发，",
"Ｗ◇集气速度进入波动状态。",
"Ｗ◇魔之战息：每次行动后，增加己身怒气。若行动后怒气爆发，增加自身回气并下",
"Ｗ◇回合提升一定伤害。",
"Ｗ◇魔问伪佛：道德越低，攻防效果越强，面对少林派再额外加强，并在攻击时对少",
"Ｗ◇林寺门人附加渡化2~3回合",
"Ｗ◇邪心魔佛 天魔金身：",
"Ｗ◇触发天魔金身时,机率延长有效时间。发动天魔金身时被攻击机率增加自身集气。",
"Ｗ◇天魔金身解除时机率爆怒，并对全场附加恐惧状态。",
"Ｗ◇天魔啸：行动前机率使全场敌方降怒气20点。",
"Ｗ◇破甲尖锋七旋指：使用指法攻击，先以指系数加成伤害后再增加7%~49%。",
"Ｗ◇爆怒时额外再增加7%~49%，且低机率清零敌方护盾（九阳、太极、金刚、神足",
"Ｗ◇等，但动画会卡在原地，尚在寻找解决方法。）",
"Ｗ◇佛魔化身：",
"Ｗ◇触发条件：资质为50，被攻击时血量低于500时，第一次必定触发，之后低机率触发。",
"Ｗ◇效果：可召唤出一个复制体，享有除天赋外所有练组合者的特质。此复制体不可",
"Ｗ◇控，当练组合者死亡时，复制体会代替死亡。",
"Ｗ◇复制体战死则不影响练组合者。",
"Ｗ◇ 此特效触发时，中庸CD减半。",
"Ｗ◇魔佛诗号新增第二种：声声句句鬼如来。战斗出场发动时给予全场我方「鬼如来」特效。",
"Ｗ◇鬼如来:在该场战斗中第一次被打到怒气爆发时，无视任何条件入魔。",
"Ｗ◇刀系武功触发「如是我斩」特效：当我方道德低于敌方时，根据道德差距附加气攻。",
"Ｗ◇如是我斩:当道德差距大于30时，使用刀法攻击必然破气防且无视敌方50%的防御力。",

"Ｗ◇以上道德差距的要求，若敌方为少林寺时不在此限，必然发动。",
"Ｗ◇指系攻击时，若敌方有金刚盾，则提升破盾机率，并依据敌方金刚护盾数值增加伤害。",

"Ｎ",
"Ｄ组合效果：天魔功 + 吸星大法",
"Ｗ◇主运天魔功额外暴怒一次。",

"Ｎ",
"Ｄ魔心四相：自身不为少林派且「道德为零及主运血河神鉴」或「主运天魔功」",
"Ｗ◇根据四相指学习数量，使用四相指法触发以下效果：",
"Ｗ◇学一指：魔执我相：攻击必定封穴、灼烧、冰封、内伤。并机率附加火毒、寒毒、","Ｗ◇封穴陷阱（封穴解除时集气向后150～200）、残劲破体",
"Ｗ◇学二指：魔执人相：根据敌方人数增幅攻击力（有保底）",
"Ｗ◇学三指：众生魔相：大范围极意攻击且使敌方混乱。",
"Ｗ◇学四指：无佛者相：必定使敌方受到（敌方道德X4）的真实伤害（无视护盾）",

}

--newkdef[328庄子]=function()
ItemInfo[328]={
"Ｌ习得内功：大周天功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇大宗师概率50%概率",
"Ｗ◇“养生主概率50%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇封穴减少50%",
"Ｗ◇“大宗师”：攻击30%概率触发，无视对方80%的武常。",
"Ｗ◇“养生主”：被攻击30%触发50时序内，时序回复气血2/内力4，",
"Ｗ           免疫封穴，时序免疫所有攻击内伤",
}

--newkdef[329奔雷手]=function()
ItemInfo[329]={
"Ｌ习得外功：奔雷手",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：105",
"Ｗ武功范围：米字 5格",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：",                                       --飘夜
}


--newkdef[330追魂夺命剑谱]=function()
ItemInfo[330]={
"Ｌ习得外功：追魂夺命剑法",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：70",
"Ｗ武功范围：线 8格",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：",                                       --飘夜
}

--newkdef[331庖丁解牛刀]=function()
ItemInfo[331]={
"Ｌ习得外功：庖丁解牛刀",
"Ｎ",
"Ｗ武功威力：750",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：140",
"Ｗ武功范围：《 7格",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：",
"Ｗ◇良庖岁更刀：对生命低于40%的目标附加目标最大生命值10%的伤害",
"Ｗ◇良庖岁更刀：对生命低于10%的目标概率一击必杀",                                       --飘夜
}

--newkdef[332袈裟伏魔功]=function()
ItemInfo[332]={
"Ｌ习得外功：袈裟伏魔功",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：140",
"Ｗ武功范围：面 3格",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：",                                       --飘夜
}


--newkdef[333迷踪连环腿]=function()
ItemInfo[333]={
"Ｌ习得外功：迷踪连环腿",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：700",
"Ｗ内力消耗：50",
"Ｗ武功范围：十字 5格",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：",                                       --飘夜
}




--newkdef[334无极玄功拳]=function()
ItemInfo[334]={
"Ｌ习得外功：无极玄功拳",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：70",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                       --飘夜
}




--newkdef[335白龙剑]=function()
ItemInfo[335]={
"Ｇ装备效果；剑法攻击范围+1",
"Ｎ",
"Ｄ装备等级：无",                               -- by 飘夜
}




--newkdef[336武穆遗书]=function()
ItemInfo[336]={
"Ｌ习得特技：武穆遗书",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇根据（实战数值/2）增加战场攻击力",
"Ｗ◇根据（实战数值/2）增加战场防御力",
"Ｎ",
"Ｄ被动效果：",
"Ｗ我方全体攻击增加（实战数值/25）%",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇血战沙场：同时修炼岳家枪法/岳王散手/武穆遗书",
"Ｗ◇血战沙场：使用岳家枪法/岳王散手对周身7X7范围内的敌人造成10~20点伤害1次",
"Ｗ            根据击杀数和怒气值(每50点怒气增加1次，暴怒额外增加2次)增加伤害次数",
"Ｎ",
"Ｚ特别说明：", 
"Ｗ威力等于750+实战数值",
}




--newkdef[337岳王散手]=function()
ItemInfo[337]={
"Ｌ习得外功：岳王散手",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：140",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇血战沙场：同时修炼岳家枪法/岳王散手/武穆遗书",
"Ｗ◇血战沙场：使用岳家枪法/岳王散手对周身7X7范围内的敌人造成10~20点伤害1次",
"Ｗ            根据击杀数和怒气值(每50点怒气增加1次，暴怒额外增加2次)增加伤害次数",
"Ｎ",
"Ｚ特别说明：",                      
"Ｗ◇习得岳王散手后，再学习岳家枪法的需求降低40点",                                      --飘夜
}

--newkdef[386岳家枪法]=function()
ItemInfo[386]={
"Ｌ习得外功：岳家枪法",
"Ｎ",
"Ｗ武功威力：750",
"Ｗ武功气攻：1500",
"Ｗ内力消耗：140",
"Ｗ武功范围：米字 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇血战沙场：同时修炼岳家枪法/岳王散手/武穆遗书",
"Ｗ◇血战沙场：使用岳家枪法/岳王散手对周身7X7范围内的敌人造成10~20点伤害1次",
"Ｗ            根据击杀数和怒气值(每50点怒气增加1次，暴怒额外增加2次)增加伤害次数",
"Ｎ",
"Ｚ特别说明：",                      
"Ｗ◇习得岳家枪法后，再学习岳王散手的需求降低40点",                                      --飘夜
}

--newkdef[338冰蚕毒掌]=function()
ItemInfo[338]={
"Ｌ习得外功：冰蚕毒掌",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：105",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇毒布武林：同时修炼五毒神掌/五毒神功/冰蚕毒掌or千蛛万毒手/连环腐尸毒/五毒神功",
"Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
"Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
}

--newkdef[339青驴]=function()
ItemInfo[339]={
"Ｇ装备效果；集气速度增加5点，体力消耗减2点",
	}	                            -- by 飘夜


--newkdef[340寒袖拂穴]=function()
ItemInfo[340]={
"Ｌ习得外功：寒袖拂穴",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：105",
"Ｗ武功范围：面攻 4格",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：",     
"Ｗ◇必定封穴",                                  --飘夜
}

--newkdef[341白虹掌力]=function()
ItemInfo[341]={
"Ｌ习得外功：白虹掌力",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：105",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：",                                       --飘夜
}

--newkdef[342长生诀]=function()
ItemInfo[342]={
"Ｌ习得内功：长生诀",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇免疫内伤",
"Ｗ◇减少30%受到的气攻",
"Ｗ◇重生回复满血并立即行动",
"Ｗ◇时序回点3点气血",
"Ｗ◇顾道长生：被攻击时25%概率触发，5时序内每时序恢复最大生命内力1%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇重生回复(50~65)%的气血",
"Ｗ◇阴阳相生：攻击造成灼烧时必定造成冰封，造成冰封时必定造成灼烧",
}

ItemInfo[346]={
"Ｌ四大山皮肤",
"Ｎ",
"Ｌ至尊江湖，至尊江湖，绿色国产单机武侠，至尊江湖倒闭了。",
"Ｌ王八蛋老板四大山,吃喝嫖赌欠下了3.5个亿，带着他的小姨子跑了。",
"Ｌ我们没有没有办法，拿着皮肤抵工资。",
"Ｌ原价都是三百多、二百多、一百多的皮肤，通通二十块，通通二十块！",
                                     --飘夜
}

ItemInfo[349]={
"Ｇ装备效果；进战集气增加900，必流血，破防5%",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：破防5%",
"Ｗ◇LV.2：破防10%",
"Ｗ◇LV.3：破防15%",
"Ｗ◇LV.4：破防25%",
"Ｗ◇LV.5：破防25%",
"Ｗ◇LV.6（MAX）：破防30%，必破气防"                            
}

--newkdef[350玉女素心剑法]=function()
ItemInfo[350]={
"Ｌ习得外功：玉女素心剑法",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：400",
"Ｗ武功范围：《 8格",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                         --飘夜
}


ItemInfo[351]={
"Ｌ习得内功：擒龙功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇免疫反弹 反击，斗转",
"Ｗ◇增加丐世无双触发概率10%",
"Ｗ◇降龙打狗招式概率增加5%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇时序回复流血2点",
"Ｗ◇丐世无双学会其中一种另一种要求再降低20",
"Ｗ◇降龙极意概率高于等于40增加概率10",
"Ｗ◇降龙极意概率低于40增加概率20",
"Ｗ◇增加打狗极意20%",
"Ｗ◇吸收20%受到的伤害，降低25%受到的杀气。",
"Ｗ◇完全免疫反击、斗转",
"Ｗ◇完全免疫「单内功」或「单天赋」所带来的伤害转移（例如斗转主运、甩锅天赋等）",
"Ｗ◇有40%固定机率免疫「内功组合」带来的伤害反弹（例如太极纯阳反弹）",
}

ItemInfo[352]={
"Ｌ习得外功：呼延鞭法",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：15",
"Ｗ武功范围：田 4格",
"Ｄ组合特效：",
"Ｗ◇寸长寸强：同时修炼呼延枪法和呼延鞭法或者火枪到极",
"Ｗ◇寸长寸强：使用任意奇门武功攻击不随距离递减，距离每远一格伤害增加1%",
}

ItemInfo[353]={
"Ｌ习得外功：震天铁掌",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：390",
"Ｗ武功范围：米 4格",
}

ItemInfo[354]={
"Ｌ习得内功：枯禅神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇免疫流血",
"Ｗ◇指法出招式概率+20%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇时序回复内力3点",
"Ｗ◇亦枯亦荣：每回合消耗内力最大值的5%回复生命值",
"Ｗ◇一阳指威力增加200，六脉神剑“剑气碧烟横”出招增加10%",
"Ｗ◇指法出招式概率+10%",
}

ItemInfo[355]={
"Ｌ习得内功：少林心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇被攻击减伤200",
"Ｎ",
"Ｚ特别说明：少林一脉相承",  
"Ｗ◇学会少林心法，修炼易筋经时可以一脉相承",
}

ItemInfo[356]={
"Ｌ习得内功：武当心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇被攻击减伤25%",
"Ｎ",
"Ｚ特别说明：武当一脉相承",  
"Ｗ◇学会武当心法，修炼太极神功时可以一脉相承",
}

ItemInfo[357]={
"Ｌ习得内功：全真心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击后恢复100点生命内力、3点体力",
"Ｎ",
"Ｚ特别说明：全真一脉相承",  
"Ｗ◇学会全真心法，修炼先天功时可以一脉相承",
}


ItemInfo[358]={
"Ｌ习得内功：古墓心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇战场轻功增加150点",
"Ｎ",
"Ｚ特别说明：古墓一脉相承",  
"Ｗ◇学会古墓心法，修炼玉女神功时可以一脉相承",
}

ItemInfo[359]={
"Ｌ习得内功：华山心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｎ",
"Ｚ特别说明：华山一脉相承",  
"Ｗ◇学会华山心法，修炼紫霞神功时可以一脉相承",
}

ItemInfo[360]={
"Ｌ习得内功：嵩山心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｎ",
"Ｚ特别说明：嵩山一脉相承",  
"Ｗ◇学会嵩山心法，修炼寒冰真气时可以一脉相承",
}

ItemInfo[361]={
"Ｌ习得内功：血刀心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｎ",
"Ｚ特别说明：血刀一脉相承",  
"Ｗ◇学会血刀心法，修炼血河神鉴时可以一脉相承",
}

ItemInfo[362]={
"Ｌ习得内功：莲花功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｎ",
"Ｚ特别说明：丐帮一脉相承",  
"Ｗ◇学会莲花功，修炼擒龙功时可以一脉相承",
}

ItemInfo[363]={
"Ｌ习得内功：地火功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｎ",
"Ｚ特别说明：明教一脉相承",  
"Ｗ◇学会地火功，修炼圣火神功时可以一脉相承",
}

ItemInfo[364]={
"Ｌ习得内功：峨眉心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｎ",
}

ItemInfo[365]={
"Ｌ习得内功：小星罗功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｎ",
}

ItemInfo[366]={
"Ｌ习得内功：寒冰真气",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇拳法武功出招+20%",
"Ｗ◇对冰封值超过80的人概率冻结",
"Ｗ◇5时序回内伤1点",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇拳法武功出招+10%",
"Ｗ◇攻击必冰封",
"Ｗ◇免疫冰封",
"Ｗ◇万岳朝宗攻击力上升100点，使用万岳朝宗机率触发「中岳如座」",
"Ｗ◇ 30%概额外减伤100-180点。",
}

ItemInfo[367]={
"Ｌ习得内功：五毒神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇五毒神掌威力提升350点，战斗中基础威力随机提升1-3倍",
"Ｗ◇五毒神掌变为赤练神掌，追加70点伤害，引爆目标身上毒素",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击强制上毒20点",
"Ｗ◇攻击时根据目标中毒值追加伤害",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇毒布武林：同时修炼五毒神掌/五毒神功/冰蚕毒掌or千蛛万毒手/连环腐尸毒/五毒神功",
"Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
"Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
}
--223
ItemInfo[368]={
"Ｌ习得外功：金雁功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
"Ｗ◇基础：气攻气防增加777",
"Ｗ◇基础：连击、暴击率增加20%，连击、暴击伤害皆增加20%",
"Ｗ◇进阶：增加移动范围，行动后根据移动步数回气（可叠加），并放宽回气限制",
"Ｗ◇高阶：被攻击时机率触发瞬移，回上一回合移动前的位置，机率连续触发",
"Ｗ◇高阶：瞬移后机率回复少量血内体或消耗500内力、10点体力清除debuff",
"Ｗ◇天轻：移动后根据移动步数增加暴击机率及暴击伤害，低机率附加恐惧",
"Ｗ◇门派：「全真教」行动后的回气量额外上升",
"Ｗ◇门派：「全真教」有学但不主运先天功，有额外低机率被攻击时触发先天护盾",
"Ｗ◇门派：「全真教」若主运先天功，则减少先天护盾CD的20时序",
"Ｗ◇特殊人物：王重阳，重生之后可无视CD，行动后可补充先天护盾值",
"Ｗ           补充量为移动步数的10~50倍"
}
--224
ItemInfo[369]={
"Ｌ习得内功：蛇行狸翻",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇无视ZOC限制移动，且移动格数+1（提升移动能力需下回合生效）",
"Ｗ◇基础：每20时序(轻功值)%机率集气往前跳跃（轻功值）/10位置（即跳气）",
"Ｗ◇进阶：集气跳跃量上升。即是被封穴依然可以跳气",
"Ｗ         每一次跳气都有机率对所有集气位置低于自己的敌人附加迟缓状态",
"Ｗ◇高阶：时序机率將自己拉到跟场上集气位置最高者等同集气位置",
"Ｗ◇特殊高阶：主运九阴（不得用天赋代替），集气位置最高者与主角互换集气位置",
"Ｗ◇特殊高阶：主运逆运，发动高阶效果时，有小机率直接怒气爆发",
"Ｗ◇天轻：跳气发动时，低机率为敌方附加「仓惶」状态10时序",
"Ｗ		    仓惶：每一时序都有机率集气位置减少50~100",
"Ｗ◇门派：暂无",
"Ｗ◇特殊人物：黄裳，跳气发动机率提升，跳气发动时必然给敌人附加迟缓"
}

ItemInfo[370]={
"Ｌ习得外功：葵花点穴手",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：105",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇攻击必定封穴",
"Ｗ◇被攻击减免10点封穴",
}

ItemInfo[371]={
"Ｌ习得内功：龟息功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇蓄力状态下集气速度增加15%",
"Ｗ◇防御状态下无法被杀气，被攻击35%概率触发“伺机而动”集气位置增加100",
"Ｗ◇5时序回内伤1点",
"Ｗ◇防御状态下，免疫破绽",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇休息时自动防御",
"Ｗ◇时序回生命2点",
"Ｗ◇被攻击时概率进入防御状态，初始概率25，生命越低概率越高",
"Ｗ◇防御状态下被攻击时反震目标内伤15点",
"Ｄ一脉相承：",  
"Ｗ◇学习不老长春功时可以一脉相承。",
}

ItemInfo[372]={
   "Ｌ习得奇术：中庸之道",
   "Ｎ",
   "Ｄ天命之谓性 特效：",
   "Ｗ◇每（资质-1）时序行动一次",
   "Ｎ",
   "Ｄ率性之谓道 特效：",
   "Ｗ◇受到攻击后如果满怒，（资质-29）%几率结束对手攻击并反击",
   "Ｎ",
   "Ｚ特别说明：",
   "Ｗ◇需资质低于80且资质大于30",
}

ItemInfo[307]={
   "Ｌ习得轻功：灵鳌步",
   "Ｎ",
   "Ｄ特效：",
   "Ｗ◇基础：被攻击时，机率可挪移2格以闪避攻击",
   "Ｗ◇进阶：增加2格挪移范围。移动后若仍被攻击到，则机率触发格档",
   "Ｗ◇高阶：挪移时，机率触发「幻潮化影」特效，诞生出一个只有1血的分身",
   "Ｗ◇该分身没有武功，但自带一回合的霸体状态被攻击会储存伤害",
   "Ｗ◇当分身解除霸体并死亡时，八格内敌方被扣除等同分身所储存伤害的生命",
   "Ｗ◇特殊人物：「梁萧」挪移距离增加为六格（与进阶效果不叠加）",
   "Ｗ◇挪移后可自选武功反击"
}

ItemInfo[373]={
   "Ｌ习得内功：八卦心法",
   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇使用刀法，系数必然不低于对方。",
   "Ｗ◇刀法武功出招概率+20%。",   
   "Ｎ",
   "Ｄ被动效果：",
   "Ｗ◇刀法武功出招概率+10%。",  
   "Ｎ",
   "Ｚ特别说明：",
   "Ｗ◇主运八卦心法，八卦刀法与八卦掌法威力+200",  
}

ItemInfo[374]={
   "Ｌ习得外功：八卦刀法",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：△ 5格",
   "Ｎ",
   "Ｚ特别说明：",
   "Ｗ◇主运八卦心法，八卦刀法与八卦掌法威力+200",
}

ItemInfo[375]={
   "Ｌ习得外功：神门十三剑",
   "Ｎ",
   "Ｗ武功威力：500",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：《 6格",
   "Ｎ",
   "Ｄ组合特效：",
   "Ｗ◇炼神还虚：同时修炼神门十三剑/玄虚刀法",
   "Ｗ◇炼神还虚：玄虚刀法必封穴，神门十三剑必冰封灼烧",
   "Ｗ◇炼神还虚：受到攻击30%几率使用双倍内力抵消一半伤害",
   "Ｎ",
   "Ｚ特别说明：",
   "Ｗ◇必封穴",
}

ItemInfo[376]={
   "Ｌ习得外功：五虎棍法",
   "Ｎ",
   "Ｗ武功威力：300",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：田 4格",
   "Ｎ",
"Ｄ组合特效：",
"Ｗ◇五虎闹东京：同时修炼五虎断门刀和五虎棍法",
"Ｗ◇赞天虎身轻如燕：一虎在场，攻击时30%几率提升全队100集气",
"Ｗ◇彻地虎是条好汉：二虎在场，被攻击时30%几率提高1000点气防",
"Ｗ◇穿山虎铁臂神拳：三虎在场，攻击时30%几率增加100点伤害",
"Ｗ◇翻江虎身手不凡：四虎在场，集气条30%几率跳跃10点集气速度",
"Ｗ◇锦毛虎一身是胆：五虎在场，被攻击时30%几率反弹10%伤害",
}

ItemInfo[377]={
   "Ｌ习得外功：流云飞袖",
   "Ｎ",
   "Ｗ武功威力：600",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：面 3格",
   "Ｎ",
}

ItemInfo[378]={
   "Ｌ习得内功：武当九阳功",
   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇拳掌功夫招式概率+20%。",
   "Ｗ◇增加伤害10%，减伤10%。",    
   "Ｎ",
   "Ｄ被动效果：",
   "Ｗ◇拳掌功夫招式概率+10%。",
   "Ｎ",
   "Ｄ一脉相承：",  
   "Ｗ◇学习九阳神功时可以一脉相承。",
}

ItemInfo[379]={
   "Ｌ习得内功：峨眉九阳功",
   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇剑法武功招式概率+20%。",
   "Ｗ◇行动后概率触发“佛光普照”清除自身灼烧/中毒/冰封/流血/内伤。",   
   "Ｎ",
   "Ｄ被动效果：",
   "Ｗ◇剑法武功招式概率+10%。",
   "Ｎ",
   "Ｄ一脉相承：",  
   "Ｗ◇学习九阳神功时可以一脉相承。",    
}

ItemInfo[380]={
   "Ｌ习得内功：少林九阳功",
   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇奇门武功招式概率+20%。",
   "Ｗ◇增加自身400气防。",
   "Ｗ◇攻击增加自身气防的伤害。",
   "Ｗ◇防御状态下被攻击后为我方回复生命100点、内力200点。",
   "Ｎ",
   "Ｄ被动效果：",
   "Ｗ◇奇门武功招式概率+10%。",
   "Ｗ◇被攻击50%概率进入防御状态。",   
   "Ｎ", 
   "Ｄ一脉相承：",  
   "Ｗ◇学习九阳神功时可以一脉相承。",   
}


ItemInfo[381]={
   "Ｌ习得外功：虎爪绝户手",
   "Ｎ",
   "Ｗ武功威力：450",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：米 4格",
   "Ｎ",
   "Ｚ组合特效：",
   "Ｗ◇虎鹤双形：学会擒龙手、虎爪绝户手。",
   "Ｗ◇攻击时概率触发“虎啸”、“龙吟”。", 
   "Ｗ◇擒龙手，虎爪绝户手概率+20，暴怒概率双倍。",  
   "Ｗ◇虎啸：被击中的目标概率混乱", 
   "Ｗ◇龙吟：被击中的目标集气位置倒退300。",  
}

ItemInfo[382]={
   "Ｌ习得外功：疯魔棍法",
   "Ｎ",
   "Ｗ武功威力：550",
   "Ｗ武功气攻：11000",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：田 5格",
   "Ｎ",
}

ItemInfo[383]={
   "Ｌ习得外功：金蛇缠丝手",
   "Ｎ",
   "Ｗ武功威力：550",
   "Ｗ武功气攻：11000",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：▽ 5格",
   "Ｎ",
   "Ｚ组合特效：", 
   "Ｎ",
}

ItemInfo[384]={
"Ｌ习得内功：小周天功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇增加攻击伤害10%，减少受到的伤害10%。",
"Ｗ◇5时序回复内伤1点。", 
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇增加攻击伤害5%，减少受到的伤害5%。",
"Ｎ",
"Ｄ一脉相承",
"Ｗ◇学习大周天功一脉相承",
}

ItemInfo[387]={
"Ｌ习得内功：神足经",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇攻击后根据移动格数和自身体质增加伤害",
"Ｗ◇行动后根据移动格数和自身体质获得护盾",
"Ｗ◇攻击后根据移动格数和自身体质提升集气",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇每点体质增加2%伤害",
"Ｗ◇每点体质减少2%受伤",
"Ｎ",
"Ｚ组合特效：",
"Ｗ◇梵我合一：学会神足经、瑜伽密乘",
"Ｗ◇梵我合一：受到会暴击或连击的攻击时，20%几率终止敌方行动",
"Ｎ",
}


ItemInfo[388]={
"Ｌ习得得外功：天刀九问",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：280",
"Ｗ武功范围：△ 7格",
"Ｎ",
"Ｚ特别说明：",    
"Ｗ根据天书数量提升威力杀气",
"Ｎ",                                     --小飞侠
}


ItemInfo[402]={
"Ｌ习得外功：绕指柔剑",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：600",
"Ｗ内力消耗：15",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ一脉相承",
"Ｗ◇学习柔云剑法一脉相承",
"Ｎ",                                     --小飞侠
}

ItemInfo[403]={
"Ｌ习得内功：临济十二庄",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇攻击必连击,30%三连击",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇每时序回2点冰封",
"Ｗ◇每时序回2点灼烧",
"Ｗ◇每时序回2点流血",
"Ｗ◇每时序回1点封穴",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇每时序回5点生命",
"Ｗ◇每时序回10点内力",
"Ｗ◇50%几率用双倍内力抵消30%伤害",
"Ｎ",
                                --小飞侠
}

ItemInfo[404]={
"Ｌ习得内功：碧海潮生功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇每次攻击杀内300点",
"Ｗ◇攻击附带额外杀气300点",

"Ｎ",
"Ｄ被动效果：",
"Ｗ◇40%概率暴击",
"Ｗ◇40%概率必破气防",
"Ｎ",
                                  --小飞侠
}

ItemInfo[405]={
"Ｌ习得内功：金关玉锁诀",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇40%概率为敌人附加随机状态",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇免疫锁足",
"Ｗ◇封穴抗性+10",
"Ｗ◇内伤-60%",
"Ｎ",
                                   --小飞侠
}

ItemInfo[406]={
"Ｌ习得内功：冰火阴阳诀",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇每次攻击附带30%概率引燃5时序效果",
"Ｗ◇每次攻击附带30%概率冻结5时序效果",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇免疫冰封",
"Ｗ◇免疫灼烧",
"Ｎ",
}

ItemInfo[407]={
"Ｌ习得内功：奇门遁甲",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇被攻击时,30%概率将伤害的50%转化成护盾",
"Ｗ◇攻击后，时序内伤恢复3点",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击后集气速度+3",
"Ｗ◇攻击后20%概率闪避",
"Ｎ",

}

ItemInfo[408]={
"Ｌ习得内功：忘情天书",
"Ｎ",
"Ｄ运功效果：",
"Ｗ2书领悟：“水逝”增加冰封，冰封过50点概率发动“月映”冰冻5时序", 
"Ｗ3书领悟：“火延”增加燃烧，燃烧过50点概率发动“日明”点燃目标",    
"Ｗ4书领悟：“土掩”减伤30点，机率发动“风流”完全闪避攻击",         
"Ｗ5书领悟：“云翳”必杀集气200，暴怒后20%概率“忘情无我”反弹全部伤害。", 
"Ｗ◇时序回复1点流血。",
"Ｗ◇时序回复2点生命，4点内力。",
"Ｎ",

"Ｄ被动效果：",
"Ｗ1书领悟：“天意”死亡时必触发“天意”复活一次",
"Ｎ",                          --小飞侠
}

ItemInfo[409]={
"Ｌ习得内功：怒涛海潮功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ攻击时，敌方的拳系数按50%计算",
"Ｗ暴怒时，对全场强制杀气100点",
"Ｎ",

"Ｄ被动效果：",
"Ｗ◇50%概率破气防",
"Ｗ◇50%概率暴击",
"Ｗ暴怒时，第一下攻击对全场强制杀气100点",
"Ｎ",                                   --小飞侠
}

ItemInfo[410]={
"Ｌ习得外功：神跌鬼倒",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：30",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[411]={
"Ｌ习得外功：伏魔剑法",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：25",
"Ｗ武功范围：3格大米",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[412]={
"Ｌ习得外功：天长掌法",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[413]={
"Ｌ习得内功：易水寒诀",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每次行动后，或是被攻击，获得五层「易水值」",
"Ｗ◇「易水值」大于25，额外有30%机率触发暴击",
"Ｗ◇「易水值」大于30，暴击伤害+30%",
"Ｗ◇「易水值」大于55，攻击时60%机率触发必中",
"Ｗ◇「易水值」大于85，有9%机率，攻击时杀敌全体900集气",
"Ｗ◇「易水值」大于95，暴怒时立刻行动",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇免疫灼烧",
"Ｗ◇攻击必冰封，并根据冰封值追加伤害",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                     --小飞侠
}

ItemInfo[414]={
"Ｌ习得外功：降魔掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：15",
"Ｗ武功范围：移米 2格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[415]={
"Ｌ习得外功：静心守剑",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：50",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[416]={
"Ｌ习得外功：古针禅功",
"Ｎ",
"Ｗ武功威力：800",
"Ｗ武功气攻：800",
"Ｗ内力消耗：50",
"Ｗ武功范围：正方形4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[417]={
"Ｌ习得外功：五大夫剑",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：15",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[418]={
"Ｌ习得外功：七星落长空",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：25",
"Ｗ武功范围：2格3*3□",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[419]={
"Ｌ习得外功：磐罡掌",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：20",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[420]={
"Ｌ习得外功：开山掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[421]={
"Ｌ习得外功：磐石法诀",
"Ｎ",
"Ｗ武功威力：800",
"Ｗ武功气攻：700",
"Ｗ内力消耗：30",
"Ｗ武功范围：正方形4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[422]={
"Ｌ习得外功：参合剑气",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1500",
"Ｗ内力消耗：350",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｗ◇参合状态：参合指攻击会给敌人添加参合状态", 
"Ｗ◇参合状态：攻击时伤害降低10%~20%", 
"Ｗ◇参合状态：被攻击时受到伤害增加15%~30%",                                       --小飞侠
}

ItemInfo[423]={
"Ｌ习得外功：北斗剑法",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：25",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ一脉相承",
"Ｗ◇学习参合剑气一脉相承",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[424]={
"Ｌ习得外功：降魔刀法",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：20",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[425]={
"Ｌ习得外功：回风拂柳刀",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：25",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[426]={
"Ｌ习得外功：八卦游龙掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：800",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[427]={
"Ｌ习得外功：金刚伏虎刀",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：700",
"Ｗ内力消耗：20",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[428]={
"Ｌ习得外功：周公剑法",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[429]={
"Ｌ习得外功：大嵩阳掌",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：15",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[430]={
"Ｌ习得外功：寒冰神掌",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：15",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[431]={
"Ｌ习得外功：快慢十八路",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：400",
"Ｗ内力消耗：15",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[432]={
"Ｌ习得外功：子午十二剑",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：15",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[433]={
"Ｌ习得外功：迅雷剑法",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[434]={
"Ｌ习得外功：雨打飞花剑法",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[435]={
"Ｌ习得外功：三阴手",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[436]={
"Ｌ习得外功：落雁掌",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[437]={
"Ｌ习得外功：红砂掌",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[438]={
"Ｌ习得外功：六如苍龙诀",
"Ｎ",
"Ｗ武功威力：2000",
"Ｗ武功范围：面攻",
"Ｎ",
"Ｄ组合特效：无需主运",
"Ｎ",
"Ｚ特别说明：标准主角专属武学",                                     --小飞侠
}

ItemInfo[439]={
"Ｌ习得外功：六如隼龙诀",
"Ｎ",
"Ｗ武功威力：20000",
"Ｗ武功范围：面攻",
"Ｎ",
"Ｄ组合特效：无需主运",
"Ｎ",
"Ｚ特别说明：畅想主角专属武学",                                     --小飞侠
}

ItemInfo[440]={
"Ｌ习得外功：同归剑法",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[441]={
"Ｌ习得外功：一气化三清",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[442]={
"Ｌ习得外功：履霜破冰拳",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[443]={
"Ｌ习得外功：昊天掌",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[444]={
"Ｌ习得外功：飘雪穿云掌",
"Ｎ",
"Ｗ武功威力：175",
"Ｗ武功气攻：400",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[445]={
"Ｌ习得外功：金顶绵掌",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[446]={
"Ｌ习得外功：四象掌",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[447]={
"Ｌ习得外功：佛光普照",
"Ｎ",
"Ｗ武功威力：325",
"Ｗ武功气攻：700",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[448]={
"Ｌ习得外功：金顶九式",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[449]={
"Ｌ习得外功：截手九式",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[450]={
"Ｌ习得外功：霹雳雷火弹",
"Ｎ",
"Ｗ武功威力：9",
"Ｗ武功气攻：9",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                  --小飞侠
}

ItemInfo[451]={
"Ｌ习得外功：抽髓掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[452]={
"Ｌ习得外功：连环腐尸毒",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：米字 4格",
"Ｗ◇连环腐尸毒·极意：攻击时有30%几率触发，暴怒必定触发",
"Ｗ◇连环腐尸毒·极意：攻击范围变为面攻，追加1000气攻并引爆目标身上毒素",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇毒布武林：同时修炼五毒神掌/五毒神功/冰蚕毒掌or千蛛万毒手/连环腐尸毒/五毒神功",
"Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
"Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
}

ItemInfo[453]={
"Ｌ习得外功：碧磷针",
"Ｎ",
"Ｗ武功威力：3",
"Ｗ武功气攻：3",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[454]={
"Ｌ习得外功：三笑逍遥散",
"Ｎ",
"Ｗ武功威力：11",
"Ｗ武功气攻：11",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[455]={
"Ｌ习得外功：三无三不手",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：15",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                      --小飞侠
}

ItemInfo[456]={
"Ｌ习得外功：银拂尘功",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：10",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[457]={
"Ｌ习得外功：玉蜂针",
"Ｎ",
"Ｗ武功威力：6",
"Ｗ武功气攻：6",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[458]={
"Ｌ习得外功：冰魄银针",
"Ｎ",
"Ｗ武功威力：9",
"Ｗ武功气攻：9",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[459]={
"Ｌ习得外功：生死符",
"Ｎ",
"Ｗ武功威力：9",
"Ｗ武功气攻：9",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                    --小飞侠
}

ItemInfo[460]={
"Ｌ习得外功：透骨针",
"Ｎ",
"Ｗ武功威力：9",
"Ｗ武功气攻：9",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[461]={
"Ｌ习得轻功：夜雨不沾衣",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇基础：免疫锁足、混乱、加速解除封穴，每解除1点封穴，集气条前跳25～50点。",
"Ｗ◇进阶：被攻击时机率触发闪避，闪避后机率以暗器反击，若练有细雨花，机率大幅增加",
"Ｗ◇高阶：被攻击时机率进入「如影」状态，完全隐形，敌方无法针对进入如影状态的敌人进行攻击，并对攻击者附加随形状态。",
"Ｗ如影状态下，触发以下二种情形：",
"Ｗ随形状态者先动：发动「附骨之影」，如影状态者先动并且扣除随形状态者当前生命5％",
"Ｗ如影状态者先动：执行任意行动时显露身形，若是选择出招攻击，则敌方防御力以1计算；若选择暗器，则暗器伤害翻倍。",
"Ｗ◇天轻：无视迟缓、集气紊乱、集气倒走、回魂仙梦等特效",
"Ｗ◇门派：微幅提升进入无名夜的机率；无名夜状态中获得生命奔流、内力奔流状态。",
"Ｗ◇特殊人物：进入如影状态时，获得生命奔流状态；如影状态只会在攻击、使用门派指令时解除；解除如影并攻击时的伤害将转化44％为真实伤害；所有时停效果只生效10时序。",
"Ｗ◇特殊人物：夜雨不沾身效果视为自带，敌方攻击时若三连以上必定进入如影；如影状态中进入内力奔流状态；如影只会在攻击或使用门派指令时解除，使用剑法攻击时将转化33％的伤害为真实伤害。",
"Ｗ◇特殊人物：觉醒后，微幅提升如影的触发机率，并只在使用攻击、物品以及门派指令时解除如影；解除如影并攻击时的伤害将转化11％为真实伤害",                                     --小飞侠
}

ItemInfo[462]={
"Ｌ习得外功：劈石破玉拳",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[463]={
"Ｌ习得外功：混元掌",
"Ｎ",
"Ｗ武功威力：375",
"Ｗ武功气攻：800",
"Ｗ内力消耗：280",
"Ｗ武功范围：■ 10+5×5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇混元一气：同时修炼混元掌/混元功",
"Ｗ◇混元一气：攻击时追加5~15点内伤和5~15时序集气混乱",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[464]={
"Ｌ习得外功：伏虎拳",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[465]={
"Ｌ习得外功：鹰蛇生死搏",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：15",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                      --小飞侠
}

ItemInfo[466]={
"Ｌ习得外功：泼墨披麻剑",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[467]={
"Ｌ习得外功：七玹无形剑",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：10",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[468]={
"Ｌ习得内功：九霄仙息",
"Ｎ",
"Ｄ运功效果：",
"Ｗ行动后小概率再次行动",
"Ｗ敌我行动后，降低全体敌方当前生命9%，若行动后敌人已损失最大生命值的90%，则直接被剑气降低生命至0",
"Ｗ行动后开始记录受到的伤害，下次行动前恢复记录值一半的生命、内力",
"Ｗ时序恢复19点生命、39点内力、3点体力",
"Ｗ每3时序恢复1点内伤、1点封穴",
"Ｎ",
"Ｄ被动效果：",
"Ｗ攻击时体力消耗-2",
"Ｗ攻击时额外根据自身御剑值增加伤害、气攻",
"Ｗ被攻击根据自身御剑值减少伤害、增加气防",
"Ｗ行动后恢复自身御剑值一半的生命、内力",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[469]={
"Ｌ习得外功：黑血神针功",
"Ｎ",
"Ｗ武功威力：9",
"Ｗ武功气攻：9",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[470]={
"Ｌ习得外功：葵花神针功",
"Ｎ",
"Ｗ武功威力：9",
"Ｗ武功气攻：9",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[471]={
"Ｌ习得外功：天南易阳决",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序恢复1点内伤",
"Ｗ◇攻击时根据敌人灼烧额外增加伤害",
"Ｗ◇使用指法概率为敌人附加阳气侵蚀",
"Ｗ◇无视灼烧带来的基础异常",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇使用六脉剑法时，概率无视敌人一半指法",
"Ｗ◇时序恢复10~15点内力",
"Ｗ◇攻击必灼烧",
"Ｎ",
"Ｄ组合特效：天南易阳 + 枯荣禅功",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[472]={
"Ｌ习得外功：玄武真功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇攻击时根据使用对应武学增伤，触发对应武学的效果",
"Ｗ◇被攻击时根据对方使用的武学减伤",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇集气+10",
"Ｎ",
"Ｄ组合特效：玄武真功 + 长生诀 or 神照经 + 九阴 + 先天",
"Ｎ",
}

ItemInfo[473]={
"Ｌ习得外功：碧海潮生曲",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：10",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[474]={
"Ｌ习得外功：奇门五转",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇被攻击时5%几率将一半伤害转化为自身护盾",
"Ｗ◇被攻击时5%几率将一半伤害转化为对方掉血",
"Ｗ◇被攻击时5%几率将一半伤害转化为内力回复",
"Ｗ◇被攻击时5%几率攻击转给随机敌方承受",
"Ｗ◇被攻击时5%几率转移自身位置",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇被攻击时5%几率将杀气效果转由对方承受",
"Ｗ◇被攻击时5%根据敌方杀气提高集气位置",
"Ｗ◇武功威力提高5%",
"Ｗ◇加力/护体/出招几率提高5%",
"Ｗ◇气攻/气防提高5%",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[475]={
"Ｌ习得外功：劈空掌",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[476]={
"Ｌ习得外功：碧波掌",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：300",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[477]={
"Ｌ习得外功：落英剑法",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：0 田字",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[478]={
"Ｌ习得外功：一字电剑",
"Ｎ",
"Ｗ武功威力：175",
"Ｗ武功气攻：300",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｗ◇学习周公剑法时可以一脉相承。",                                     --小飞侠
}

ItemInfo[479]={
"Ｌ习得外功：圣火令诀",
"Ｎ",
"Ｗ武功威力：900",
"Ｗ武功气攻：900",
"Ｗ内力消耗：10",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[480]={
"Ｌ习得外功：雷公轰",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：10",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[481]={
"Ｌ习得外功：袖里乾坤",
"Ｎ",
"Ｗ武功威力：4",
"Ｗ武功气攻：4",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[482]={
"Ｌ习得外功：天王补心针",
"Ｎ",
"Ｗ武功威力：6",
"Ｗ武功气攻：6",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[483]={
"Ｌ习得外功：八仙剑法",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[484]={
"Ｌ习得外功：天遁剑法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[485]={
"Ｌ习得外功：摧心掌",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：280",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｚ特别说明：",  
"Ｗ学会九阴真经后威力翻倍",                                   --小飞侠
}

ItemInfo[486]={
"Ｌ习得外功：黑沙掌",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：300",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[487]={
"Ｌ习得外功：毒龙锥",
"Ｎ",
"Ｗ武功威力：4",
"Ｗ武功气攻：4",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[488]={
"Ｌ习得外功：毒蟾砂",
"Ｎ",
"Ｗ武功威力：5",
"Ｗ武功气攻：5",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[489]={
"Ｌ习得外功：三蜈五蟆烟",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：500",
"Ｗ内力消耗：60",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[490]={
"Ｌ习得外功：金蛇锥功",
"Ｎ",
"Ｗ武功威力：7",
"Ｗ武功气攻：7",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[491]={
"Ｌ习得外功：千蛛万毒手",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：15",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇毒布武林：同时修炼五毒神掌/五毒神功/冰蚕毒掌or千蛛万毒手/连环腐尸毒/五毒神功",
"Ｗ◇毒布武林：五毒神掌/五毒神功/千蛛万毒手/连环腐尸毒/冰蚕毒掌威力提升500点",
"Ｗ◇毒布武林：行动前对全场敌人用毒，并几率叠加负面状态",
"Ｎ",
"Ｚ特别说明：",  
"Ｗ攻击强制上毒20点，根据目标中毒值回复生命",                                   --小飞侠
}

ItemInfo[492]={
"Ｌ习得外功：五行六合拳",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：105",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[493]={
"Ｌ习得外功：上清快剑",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[494]={
"Ｌ习得外功：劈卦刀法",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：10",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[495]={
"Ｌ习得外功：雁行刀",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[496]={
"Ｌ习得外功：华岳三神峰",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：10",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[497]={
"Ｌ习得外功：大九天手",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：15",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[498]={
"Ｌ习得外功：狂风迅雷扇",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：10",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[499]={
"Ｌ习得外功：大伏魔拳",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｗ攻击时几率触发“天之道”，附加目标生命最大值5~10%的伤害",
"Ｗ主运九阴真经时效果翻倍",      
"Ｎ",                             --小飞侠
}

ItemInfo[500]={
"Ｌ习得外功：阴阳磨掌",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[501]={
"Ｌ习得外功：飞凤手",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[504]={
"Ｌ习得外功：玄女剑法",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：70",
"Ｗ武功范围：《 5",
"Ｎ",
"Ｎ",
"Ｚ特别说明：",   
"Ｗ 【女性专属】伤害、气攻增加20%",
}


ItemInfo[507]={
"Ｌ习得外功：铁剑",
"Ｎ",
"Ｗ武功威力：650",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：140",
"Ｗ武功范围：《 8",
"Ｎ",
"Ｄ组合特效：无",
"Ｗ◇铁甲依然在：同时修炼铁掌or铁剑+铁布衫",
"Ｗ◇铁甲依然在：护甲提升20%，被攻击时20%几率抵挡生命最大值2%伤害",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠


}

ItemInfo[514]={
"Ｌ习得外功：大慈大悲手",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：105",
"Ｗ武功范围：3◆",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇慈悲为怀：同时修炼慈悲刀法和大慈大悲手",
"Ｗ◇慈悲为怀：道德高于60时，如果伤害大于100减伤（道德-60）点",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[515]={
"Ｌ习得外功：韦陀掌",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：300",
"Ｗ内力消耗：30",
"Ｗ武功范围：△ 2格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[516]={
"Ｌ习得外功：大阴阳手",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：30",
"Ｗ武功范围：3十字 ",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[517]={
"Ｌ习得外功：屠龙刀法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：210",
"Ｗ武功范围：5直线 ",
"Ｎ",
"Ｚ特别说明：", 
"Ｗ击杀小龙女不会触发复活",                                   --小飞侠
}

ItemInfo[518]={
"Ｌ习得外功：阿难破戒刀",
"Ｎ",
"Ｗ武功威力：750",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：350",
"Ｗ武功范围：5▼ ",
"Ｎ",
"Ｚ特别说明：",  
"Ｗ少林门人且学有少林心法时，敌方道德越低，刀法伤害越高",                                      --小飞侠
}

ItemInfo[519]={
"Ｌ习得外功：金龙鞭法",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：10",
"Ｗ武功范围：3井",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[520]={
"Ｌ习得外功：碧针清掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：20",
"Ｗ武功范围：3大米",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[522]={
"Ｌ习得外功：乾元功",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：30",
"Ｗ武功范围：3井",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[523]={
"Ｌ习得内功：通幽诀",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：500",
"Ｗ内力消耗：30",
"Ｗ武功范围：1格3*3□",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[524]={
"Ｌ习得外功：抱元诀",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：500",
"Ｗ内力消耗：30",
"Ｗ武功范围：移1米",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[525]={
   "Ｌ习得内功：剑华皈一",
   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇行动后扣除5%当前内力",
   "Ｗ◇使用剑法攻击时追加20%当前内力值伤害",    
   "Ｎ",
   "Ｄ被动效果：",
   "Ｗ◇行动后扣除5%当前内力",
   "Ｗ◇使用剑法攻击时追加10%当前内力值伤害", 
   "Ｎ",
}

ItemInfo[526]={
"Ｌ习得内功：铁布衫",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇行动后扣除5%最大内力",
"Ｗ◇护甲提升20%",
"Ｗ◇承受伤害大于100时，减伤60点",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇行动后扣除5%最大内力",
"Ｗ◇护甲提升10%",
"Ｗ◇承受伤害大于100时，减伤20点",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇铁甲依然在：同时修炼铁掌or铁剑+铁布衫",
"Ｗ◇铁甲依然在：护甲提升20%，被攻击时20%几率抵挡生命最大值2%伤害",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇十三太保横练：学会金刚不坏体、铁布衫、龙象般若功",
"Ｗ◇十三太保横练：免疫破绽，免疫杀气，受到伤害降低13点",  
"Ｎ",                            --小飞侠
}

ItemInfo[527]={
"Ｌ习得外功：释迦掷象功",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：700",
"Ｗ武功范围：5◆",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇阿婆星：学会瑜伽密乘+释迦掷象功",
"Ｗ◇阿婆星：使用释迦掷象功追加自身体质X100点伤害",     
"Ｎ",
"Ｚ特别说明：",
"Ｗ必定单击",                                                                 --小飞侠
}

ItemInfo[535]={
"Ｌ习得内功：嗜血狱魔功",
"Ｎ",
"Ｗ武功威力：1500",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：60",
"Ｗ武功范围：□ 6格",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无", 
}

ItemInfo[536]={
"Ｌ习得内功：中华傲诀",
"Ｎ",
"Ｗ武功威力：2000",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：50",
"Ｗ武功范围：□ 6格",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无", 
}

ItemInfo[537]={
"Ｌ习得内功：极阴无相功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇无视冰冻效果带来的基础异常",
"Ｗ◇阴内专属，每21时序清除一次高级异常",
"Ｗ◇阴内专属，内力高于40%时免疫昏迷",
"Ｗ◇阴内专属，暴击时概率将敌人打成白板",
"Ｗ◇阴内专属，攻击时敌人如果不是阴内，则无法回复内力",
"Ｗ◇使用阴性武功攻击时，无视敌人的强制免疫一般伤害",
"Ｗ◇使用阴性武功攻击时，随机为敌人附加陷阱状态",
"Ｗ◇周围敌人时序增加冰封，冰封大于50时降低集气扣血，敌人冰冻抗性降低",
"Ｗ◇被攻击时概率储存伤害，直到敌人下次攻击附加额外伤害，概率时序中清除",
"Ｗ◇暴击无上限，最小5倍暴击",
"Ｗ◇暴击无上限，最小5倍暴击",
"Ｗ◇免疫冰封",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击概率触发小无相杂学效果",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：无", 
}

ItemInfo[541]={
"Ｌ习得外功：霹雳狂刀",
"Ｎ",
"Ｗ武功威力：750",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：60",
"Ｗ武功范围：△ 7格",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                         --飘夜
}

ItemInfo[542]={
"Ｌ习得内功：霹雳心法",
"Ｎ",
"Ｗ武功威力：1500",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：60",
"Ｗ武功范围：□ 6格",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无", 
}

ItemInfo[543]={
"Ｌ习得轻功：霹雳身法",
"Ｎ",
"Ｄ运功效果：无",
}

ItemInfo[544]={
"Ｌ习得外功：万剑归宗",
"Ｎ",
"Ｗ武功威力：1500",
"Ｗ武功气攻：0",
"Ｗ内力消耗：900",
"Ｗ武功范围：《 12格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
}

ItemInfo[547]={
"Ｌ习得内功：洗髓神功",
"Ｎ",
"Ｗ武功威力：1600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：90",
"Ｗ武功范围：□ 6格",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无", 
}

ItemInfo[548]={"Ｌ青竹棒","Ｎ","Ｗ阿青套装◆青竹棒","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[549]={"Ｌ浅绿青衫","Ｎ","Ｗ阿青套装◆浅绿青衫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[550]={"Ｌ羊","Ｎ","Ｗ阿青套装◆羊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[551]={"Ｌ飞天玉虎爪","Ｎ","Ｗ白虎套装◆飞天玉虎爪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[552]={"Ｌ驺虞皮裘","Ｎ","Ｗ白虎套装◆驺虞皮裘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[553]={"Ｌ驺虞","Ｎ","Ｗ白虎套装◆驺虞","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[554]={"Ｌ幻蝶扇","Ｎ","Ｗ白驼套装◆幻蝶扇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[555]={"Ｌ绣金白袍","Ｎ","Ｗ白驼套装◆绣金白袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[556]={"Ｌ骆驼","Ｎ","Ｗ白驼套装◆骆驼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[557]={"Ｌ沥泉盘龙枪","Ｎ","Ｗ北侠套装◆沥泉盘龙枪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[558]={"Ｌ龙神天铠","Ｎ","Ｗ北侠套装◆龙神天铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[559]={"Ｌ黑雕","Ｎ","Ｗ北侠套装◆黑雕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[560]={"Ｌ九弦琴","Ｎ","Ｗ碧波套装◆九弦琴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[561]={"Ｌ缀玉华裳","Ｎ","Ｗ碧波套装◆缀玉华裳","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[562]={"Ｌ猫","Ｎ","Ｗ碧波套装◆猫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[563]={"Ｌ金铃索带","Ｎ","Ｗ冰霜套装◆金铃索带","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[564]={"Ｌ雪羽披风","Ｎ","Ｗ冰霜套装◆雪羽披风","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[565]={"Ｌ九尾灵狐","Ｎ","Ｗ冰霜套装◆九尾灵狐","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[566]={"Ｌ乌兹钢刃","Ｎ","Ｗ波斯套装◆乌兹钢刃","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[567]={"Ｌ鳄神皮甲","Ｎ","Ｗ波斯套装◆鳄神皮甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[568]={"Ｌ鲨鱼","Ｎ","Ｗ波斯套装◆鲨鱼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[569]={"Ｌ毒龙银鞭","Ｎ","Ｗ超风套装◆毒龙银鞭","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[570]={"Ｌ素绸朱绫","Ｎ","Ｗ超风套装◆素绸朱绫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[571]={"Ｌ蛇蟋","Ｎ","Ｗ超风套装◆蛇蟋","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[572]={"Ｌ乾坤一气袋","Ｎ","Ｗ成昆套装◆乾坤一气袋","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[573]={"Ｌ化蕴神铠","Ｎ","Ｗ成昆套装◆化蕴神铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[574]={"Ｌ漆黑星","Ｎ","Ｗ成昆套装◆漆黑星","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[575]={"Ｌ金蛇剑","Ｎ","Ｗ承志套装◆金蛇剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[576]={"Ｌ金丝背心","Ｎ","Ｗ承志套装◆金丝背心","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[577]={"Ｌ猩猩","Ｎ","Ｗ承志套装◆猩猩","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[578]={"Ｌ银钩铁划","Ｎ","Ｗ翠山套装◆银钩铁划","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[579]={"Ｌ火浣银纱","Ｎ","Ｗ翠山套装◆火浣银纱","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[580]={"Ｌ白熊","Ｎ","Ｗ翠山套装◆白熊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[581]={"Ｌ楼兰古剑","Ｎ","Ｗ翠羽套装◆楼兰古剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[582]={"Ｌ玉女云袖","Ｎ","Ｗ翠羽套装◆玉女云袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[583]={"Ｌ兀鹰","Ｎ","Ｗ翠羽套装◆兀鹰","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[584]={"Ｌ九仪天尊","Ｎ","Ｗ达摩套装◆九仪天尊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[585]={"Ｌ辟法玄胄","Ｎ","Ｗ达摩套装◆辟法玄胄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[586]={"Ｌ狻倪","Ｎ","Ｗ达摩套装◆狻倪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[587]={"Ｌ井中水月","Ｎ","Ｗ刀王套装◆井中水月","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[588]={"Ｌ黄缠明锦","Ｎ","Ｗ刀王套装◆黄缠明锦","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[589]={"Ｌ照夜白","Ｎ","Ｗ刀王套装◆照夜白","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[590]={"Ｌ血刀","Ｎ","Ｗ狄云套装◆血刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[591]={"Ｌ乌蚕宝衣","Ｎ","Ｗ狄云套装◆乌蚕宝衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[592]={"Ｌ黄牛","Ｎ","Ｗ狄云套装◆黄牛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[593]={"Ｌ簪花绣针","Ｎ","Ｗ东方套装◆簪花绣针","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[594]={"Ｌ山河绣袍","Ｎ","Ｗ东方套装◆山河绣袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[595]={"Ｌ空速星痕","Ｎ","Ｗ东方套装◆空速星痕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[596]={"Ｌ玉箫","Ｎ","Ｗ东邪套装◆玉箫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[597]={"Ｌ软?宝甲","Ｎ","Ｗ东邪套装◆ 软?宝甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[598]={"Ｌ白驼怪蛇","Ｎ","Ｗ东邪套装◆白驼怪蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[599]={"Ｌ柳叶银狐刀","Ｎ","Ｗ毒妇套装◆柳叶银狐刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[600]={"Ｌ玄罗轻袖","Ｎ","Ｗ毒妇套装◆玄罗轻袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[601]={"Ｌ金银血蛇","Ｎ","Ｗ毒妇套装◆金银血蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[602]={"Ｌ阴阳扇","Ｎ","Ｗ段誉套装◆阴阳扇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[603]={"Ｌ浅绿青衫","Ｎ","Ｗ段誉套装◆浅绿青衫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[604]={"Ｌ莽牯朱蛤","Ｎ","Ｗ段誉套装◆莽牯朱蛤","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[605]={"Ｌ鳄嘴剪","Ｎ","Ｗ鳄神套装◆鳄嘴剪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[606]={"Ｌ鳄神皮甲","Ｎ","Ｗ鳄神套装◆鳄神皮甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[607]={"Ｌ鳄鱼","Ｎ","Ｗ鳄神套装◆鳄鱼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[608]={"Ｌ闯王军刀","Ｎ","Ｗ飞狐套装◆闯王军刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[609]={"Ｌ紫云战衣","Ｎ","Ｗ飞狐套装◆紫云战衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[610]={"Ｌ九尾灵狐","Ｎ","Ｗ飞狐套装◆九尾灵狐","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[611]={"Ｌ凤屏孔雀翎","Ｎ","Ｗ凤凰套装◆凤屏孔雀翎","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[612]={"Ｌ九龙云胄","Ｎ","Ｗ凤凰套装◆九龙云胄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[613]={"Ｌ狴犴","Ｎ","Ｗ凤凰套装◆狴犴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[614]={"Ｌ金丝芙蓉镯","Ｎ","Ｗ芙华套装◆金丝芙蓉镯","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[615]={"Ｌ浮光锦裘","Ｎ","Ｗ芙华套装◆浮光锦裘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[616]={"Ｌ蛇蟋","Ｎ","Ｗ芙华套装◆蛇蟋","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[617]={"Ｌ烂银鹤爪","Ｎ","Ｗ蝠王套装◆烂银鹤爪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[618]={"Ｌ雪羽披风","Ｎ","Ｗ蝠王套装◆雪羽披风","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[619]={"Ｌ黑玫瑰","Ｎ","Ｗ蝠王套装◆黑玫瑰","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[620]={"Ｌ打狗棒","Ｎ","Ｗ丐王套装◆打狗棒","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[621]={"Ｌ百结鹑衣","Ｎ","Ｗ丐王套装◆百结鹑衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[622]={"Ｌ漆黑星","Ｎ","Ｗ丐王套装◆漆黑星","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[623]={"Ｌ金刀黑剑","Ｎ","Ｗ公孙套装◆金刀黑剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[624]={"Ｌ幽旛魂锦","Ｎ","Ｗ公孙套装◆幽旛魂锦","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[625]={"Ｌ彩雪蛛","Ｎ","Ｗ公孙套装◆彩雪蛛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[626]={"Ｌ倚天剑","Ｎ","Ｗ郭襄套装◆倚天剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[627]={"Ｌ天都雾月","Ｎ","Ｗ郭襄套装◆天都雾月","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[628]={"Ｌ金钱豹","Ｎ","Ｗ郭襄套装◆金钱豹","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[629]={"Ｌ绿波香露刀","Ｎ","Ｗ红药套装◆绿波香露刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[630]={"Ｌ九黎轻装","Ｎ","Ｗ红药套装◆九黎轻装","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[631]={"Ｌ羊","Ｎ","Ｗ红药套装◆羊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[632]={"Ｌ冷月宝刀","Ｎ","Ｗ胡斐套装◆冷月宝刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[633]={"Ｌ紫云战衣","Ｎ","Ｗ胡斐套装◆紫云战衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[634]={"Ｌ黑熊","Ｎ","Ｗ胡斐套装◆黑熊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[635]={"Ｌ金龙鞭","Ｎ","Ｗ胡商套装◆金龙鞭","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[636]={"Ｌ金丝缎袍","Ｎ","Ｗ胡商套装◆金丝缎袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[637]={"Ｌ碧云霞","Ｎ","Ｗ胡商套装◆碧云霞","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[638]={"Ｌ打狗棒","Ｎ","Ｗ黄蓉套装◆打狗棒","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[639]={"Ｌ软?宝甲","Ｎ","Ｗ黄蓉套装◆软?宝甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[640]={"Ｌ白雕","Ｎ","Ｗ黄蓉套装◆白雕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[641]={"Ｌ卜天钻","Ｎ","Ｗ黄衫套装◆卜天钻","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[642]={"Ｌ黄缠明锦","Ｎ","Ｗ黄衫套装◆黄缠明锦","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[643]={"Ｌ黄骝自在","Ｎ","Ｗ黄衫套装◆黄骝自在","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[644]={"Ｌ凝碧剑","Ｎ","Ｗ火手套装◆凝碧剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[645]={"Ｌ素绸朱绫","Ｎ","Ｗ火手套装◆素绸朱绫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[646]={"Ｌ豺狼","Ｎ","Ｗ火手套装◆豺狼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[647]={"Ｌ圣火令","Ｎ","Ｗ霍山套装◆圣火令","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[648]={"Ｌ幽旛魂锦","Ｎ","Ｗ霍山套装◆幽旛魂锦","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[649]={"Ｌ菩斯曲蛇","Ｎ","Ｗ霍山套装◆菩斯曲蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[650]={"Ｌ木剑","Ｎ","Ｗ剑魔套装◆木剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[651]={"Ｌ山河绣袍","Ｎ","Ｗ剑魔套装◆山河绣袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[652]={"Ｌ神雕","Ｎ","Ｗ剑魔套装◆神雕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[653]={"Ｌ九韶定音剑","Ｎ","Ｗ剑神套装◆九韶定音剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[654]={"Ｌ玄乌羽衣","Ｎ","Ｗ剑神套装◆玄乌羽衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[655]={"Ｌ天尊令","Ｎ","Ｗ剑神套装◆天尊令","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[656]={"Ｌ木剑","Ｎ","Ｗ剑圣套装◆木剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[657]={"Ｌ飙风猿铠","Ｎ","Ｗ剑圣套装◆飙风猿铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[658]={"Ｌ猩猩","Ｎ","Ｗ剑圣套装◆猩猩","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[659]={"Ｌ青竹棒","Ｎ","Ｗ剑仙套装◆青竹棒","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[660]={"Ｌ瑶池仙袖","Ｎ","Ｗ剑仙套装◆瑶池仙袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[661]={"Ｌ白猿","Ｎ","Ｗ剑仙套装◆白猿","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[662]={"Ｌ虎头金刀","Ｎ","Ｗ金刀套装◆虎头金刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[663]={"Ｌ肃霜宝裘","Ｎ","Ｗ金刀套装◆肃霜宝裘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[664]={"Ｌ黑雕","Ｎ","Ｗ金刀套装◆黑雕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[665]={"Ｌ龙凤子母环","Ｎ","Ｗ金环套装◆龙凤子母环","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[666]={"Ｌ金丝缎袍","Ｎ","Ｗ金环套装◆金丝缎袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[667]={"Ｌ灵獒","Ｎ","Ｗ金环套装◆灵獒","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[668]={"Ｌ五行轮","Ｎ","Ｗ金轮套装◆五行轮","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[669]={"Ｌ天蚕宝甲","Ｎ","Ｗ金轮套装◆天蚕宝甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[670]={"Ｌ彩雪蛛","Ｎ","Ｗ金轮套装◆彩雪蛛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[671]={"Ｌ金蛇剑","Ｎ","Ｗ金蛇套装◆金蛇剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[672]={"Ｌ凤凰织锦","Ｎ","Ｗ金蛇套装◆凤凰织锦","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[673]={"Ｌ金蛇","Ｎ","Ｗ金蛇套装◆金蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[674]={"Ｌ镔铁判官笔","Ｎ","Ｗ九真套装◆镔铁判官笔","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[675]={"Ｌ银狐披肩","Ｎ","Ｗ九真套装◆银狐披肩","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[676]={"Ｌ灵獒","Ｎ","Ｗ九真套装◆灵獒","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[677]={"Ｌ君子剑","Ｎ","Ｗ君子套装◆君子剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[678]={"Ｌ钧天珑袖","Ｎ","Ｗ君子套装◆钧天珑袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[679]={"Ｌ踏霜白","Ｎ","Ｗ君子套装◆踏霜白","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[680]={"Ｌ崆峒印","Ｎ","Ｗ崆峒套装◆崆峒印","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[681]={"Ｌ仙符法袍","Ｎ","Ｗ崆峒套装◆仙符法袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[682]={"Ｌ血蛙","Ｎ","Ｗ崆峒套装◆血蛙","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[683]={"Ｌ割鹿刀","Ｎ","Ｗ葵花套装◆割鹿刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[684]={"Ｌ雷绛纹帛","Ｎ","Ｗ葵花套装◆雷绛纹帛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[685]={"Ｌ血鸟","Ｎ","Ｗ葵花套装◆血鸟","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[686]={"Ｌ伏魔金杵","Ｎ","Ｗ力士套装◆伏魔金杵","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[687]={"Ｌ九黎轻装","Ｎ","Ｗ力士套装◆九黎轻装","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[688]={"Ｌ黄牛","Ｎ","Ｗ力士套装◆黄牛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[689]={"Ｌ碧水剑","Ｎ","Ｗ灵珊套装◆碧水剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[690]={"Ｌ玉女云袖","Ｎ","Ｗ灵珊套装◆玉女云袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[691]={"Ｌ照夜白","Ｎ","Ｗ灵珊套装◆照夜白","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[692]={"Ｌ银烟管","Ｎ","Ｗ灵素套装◆银烟管","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[693]={"Ｌ凝玉纱索","Ｎ","Ｗ灵素套装◆凝玉纱索","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[694]={"Ｌ莽牯朱蛤","Ｎ","Ｗ灵素套装◆莽牯朱蛤","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[695]={"Ｌ紫薇软剑","Ｎ","Ｗ令狐套装◆紫薇软剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[696]={"Ｌ钧天珑袖","Ｎ","Ｗ令狐套装◆钧天珑袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[697]={"Ｌ乌云盖雪","Ｎ","Ｗ令狐套装◆乌云盖雪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[698]={"Ｌ淑女剑","Ｎ","Ｗ龙女套装◆淑女剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[699]={"Ｌ胧影织衣","Ｎ","Ｗ龙女套装◆胧影织衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[700]={"Ｌ玉蜂","Ｎ","Ｗ龙女套装◆玉蜂","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[701]={"Ｌ北霸银鲨枪","Ｎ","Ｗ龙燕套装◆北霸银鲨枪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[702]={"Ｌ冰壁玉甲","Ｎ","Ｗ龙燕套装◆冰壁玉甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[703]={"Ｌ龙燕令","Ｎ","Ｗ龙燕套装◆龙燕令","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[704]={"Ｌ鹿角杖","Ｎ","Ｗ鹿杖套装◆鹿角杖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[705]={"Ｌ蚀魄幽铠","Ｎ","Ｗ鹿杖套装◆蚀魄幽铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[706]={"Ｌ黄犬","Ｎ","Ｗ鹿杖套装◆黄犬","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[707]={"Ｌ鸳鸯宝刀","Ｎ","Ｗ骆冰套装◆鸳鸯宝刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[708]={"Ｌ玄罗轻袖","Ｎ","Ｗ骆冰套装◆玄罗轻袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[709]={"Ｌ银霜逐电","Ｎ","Ｗ骆冰套装◆银霜逐电","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[710]={"Ｌ金龙鞭","Ｎ","Ｗ马王套装◆金龙鞭","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[711]={"Ｌ肃霜宝裘","Ｎ","Ｗ马王套装◆肃霜宝裘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[712]={"Ｌ追风黄","Ｎ","Ｗ马王套装◆追风黄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[713]={"Ｌ铁鸳鸯","Ｎ","Ｗ蒙帝套装◆铁鸳鸯","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[714]={"Ｌ黑天魔铠","Ｎ","Ｗ蒙帝套装◆黑天魔铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[715]={"Ｌ九花?","Ｎ","Ｗ蒙帝套装◆九花?","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[716]={"Ｌ辉耀金斧","Ｎ","Ｗ迷城套装◆辉耀金斧","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[717]={"Ｌ驼纹金胄","Ｎ","Ｗ迷城套装◆驼纹金胄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[718]={"Ｌ骆驼","Ｎ","Ｗ迷城套装◆骆驼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[719]={"Ｌ黑白双剑","Ｎ","Ｗ闵柔套装◆黑白双剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[720]={"Ｌ胧影织衣","Ｎ","Ｗ闵柔套装◆胧影织衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[721]={"Ｌ墨蹄玉兔","Ｎ","Ｗ闵柔套装◆墨蹄玉兔","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[722]={"Ｌ东皇钟","Ｎ","Ｗ明王套装◆东皇钟","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[723]={"Ｌ计都荒寰","Ｎ","Ｗ明王套装◆计都荒寰","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[724]={"Ｌ战象","Ｎ","Ｗ明王套装◆战象","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[725]={"Ｌ圣火令","Ｎ","Ｗ明尊套装◆圣火令","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[726]={"Ｌ幽日煌袍","Ｎ","Ｗ明尊套装◆幽日煌袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[727]={"Ｌ金银血蛇","Ｎ","Ｗ明尊套装◆金银血蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[728]={"Ｌ圆月弯刀","Ｎ","Ｗ魔刀套装◆圆月弯刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[729]={"Ｌ黄泉祭衣","Ｎ","Ｗ魔刀套装◆黄泉祭衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[730]={"Ｌ狻倪","Ｎ","Ｗ魔刀套装◆狻倪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[731]={"Ｌ苍狼天刃","Ｎ","Ｗ魔神套装◆苍狼天刃","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[732]={"Ｌ黑天魔铠","Ｎ","Ｗ魔神套装◆黑天魔铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[733]={"Ｌ飞云骓","Ｎ","Ｗ魔神套装◆飞云骓","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[734]={"Ｌ银丝拂尘","Ｎ","Ｗ莫愁套装◆银丝拂尘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[735]={"Ｌ雾幻云袍","Ｎ","Ｗ莫愁套装◆雾幻云袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[736]={"Ｌ金钱豹","Ｎ","Ｗ莫愁套装◆金钱豹","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[737]={"Ｌ玄铁棋盘","Ｎ","Ｗ木桑套装◆玄铁棋盘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[738]={"Ｌ金丝背心","Ｎ","Ｗ木桑套装◆金丝背心","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[739]={"Ｌ黄骢骠","Ｎ","Ｗ木桑套装◆黄骢骠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[740]={"Ｌ琥珀神环","Ｎ","Ｗ慕容套装◆琥珀神环","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[741]={"Ｌ紫灵天珠","Ｎ","Ｗ慕容套装◆紫灵天珠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[742]={"Ｌ御风乘黄","Ｎ","Ｗ慕容套装◆御风乘黄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[743]={"Ｌ天蛇杖","Ｎ","Ｗ女娲套装◆天蛇杖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[744]={"Ｌ圣灵披风","Ｎ","Ｗ女娲套装◆圣灵披风","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[745]={"Ｌ圣灵珠","Ｎ","Ｗ女娲套装◆圣灵珠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[746]={"Ｌ偷天剑","Ｎ","Ｗ平之套装◆偷天剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[747]={"Ｌ雷绛纹帛","Ｎ","Ｗ平之套装◆雷绛纹帛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[748]={"Ｌ小雪龙","Ｎ","Ｗ平之套装◆小雪龙","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[749]={"Ｌ玄铁令","Ｎ","Ｗ破天套装◆玄铁令","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[750]={"Ｌ乌蚕宝衣","Ｎ","Ｗ破天套装◆乌蚕宝衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[751]={"Ｌ黄犬","Ｎ","Ｗ破天套装◆黄犬","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[752]={"Ｌ冥煌刺","Ｎ","Ｗ千尺套装◆冥煌刺","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[753]={"Ｌ百结鹑衣","Ｎ","Ｗ千尺套装◆百结鹑衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[754]={"Ｌ鳄鱼","Ｎ","Ｗ千尺套装◆鳄鱼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[755]={"Ｌ北霸银鲨枪","Ｎ","Ｗ青龙套装◆北霸银鲨枪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[756]={"Ｌ紫金玄铠","Ｎ","Ｗ青龙套装◆紫金玄铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[757]={"Ｌ五彩神龙","Ｎ","Ｗ青龙套装◆五彩神龙","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[758]={"Ｌ血滴子","Ｎ","Ｗ清帝套装◆血滴子","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[759]={"Ｌ九龙云胄","Ｎ","Ｗ清帝套装◆九龙云胄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[760]={"Ｌ玉花骢","Ｎ","Ｗ清帝套装◆玉花骢","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[761]={"Ｌ白玉瑶琴","Ｎ","Ｗ若兰套装◆白玉瑶琴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[762]={"Ｌ银狐披肩","Ｎ","Ｗ若兰套装◆银狐披肩","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[763]={"Ｌ猫","Ｎ","Ｗ若兰套装◆猫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[764]={"Ｌ黑狼鬼索","Ｎ","Ｗ三渡套装◆黑狼鬼索","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[765]={"Ｌ辟法玄胄","Ｎ","Ｗ三渡套装◆辟法玄胄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[766]={"Ｌ战象","Ｎ","Ｗ三渡套装◆战象","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[767]={"Ｌ真武剑","Ｎ","Ｗ三丰套装◆真武剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[768]={"Ｌ神隐披风","Ｎ","Ｗ三丰套装◆神隐披风","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[769]={"Ｌ灵龟","Ｎ","Ｗ三丰套装◆灵龟","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[770]={"Ｌ焦尾琴","Ｎ","Ｗ三圣套装◆焦尾琴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[771]={"Ｌ银华月缎","Ｎ","Ｗ三圣套装◆银华月缎","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[772]={"Ｌ仙鹤","Ｎ","Ｗ三圣套装◆仙鹤","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[773]={"Ｌ蟠龙金棍","Ｎ","Ｗ僧人套装◆蟠龙金棍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[774]={"Ｌ锦斓袈裟","Ｎ","Ｗ僧人套装◆锦斓袈裟","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[775]={"Ｌ小雪龙","Ｎ","Ｗ僧人套装◆小雪龙","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[776]={"Ｌ满月雕弓","Ｎ","Ｗ射雕套装◆满月雕弓","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[777]={"Ｌ驼纹金胄","Ｎ","Ｗ射雕套装◆驼纹金胄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[778]={"Ｌ九花?","Ｎ","Ｗ射雕套装◆九花?","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[779]={"Ｌ玄铁剑","Ｎ","Ｗ神雕套装◆玄铁剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[780]={"Ｌ玄乌羽衣","Ｎ","Ｗ神雕套装◆玄乌羽衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[781]={"Ｌ菩斯曲蛇","Ｎ","Ｗ神雕套装◆菩斯曲蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[782]={"Ｌ龙牙击","Ｎ","Ｗ狮王套装◆龙牙击","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[783]={"Ｌ驺虞皮裘","Ｎ","Ｗ狮王套装◆驺虞皮裘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[784]={"Ｌ白熊","Ｎ","Ｗ狮王套装◆白熊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[785]={"Ｌ嵩阳铁剑","Ｎ","Ｗ嵩阳套装◆嵩阳铁剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[786]={"Ｌ紫练华衣","Ｎ","Ｗ嵩阳套装◆紫练华衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[787]={"Ｌ黑木令","Ｎ","Ｗ嵩阳套装◆黑木令","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[788]={"Ｌ玄铁匕首","Ｎ","Ｗ苏荃套装◆玄铁匕首","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[789]={"Ｌ轻绸舞袖","Ｎ","Ｗ苏荃套装◆轻绸舞袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[790]={"Ｌ五彩神龙","Ｎ","Ｗ苏荃套装◆五彩神龙","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[791]={"Ｌ昆仑镜","Ｎ","Ｗ太白套装◆昆仑镜","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[792]={"Ｌ飙风猿铠","Ｎ","Ｗ太白套装◆飙风猿铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[793]={"Ｌ白猿","Ｎ","Ｗ太白套装◆白猿","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[794]={"Ｌ峨嵋分水刺","Ｎ","Ｗ桃花套装◆峨嵋分水刺","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[795]={"Ｌ七色蝶裳","Ｎ","Ｗ桃花套装◆七色蝶裳","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[796]={"Ｌ汗血宝马","Ｎ","Ｗ桃花套装◆汗血宝马","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[797]={"Ｌ剑盾珠索","Ｎ","Ｗ天池套装◆剑盾珠索","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[798]={"Ｌ银华月缎","Ｎ","Ｗ天池套装◆银华月缎","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[799]={"Ｌ豺狼","Ｎ","Ｗ天池套装◆豺狼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[800]={"Ｌ白虹剑","Ｎ","Ｗ天鹰套装◆白虹剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[801]={"Ｌ火浣银纱","Ｎ","Ｗ天鹰套装◆火浣银纱","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[802]={"Ｌ玉面火猴","Ｎ","Ｗ天鹰套装◆玉面火猴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[803]={"Ｌ精钢指套","Ｎ","Ｗ铁丑套装◆精钢指套","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[804]={"Ｌ荧煌明光","Ｎ","Ｗ铁丑套装◆荧煌明光","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[805]={"Ｌ冰蚕","Ｎ","Ｗ铁丑套装◆冰蚕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[806]={"Ｌ金蜈钩","Ｎ","Ｗ铁手套装◆金蜈钩","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[807]={"Ｌ紫薇仙衣","Ｎ","Ｗ铁手套装◆紫薇仙衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[808]={"Ｌ金蛇","Ｎ","Ｗ铁手套装◆金蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[809]={"Ｌ冥煌刺","Ｎ","Ｗ铁掌套装◆冥煌刺","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[810]={"Ｌ紫金玄铠","Ｎ","Ｗ铁掌套装◆紫金玄铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[811]={"Ｌ追风黄","Ｎ","Ｗ铁掌套装◆追风黄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[812]={"Ｌ毒针指环","Ｎ","Ｗ顽童套装◆毒针指环","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[813]={"Ｌ仙符法袍","Ｎ","Ｗ顽童套装◆仙符法袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[814]={"Ｌ鲨鱼","Ｎ","Ｗ顽童套装◆鲨鱼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[815]={"Ｌ点钢峨嵋刺","Ｎ","Ｗ婉清套装◆点钢峨嵋刺","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[816]={"Ｌ舞风霓裳","Ｎ","Ｗ婉清套装◆舞风霓裳","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[817]={"Ｌ黑玫瑰","Ｎ","Ｗ婉清套装◆黑玫瑰","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[818]={"Ｌ金银小剑","Ｎ","Ｗ文秀套装◆金银小剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[819]={"Ｌ羊皮长袍","Ｎ","Ｗ文秀套装◆羊皮长袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[820]={"Ｌ踏霜白","Ｎ","Ｗ文秀套装◆踏霜白","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[821]={"Ｌ真武剑","Ｎ","Ｗ我行套装◆真武剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[822]={"Ｌ绣金白袍","Ｎ","Ｗ我行套装◆绣金白袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[823]={"Ｌ血鸟","Ｎ","Ｗ我行套装◆血鸟","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[824]={"Ｌ屠龙刀","Ｎ","Ｗ无忌套装◆屠龙刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[825]={"Ｌ幽日煌袍","Ｎ","Ｗ无忌套装◆幽日煌袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[826]={"Ｌ血蛙","Ｎ","Ｗ无忌套装◆血蛙","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[827]={"Ｌ九仪天尊","Ｎ","Ｗ无名套装◆九仪天尊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[828]={"Ｌ神隐披风","Ｎ","Ｗ无名套装◆神隐披风","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[829]={"Ｌ驺虞","Ｎ","Ｗ无名套装◆驺虞","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[830]={"Ｌ蝎尾鞭","Ｎ","Ｗ五毒套装◆蝎尾鞭","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[831]={"Ｌ凝玉纱索","Ｎ","Ｗ五毒套装◆凝玉纱索","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[832]={"Ｌ花斑毒蝎","Ｎ","Ｗ五毒套装◆花斑毒蝎","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[833]={"Ｌ白龙剑","Ｎ","Ｗ武当套装◆白龙剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[834]={"Ｌ玄武道装","Ｎ","Ｗ武当套装◆玄武道装","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[835]={"Ｌ青驴","Ｎ","Ｗ武当套装◆青驴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[836]={"Ｌ天蛇杖","Ｎ","Ｗ西毒套装◆天蛇杖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[837]={"Ｌ计都荒寰","Ｎ","Ｗ西毒套装◆计都荒寰","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[838]={"Ｌ白驼怪蛇","Ｎ","Ｗ西毒套装◆白驼怪蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[839]={"Ｌ玄铁剑","Ｎ","Ｗ西狂套装◆玄铁剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[840]={"Ｌ天瑞华绫","Ｎ","Ｗ西狂套装◆天瑞华绫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[841]={"Ｌ神雕","Ｎ","Ｗ西狂套装◆神雕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[842]={"Ｌ海月清辉","Ｎ","Ｗ惜花套装◆海月清辉","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[843]={"Ｌ缀玉华裳","Ｎ","Ｗ惜花套装◆缀玉华裳","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[844]={"Ｌ九霄环佩","Ｎ","Ｗ惜花套装◆九霄环佩","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[845]={"Ｌ玉剑","Ｎ","Ｗ香香套装◆玉剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[846]={"Ｌ轻绸舞袖","Ｎ","Ｗ香香套装◆轻绸舞袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[847]={"Ｌ碧云霞","Ｎ","Ｗ香香套装◆碧云霞","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[848]={"Ｌ黑玉碎星镯","Ｎ","Ｗ襄儿套装◆黑玉碎星镯","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[849]={"Ｌ浮光锦裘","Ｎ","Ｗ襄儿套装◆浮光锦裘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[850]={"Ｌ青驴","Ｎ","Ｗ襄儿套装◆青驴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[851]={"Ｌ伏羲琴","Ｎ","Ｗ逍遥套装◆伏羲琴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[852]={"Ｌ瑶池仙袖","Ｎ","Ｗ逍遥套装◆瑶池仙袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[853]={"Ｌ云狐","Ｎ","Ｗ逍遥套装◆云狐","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[854]={"Ｌ锯齿钢盾","Ｎ","Ｗ萧峰套装◆锯齿钢盾","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[855]={"Ｌ龙神天铠","Ｎ","Ｗ萧峰套装◆龙神天铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[856]={"Ｌ狴犴","Ｎ","Ｗ萧峰套装◆狴犴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[857]={"Ｌ罗剎火枪","Ｎ","Ｗ小宝套装◆罗剎火枪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[858]={"Ｌ天蚕宝甲","Ｎ","Ｗ小宝套装◆天蚕宝甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[859]={"Ｌ玉花骢","Ｎ","Ｗ小宝套装◆玉花骢","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[860]={"Ｌ柔丝索","Ｎ","Ｗ星宿套装◆柔丝索","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[861]={"Ｌ黄泉祭衣","Ｎ","Ｗ星宿套装◆黄泉祭衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[862]={"Ｌ冰蚕","Ｎ","Ｗ星宿套装◆冰蚕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[863]={"Ｌ神农鼎","Ｎ","Ｗ虚竹套装◆神农鼎","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[864]={"Ｌ冥契法衣","Ｎ","Ｗ虚竹套装◆冥契法衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[865]={"Ｌ白鹿","Ｎ","Ｗ虚竹套装◆白鹿","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[866]={"Ｌ降魔禅杖","Ｎ","Ｗ玄澄套装◆降魔禅杖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[867]={"Ｌ荧煌明光","Ｎ","Ｗ玄澄套装◆荧煌明光","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[868]={"Ｌ犀牛","Ｎ","Ｗ玄澄套装◆犀牛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[869]={"Ｌ黑白双剑","Ｎ","Ｗ玄素套装◆黑白双剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[870]={"Ｌ黑缎笼衫","Ｎ","Ｗ玄素套装◆黑缎笼衫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[871]={"Ｌ乌云盖雪","Ｎ","Ｗ玄素套装◆乌云盖雪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[872]={"Ｌ洞佩蝶恋花","Ｎ","Ｗ玄武套装◆洞佩蝶恋花","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[873]={"Ｌ玄武道装","Ｎ","Ｗ玄武套装◆玄武道装","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[874]={"Ｌ灵龟","Ｎ","Ｗ玄武套装◆灵龟","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[875]={"Ｌ血刀","Ｎ","Ｗ血刀套装◆血刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[876]={"Ｌ锦斓袈裟","Ｎ","Ｗ血刀套装◆锦斓袈裟","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[877]={"Ｌ黄骢骠","Ｎ","Ｗ血刀套装◆黄骢骠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[878]={"Ｌ镔铁杖","Ｎ","Ｗ延庆套装◆镔铁杖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[879]={"Ｌ冰月皇衣","Ｎ","Ｗ延庆套装◆冰月皇衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[880]={"Ｌ醉人蜂","Ｎ","Ｗ延庆套装◆醉人蜂","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[881]={"Ｌ君子剑","Ｎ","Ｗ杨过套装◆君子剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[882]={"Ｌ黑缎笼衫","Ｎ","Ｗ杨过套装◆黑缎笼衫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[883]={"Ｌ黄骝自在","Ｎ","Ｗ杨过套装◆黄骝自在","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[884]={"Ｌ妖刀村正","Ｎ","Ｗ妖刀套装◆妖刀村正","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[885]={"Ｌ化蕴神甲","Ｎ","Ｗ妖刀套装◆化蕴神甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[886]={"Ｌ黑木令","Ｎ","Ｗ妖刀套装◆黑木令","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[887]={"Ｌ铁浮屠","Ｎ","Ｗ一灯套装◆铁浮屠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[888]={"Ｌ冰月皇衣","Ｎ","Ｗ一灯套装◆冰月皇衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[889]={"Ｌ白雕","Ｎ","Ｗ一灯套装◆白雕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[890]={"Ｌ龙泉剑","Ｎ","Ｗ仪琳套装◆龙泉剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[891]={"Ｌ白练单衣","Ｎ","Ｗ仪琳套装◆白练单衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[892]={"Ｌ兔子","Ｎ","Ｗ仪琳套装◆兔子","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[893]={"Ｌ燕语琴","Ｎ","Ｗ盈盈套装◆燕语琴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[894]={"Ｌ七色蝶裳","Ｎ","Ｗ盈盈套装◆七色蝶裳","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[895]={"Ｌ墨蹄玉兔","Ｎ","Ｗ盈盈套装◆墨蹄玉兔","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[896]={"Ｌ海月清辉","Ｎ","Ｗ语嫣套装◆海月清辉","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[897]={"Ｌ珠璃莹甲","Ｎ","Ｗ语嫣套装◆珠璃莹甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[898]={"Ｌ醉人蜂","Ｎ","Ｗ语嫣套装◆醉人蜂","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[899]={"Ｌ逍遥神仙环","Ｎ","Ｗ玉璧套装◆逍遥神仙环","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[900]={"Ｌ珠璃莹甲","Ｎ","Ｗ玉璧套装◆珠璃莹甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[901]={"Ｌ仙鹤","Ｎ","Ｗ玉璧套装◆仙鹤","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[902]={"Ｌ铂丝掌套","Ｎ","Ｗ玉女套装◆铂丝掌套","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[903]={"Ｌ天瑞华绫","Ｎ","Ｗ玉女套装◆天瑞华绫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[904]={"Ｌ玉蜂","Ｎ","Ｗ玉女套装◆玉蜂","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[905]={"Ｌ蟒神蛇鞭","Ｎ","Ｗ圆性套装◆蟒神蛇鞭","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[906]={"Ｌ紫练华衣","Ｎ","Ｗ圆性套装◆紫练华衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[907]={"Ｌ银霜逐电","Ｎ","Ｗ圆性套装◆银霜逐电","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[908]={"Ｌ黑狼鬼索","Ｎ","Ｗ远山套装◆黑狼鬼索","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[909]={"Ｌ羊皮长袍","Ｎ","Ｗ远山套装◆羊皮长袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[910]={"Ｌ黑熊","Ｎ","Ｗ远山套装◆黑熊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[911]={"Ｌ轩辕剑","Ｎ","Ｗ芸诗套装◆轩辕剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[912]={"Ｌ圣灵披风","Ｎ","Ｗ芸诗套装◆圣灵披风","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[913]={"Ｌ云狐","Ｎ","Ｗ芸诗套装◆云狐","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[914]={"Ｌ倚天剑","Ｎ","Ｗ赵敏套装◆倚天剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[915]={"Ｌ凤凰织锦","Ｎ","Ｗ赵敏套装◆凤凰织锦","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[916]={"Ｌ飞云骓","Ｎ","Ｗ赵敏套装◆飞云骓","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[917]={"Ｌ暴雨梨花针","Ｎ","Ｗ针神套装◆暴雨梨花针","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[918]={"Ｌ冥契法衣","Ｎ","Ｗ针神套装◆冥契法衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[919]={"Ｌ兀鹰","Ｎ","Ｗ针神套装◆兀鹰","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[920]={"Ｌ毒龙银鞭","Ｎ","Ｗ芷若套装◆毒龙银鞭","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[921]={"Ｌ天都雾月","Ｎ","Ｗ芷若套装◆天都雾月","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[922]={"Ｌ兔子","Ｎ","Ｗ芷若套装◆兔子","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[923]={"Ｌ秋水雁翎刀","Ｎ","Ｗ钟灵套装◆秋水雁翎刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[924]={"Ｌ舞风霓裳","Ｎ","Ｗ钟灵套装◆舞风霓裳","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[925]={"Ｌ闪电貂","Ｎ","Ｗ钟灵套装◆闪电貂","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[926]={"Ｌ七星龙渊剑","Ｎ","Ｗ重阳套装◆七星龙渊剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[927]={"Ｌ冰壁玉甲","Ｎ","Ｗ重阳套装◆冰壁玉甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[928]={"Ｌ犀牛","Ｎ","Ｗ重阳套装◆犀牛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[929]={"Ｌ朱雀神焰扇","Ｎ","Ｗ朱雀套装◆朱雀神焰扇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[930]={"Ｌ雾幻云袍","Ｎ","Ｗ朱雀套装◆雾幻云袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[931]={"Ｌ白鹿","Ｎ","Ｗ朱雀套装◆白鹿","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[932]={"Ｌ紫金珊瑚杖","Ｎ","Ｗ紫衫套装◆紫金珊瑚杖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[933]={"Ｌ紫薇仙衣","Ｎ","Ｗ紫衫套装◆紫薇仙衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[934]={"Ｌ玉面火猴","Ｎ","Ｗ紫衫套装◆玉面火猴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[935]={"Ｌ鹤嘴笔","Ｎ","Ｗ醉鹤套装◆鹤嘴笔","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[936]={"Ｌ蚀魄幽铠","Ｎ","Ｗ醉鹤套装◆蚀魄幽铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[937]={"Ｌ花斑毒蝎","Ｎ","Ｗ醉鹤套装◆花斑毒蝎","Ｗ◆套装特效 ","Ｎ",}