ItemInfo={}
--newkdef[0小还丹]=function()
ItemInfo[0]={
"Ｌ物品说明：可恢复少量生命",
"Ｎ",
"Ｄ使用效果：命+200，内+50，体+2，毒-5",
                                    -- by 问题不断
}

--newkdef[1天香续命膏]=function()
ItemInfo[01]={
"Ｌ物品说明：可恢复较多生命",
"Ｎ",
"Ｄ使用效果：命+500，内+100，体+3，毒-8",
                                    -- by 问题不断
}

--newkdef[2黑玉断续膏]=function()
ItemInfo[02]={
"Ｌ物品说明：可恢复大量生命",
"Ｎ",
"Ｄ使用效果：命+4200，内+1800，体+17，毒-20",
                                    -- by 问题不断
}

--newkdef[3白云熊胆丸]=function()
ItemInfo[03]={
"Ｌ物品说明：可恢复少量内力",
"Ｎ",
"Ｄ使用效果：命+100，内+1000，体+1，毒-6",
                                    -- by 问题不断
}

ItemInfo[04]={
"Ｌ物品说明：可恢复一些内力",
"Ｎ",
"Ｄ使用效果：命+300，内+1500，体+3，毒-8",
                                    -- by 问题不断
}

--newkdef[5九花玉露丸]=function()
ItemInfo[05]={
"Ｌ物品说明：可恢复较多内力",
"Ｎ",
"Ｄ使用效果：命+800，内+2000，体+6，毒-30",
                                    -- by 问题不断
}

--newkdef[6九转熊蛇丸]=function()
ItemInfo[06]={
"Ｌ物品说明：可恢复大量内力",
"Ｎ",
"Ｄ使用效果：命+1720，内+4600，体+22，毒-35",
                                    -- by 问题不断
}

--newkdef[7无常丹]=function()
ItemInfo[07]={
"Ｌ物品说明：可恢复一些生命和内力",
"Ｎ",
"Ｄ使用效果：命+500，内+1200，体+9，毒-9",
                                    -- by 问题不断
}

--newkdef[8天王保命丹]=function()
ItemInfo[08]={
"Ｌ物品说明：最好的药",
"Ｎ",
"Ｄ使用效果：命+8000，内+8000，体+90，毒-100",
                                    -- by 问题不断
}

--newkdef[9黄连解毒丸]=function()
ItemInfo[09]={
"Ｌ物品说明：可少量解毒",
"Ｎ",
"Ｄ使用效果：命+200，内+500，体+5，毒-30",
                                    -- by 问题不断
}

--newkdef[10牛黄血蝎丹]=function()
ItemInfo[10]={
"Ｌ物品说明：中等解毒药",
"Ｎ",
"Ｄ使用效果：命+300，内+700，体+8，毒-60",
                                    -- by 问题不断
}

--newkdef[11六阳正气丹]=function()
ItemInfo[11]={
"Ｌ物品说明：高等解毒药",
"Ｎ",
"Ｄ使用效果：命+600，内+1000，体+15，毒-100",
                                    -- by 问题不断
}

--newkdef[12精气丸]=function()
ItemInfo[12]={
"Ｌ物品说明：可恢复一些体力",
"Ｎ",
"Ｄ使用效果：命+700，内+1200，体+50，毒-30",
                                    -- by 问题不断
}

--newkdef[13玉灵散]=function()
ItemInfo[13]={
"Ｌ物品说明：可恢复大量体力",
"Ｎ",
"Ｄ使用效果：命+2100，内+4100，体+100，毒-60",
                                    -- by 问题不断
}

--newkdef[14千年灵芝]=function()
ItemInfo[14]={
"Ｌ物品说明：可增加人物体质",
"Ｎ",
"Ｄ使用效果：人物体质增加1点",
                                    -- by 飘夜
}

--newkdef[15大蟠桃]=function()
ItemInfo[15]={
"Ｌ物品说明：可增加人物系数",
"Ｎ",
"Ｄ使用效果：可选系数+10",
                                    -- by 飘夜
}

--newkdef[16千年人参]=function()
ItemInfo[16]={
"Ｌ物品说明：可增人物属性",
"Ｎ",
"Ｄ使用效果：可选属性+10",
                                    -- by 飘夜
}

--newkdef[17天山雪莲]=function()
ItemInfo[17]={
"Ｌ物品说明：可增加人物实战",
"Ｎ",
"Ｄ使用效果：实战+10",
                                    -- by 飘夜
}

--newkdef[18叫花鸡]=function()
ItemInfo[18]={
"Ｌ物品说明：名菜",
"Ｎ",
"Ｄ使用效果：最大内力值+200",
                                    -- by 飘夜
}

--newkdef[19好逑汤]=function()
ItemInfo[19]={
"Ｌ物品说明：名菜",
"Ｎ",
"Ｄ使用效果：最大内力值+300",
                                    -- by 飘夜
}

ItemInfo[20]={
"Ｌ物品说明：名菜，",
"Ｎ",
"Ｄ使用效果：最大内力值+400",
                                    -- by 飘夜
}

--newkdef[21腊八粥]=function()
ItemInfo[21]={
"Ｌ物品说明：可增加内力最大值",
"Ｎ",
"Ｄ使用效果：最大内力值+500",
                                    -- by 飘夜
}

--newkdef[22梨花酒]=function()
ItemInfo[22]={
"Ｌ物品说明：名酒",
"Ｎ",
"Ｄ使用效果：解除冰封50点并时序恢复1点冰封，持续50时序",
                                    -- by 飘夜
}

--newkdef[23玉露酒]=function()
ItemInfo[23]={
"Ｌ物品说明：名酒",
"Ｎ",
"Ｄ使用效果：解除灼烧20点并时序恢复1点灼烧，持续50时序",
                                    -- by 飘夜
}

--newkdef[24即墨老酒]=function()
ItemInfo[24]={
"Ｌ物品说明：名酒",
"Ｎ",
"Ｄ使用效果：解除流血50点并时序恢复1点流血，持续100时序",
                                    -- by 飘夜
}

--newkdef[25五宝花蜜酒]=function()
ItemInfo[25]={
"Ｌ物品说明：名酒",
"Ｎ",
"Ｄ使用效果：免疫所有攻击基础异常",
                                    -- by 飘夜
}

--newkdef[26莽牯朱蛤]=function()
ItemInfo[26]={
"Ｌ物品说明：万毒之王，百毒不侵，炼制地灵丹的材料之一",
"Ｎ",
"Ｄ使用效果：+100抗毒",
                                    -- by 飘夜
}

--newkdef[27通犀地龙丸]=function()
ItemInfo[27]={
"Ｌ物品说明：西毒炼制，百毒不侵",
"Ｎ",
"Ｄ使用效果：+100抗毒",
                                    -- by 飘夜
}


--newkdef[28飞蝗石]=function()
ItemInfo[28]={
"Ｌ物品说明：最普通的暗器",
"Ｎ",
"Ｄ使用效果：-30生命",
                                    -- by 飘夜
}

--newkdef[29飞刀]=function()
ItemInfo[29]={
"Ｌ物品说明：飞是小李飞刀的刀",
"Ｎ",
"Ｄ使用效果：-50生命",
                                    -- by 飘夜
}

--newkdef[30金蛇锥]=function()
ItemInfo[30]={
"Ｌ物品说明：金蛇郎君成名暗器",
"Ｎ",
"Ｄ使用效果：-80生命",
                                    -- by 飘夜
}

--newkdef[31霹雳弹]=function()
ItemInfo[31]={
"Ｌ物品说明：一硫二硝三碳调制而成",
"Ｎ",
"Ｄ使用效果：-100生命",
                                    -- by 飘夜
}

--newkdef[32毒蒺藜]=function()
ItemInfo[32]={
"Ｌ物品说明：球上有刺，刺上有毒",
"Ｎ",
"Ｄ使用效果：-40生命，+40中毒",
                                    -- by 飘夜
}

ItemInfo[33]={
"Ｌ物品说明：古墓派含毒之暗器",
"Ｎ",
"Ｄ使用效果：-60生命，+60中毒",
                                    -- by 飘夜
}

--newkdef[34冰魄银针]=function()
ItemInfo[34]={
"Ｌ物品说明：古墓派含毒之暗器",
"Ｎ",
"Ｄ使用效果：-70生命，+70中毒",
                                    -- by 飘夜
}

--newkdef[35黑血神针]=function()
ItemInfo[35]={
"Ｌ物品说明：日月神教暗器，含剧毒",
"Ｎ",
"Ｄ使用效果：生命-80，中毒+80",
                                    -- by 飘夜
}

--newkdef[36玄铁剑]=function()
ItemInfo[36]={
"Ｇ装备效果；玄铁剑法威力+100",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：使用玄铁剑法时，增加50%暴击率",
"Ｗ◇LV.2：使用玄铁剑法时，增加60%暴击率",
"Ｗ◇LV.3：使用玄铁剑法时，增加70%暴击率",
"Ｗ◇LV.4：使用玄铁剑法时，增加80%暴击率",
"Ｗ◇LV.5：使用玄铁剑法时，增加90%暴击率",
"Ｗ◇LV.6（MAX）：使用玄铁剑法时，必定暴击，并可发动“破尽天下”",                                  -- by 飘夜
}

--newkdef[37倚天剑]=function()
ItemInfo[37]={
"Ｇ装备效果；倚天剑法威力+200",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：攻击时50%几率造成流血效果",
"Ｗ◇LV.2：攻击时60%几率造成流血效果",
"Ｗ◇LV.3：攻击时70%几率造成流血效果",
"Ｗ◇LV.4：攻击时80%几率造成流血效果",
"Ｗ◇LV.5：攻击时90%几率造成流血效果",
"Ｗ◇LV.6（MAX）：攻击时必定造成流血效果", 
"Ｎ",
"Ｗ◇【倚天一出·谁于争锋】",
"Ｗ◇御剑能力>=200，(御剑系数*0.1)%概率增加一次连击，",                         
}

--newkdef[38流星剑]=function()
ItemInfo[38]={
"Ｇ装备效果；连击率+10%",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：连击率+10%",
"Ｗ◇LV.2：连击率+11%",
"Ｗ◇LV.3：连击率+12%",
"Ｗ◇LV.4：连击率+13%",
"Ｗ◇LV.5：连击率+14%",
"Ｗ◇LV.6（MAX）：连击率+15%",                                  -- by 飘夜
}

--newkdef[39白龙剑]=function()
ItemInfo[39]={
"Ｇ装备效果；苗家剑法威力+100",
"Ｎ",
"Ｄ装备等级：无",                           -- by 飘夜
}

--newkdef[40金蛇剑]=function()
ItemInfo[40]={
"Ｇ装备效果；金蛇剑法威力+200",
"Ｎ",
"Ｄ装备等级：无",                                             -- by 飘夜
}

--newkdef[41凝碧剑]=function()
ItemInfo[41]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",
                                 -- by 飘夜
}

--newkdef[42白虹剑]=function()
ItemInfo[42]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",
                                 -- by 飘夜
}

--newkdef[43屠龙刀]=function()
ItemInfo[43]={
"Ｇ装备效果；使用刀法武功攻击几率触发：",
"Ｎ",
"Ｗ◇【武林至尊·宝刀屠龙】",
"Ｗ◇必定造成流血且追加气攻,追加的气攻数值等于所使用刀法的威力",
"Ｗ◇【号令天下·莫敢不从】",
"Ｗ◇必定造成暴击",
"Ｗ◇屠龙刀法威力+500",
"Ｎ",
"Ｄ装备等级：无",
                              -- by 飘夜
}

--newkdef[44血刀]=function()
ItemInfo[44]={
"Ｇ装备效果；血刀刀法威力+200",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：攻击时，恢复造成伤害5%的血量",
"Ｗ◇LV.2：攻击时，恢复造成伤害6%的血量",
"Ｗ◇LV.3：攻击时，恢复造成伤害7%的血量",
"Ｗ◇LV.4：攻击时，恢复造成伤害8%的血量",
"Ｗ◇LV.5：攻击时，恢复造成伤害9%的血量",
"Ｗ◇LV.6（MAX）：攻击时，恢复造成伤害10%的血量",                                  -- by 飘夜
}

--newkdef[45冷月宝刀]=function()
ItemInfo[45]={
"Ｇ装备效果；胡家刀法威力+200",
"Ｎ",
"Ｄ装备等级：无",
                                  -- by 飘夜
}

--newkdef[46绿波香露刀]=function()
ItemInfo[46]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",
                               -- by 飘夜
}

--newkdef[47金刀]=function()
ItemInfo[47]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",
                                -- by 飘夜
}

--newkdef[48雁翎刀]=function()
ItemInfo[48]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",
                                 -- by 飘夜
}

--newkdef[49打狗棒]=function()
ItemInfo[49]={
"Ｇ装备效果；打狗棒法威力+200",
"Ｎ",
"Ｄ装备等级：无",
                                 -- by 飘夜
}

--newkdef[50伏魔杵]=function()
ItemInfo[50]={
"Ｇ装备效果；伏魔杖法威力+100",
"Ｎ",
"Ｄ装备等级：无",
                                -- by 飘夜
}

--newkdef[51金龙鞭]=function()
ItemInfo[51]={
"Ｇ装备效果；黄沙万里鞭法威力+200",
"Ｎ",
"Ｄ装备等级：无",
                                 -- by 飘夜
}

--newkdef[52鳄嘴剪]=function()
ItemInfo[52]={
"Ｇ装备效果；大剪刀威力+200",
"Ｎ",
"Ｄ装备等级：无",
                                 -- by 飘夜
}

--newkdef[53判官笔]=function()
ItemInfo[44]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",
                                -- by 飘夜
}

--newkdef[54亮银枪]=function()
ItemInfo[54]={
"Ｇ装备效果；破甲+10%",
"Ｎ",
"Ｄ装备等级：无",
                                 -- by 飘夜
}

--newkdef[55神山剑]=function()
ItemInfo[55]={
"Ｇ装备效果；神山剑法威力+200",
"Ｎ",
"Ｄ装备等级：无",
                                -- by 飘夜
}

--newkdef[56玄铁菜刀]=function()
ItemInfo[56]={
"Ｇ装备效果；西瓜刀法威力+200",
"Ｎ",
"Ｄ装备等级：无",
                                -- by 飘夜
}

--newkdef[57犽月]=function()
ItemInfo[57]={
"Ｇ装备效果；犽月流空威力+200",
"Ｎ",
"Ｄ装备等级：无",
                                  -- by 飘夜
}

--newkdef[58软猬甲]=function()
ItemInfo[58]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：减伤20点，被拳指系武功攻击时，使攻击方流血10点",
"Ｗ◇LV.2：减伤22点，被拳指系武功攻击时，使攻击方流血10点",
"Ｗ◇LV.3：减伤24点，被拳指系武功攻击时，使攻击方流血10点",
"Ｗ◇LV.4：减伤26点，被拳指系武功攻击时，使攻击方流血10点",
"Ｗ◇LV.5：减伤28点，被拳指系武功攻击时，使攻击方流血10点",
"Ｗ◇LV.6（MAX）：减伤30点，被拳指系武功攻击时，使攻击方流血10点",                                  -- by 飘夜
}

--newkdef[59乌蚕衣]=function()
ItemInfo[59]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：被攻击时，受到的内伤减少5点",
"Ｗ◇LV.2：被攻击时，受到的内伤减少6点",
"Ｗ◇LV.3：被攻击时，受到的内伤减少7点",
"Ｗ◇LV.4：被攻击时，受到的内伤减少8点",
"Ｗ◇LV.5：被攻击时，受到的内伤减少9点",
"Ｗ◇LV.6（MAX）：被攻击时，受到的内伤减少10点",                                  -- by 飘夜
}

--newkdef[60金丝背心]=function()
ItemInfo[60]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：被攻击时，受到的封穴减少5点",
"Ｗ◇LV.2：被攻击时，受到的封穴减少6点",
"Ｗ◇LV.3：被攻击时，受到的封穴减少7点",
"Ｗ◇LV.4：被攻击时，受到的封穴减少8点",
"Ｗ◇LV.5：被攻击时，受到的封穴减少9点",
"Ｗ◇LV.6（MAX）：被攻击时，受到的封穴减少10点",                                  -- by 飘夜
}

--newkdef[61鳄皮护甲]=function()
ItemInfo[61]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：每次行动结束后解毒25点",
"Ｗ◇LV.2：每次行动结束后解毒35点",
"Ｗ◇LV.3：每次行动结束后解毒45点",
"Ｗ◇LV.4：每次行动结束后解毒55点",
"Ｗ◇LV.5：每次行动结束后解毒65点",
"Ｗ◇LV.6（MAX）：每次行动结束后解毒75点",                                  -- by 飘夜
}

--newkdef[62佛心甲]=function()
ItemInfo[62]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：被攻击时，受到的灼烧减少50%",
"Ｗ◇LV.2：被攻击时，受到的灼烧减少60%",
"Ｗ◇LV.3：被攻击时，受到的灼烧减少70%",
"Ｗ◇LV.4：被攻击时，受到的灼烧减少80%",
"Ｗ◇LV.5：被攻击时，受到的灼烧减少90%",
"Ｗ◇LV.6（MAX）：被攻击时，免疫灼烧状态"                                  -- by 飘夜
}

--newkdef[63皮衣]=function()
ItemInfo[63]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：被攻击时，受到的冰封减少50%",
"Ｗ◇LV.2：被攻击时，受到的冰封减少60%",
"Ｗ◇LV.3：被攻击时，受到的冰封减少70%",
"Ｗ◇LV.4：被攻击时，受到的冰封减少80%",
"Ｗ◇LV.5：被攻击时，受到的冰封减少90%",
"Ｗ◇LV.6（MAX）：被攻击时，免疫冰封状态"                                  -- by 飘夜
}

--newkdef[64北冥神功]=function()
ItemInfo[64]={
"Ｌ习得内功：北冥神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇攻击时，50%几率吸取敌方7%当前内力（下限300）",
"Ｗ◇被攻击时，50%几率发动“北冥神功.百川入海”吸取敌方500点内力，5点怒气并",
"Ｗ  转移到自身",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击时，30%几率吸取敌方7%当前内力（下限300）",
"Ｗ◇被攻击时，50%几率触发“北冥真气”护体，提升800点气防（可叠加）",
"Ｗ◇增加300点内力硬上限（与吸星大法同类效果不叠加）",
"Ｗ *吸取内力时，提升自身内力上限",
"Ｗ◇(15+天书数量)%机率发动“北冥.气吞山河”特效吸怒20点(限主角)",
"Ｎ",
"Ｄ组合特效：小无相功+北冥神功+八荒六合功",
"Ｗ◇逍遥派专属，灵鹫宫观看玉像解锁：",
"Ｗ◇攻击与被攻击均有机会触发特效“逍遥御风”，累积点数（单次攻击累积“逍遥御风”上限为3次）",
"Ｗ◇当累积点数达到9点时（学有凌波8点），清空封穴立刻行动（此状态不会被杀气或封穴，直到下次行动后）",
"Ｗ◇特殊人物：逍遥子-觉醒自带",
}

--newkdef[65吸星大法]=function()
ItemInfo[65]={
"Ｌ习得内功：吸星大法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇攻击时，50%几率吸取敌方7%当前内力（下限200）与少量体力",
"Ｗ◇被攻击时，50%几率发动“万物相吸.吸星大法”吸取敌方400点内力并转移到自身",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击时，30%几率吸取敌方7%当前内力（下限200）与少量体力",
"Ｗ◇增加300点内力硬上限（与北冥神功同类效果不叠加）",
"Ｗ *吸取内力时，提升自身内力上限",
"Ｎ",
"Ｄ组合效果：天魔功+吸星大法",
"Ｗ◇暴怒可以额外持续一回合",
}

--newkdef[66化功大法]=function()
ItemInfo[66]={
"Ｌ习得内功：化功大法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇攻击时，50%几率化去敌方5%当前内力（上限500，下限200），并强制上毒16~20点",
"Ｗ◇被攻击时，50%几率发动“化功大法”化去敌方300点内力，并强制上毒10~15点",

"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击时，30%几率化去敌方5%当前内力（上限500，下限200），并强制上毒16~20点",

"Ｎ",
"Ｄ组合特效：化功大法+五毒神功",
"Ｗ◇化功秘录·万毒缠身：攻击时根据敌人中毒程度抽取生命，根据自身中毒程度抽取内力，触发化功大法吸内特效时引发毒爆",
"Ｗ◇免疫毒性爆发伤害",
"Ｗ◇特殊人物：丁春秋-学会化功大法，逍遥子-无条件触发",
"Ｎ",
"Ｄ组合特效：化功大法+小无相功+摘星功",
"Ｗ◇攻击必触发中毒，冰封两种状态",
"Ｗ◇星宿邪功·摧筋化脉：时序增加中毒25点，冰封50点，根据2种负面状态总和时序扣血，持续16时序（效果为中级负面状态）",
"Ｗ◇星宿邪功·寒毒摧体：没有利刃寒锋的时候，敌减少集气位置/25的集气速度，最小为5点，当集气速度小于30时，根据冰封值扣血",
"Ｗ◇特殊人物：丁春秋自带",
}

--newkdef[67紫霞秘笈]=function()
ItemInfo[67]={
"Ｌ习得内功：紫霞神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇行动结束后回复20%已消耗的内力（覆盖被动效果）",
"Ｗ◇使用剑系武功有50%的几率触发“紫霞剑气”追加1000气攻",
"Ｗ◇剑法出招概率+20%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇行动结束后回复10%已消耗的内力",
"Ｗ◇蓄力必成功，且蓄力效果持续多回合（初始为2回合，每获得7本天书，持续回合数+1）",
"Ｗ◇触发紫霞蓄力时，无法同时触发蛤蟆，龙象等蓄力的效果",
"Ｗ◇使用剑系武功有25%的几率触发“紫霞剑气”追加1000气攻",
"Ｗ◇剑法出招+10%",
"Ｗ◇太岳三清峰攻击力上升100点，使用太岳三清峰机率触发「西岳如立」",
"Ｎ",
"Ｄ组合特效：混元功or混沌气决+紫霞神功",
"Ｗ◇免疫30%敌人攻击造成的内伤，攻击减少体力提高至4点",
"Ｗ◇强化混元功法时序回体速度，如果体力满时，额外恢复生命速度",
"Ｗ◇混元紫霞·气海翻腾：满体力概率触发，敌人集气位置大于250时，将降低至250",
"Ｗ◇混元紫霞·气行周天：被直接攻击时，当生命低于1血时，且自身体力大于50点时，消耗50点体力免疫致死伤害并恢复生命，减少内伤",
"Ｗ◇特殊人物：车神、觉醒萧半和-自带混元套效果，杨过-思过崖挑战后自带紫霞剑气效果",
"Ｎ",
"Ｄ组合特效：紫霞神功+小无相功+神行百变",
"Ｗ◇五岳剑经·运行不息：几率5连击",
"Ｗ◇五岳剑经·生克循环：除中毒效果外，其他基础负面效果各20点",
"Ｗ◇五岳剑经·五行生克：混乱1回合，几率下降10时序",
"Ｗ◇特殊人物：风清扬、剑九歌、陈长风自带",
"Ｎ",
"Ｄ组合特效：寒冰真气or易水寒+紫霞神功",
"Ｗ◇寒冰真气·如履薄冰：攻击概率降低敌人集气",
"Ｗ◇寒冰真气·冰散瓦解：攻击概率使敌人集气波动",
"Ｗ◇寒冰真气·霜冻长河：攻击概率冻结敌人",
"Ｗ◇攻击附加8点冰封，根据自身内力和敌人冰封程度增伤",
"Ｗ◇特殊人物：左冷禅-自带",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习五岳剑诀一脉相承，限定五岳派",

}

--newkdef[68混元功法]=function()
ItemInfo[68]={
"Ｌ习得内功：混元功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇每3时序回复1点体力（覆盖被动效果）",
"Ｗ◇造成的封穴效果提高20%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇行动结束后回复少许内伤",
"Ｗ◇每6时序回复1点体力",
"Ｗ◇造成的封穴效果提高10%",
"Ｎ",
"Ｄ组合特效：混元功or混沌气决+紫霞神功",
"Ｗ◇免疫30%敌人攻击造成的内伤，攻击减少体力提高至4点",
"Ｗ◇强化混元功法时序回体速度，如果体力满时，额外恢复生命速度",
"Ｗ◇混元紫霞·气海翻腾：满体力概率触发，敌人集气位置大于250时，将降低至250",
"Ｗ◇混元紫霞·气行周天：被直接攻击时，当生命低于1血时，且自身体力大于50点时，消耗50点体力免疫致死伤害并恢复生命，减少内伤",
"Ｗ◇特殊人物：车神、觉醒萧半和-自带混元套效果，杨过-思过崖挑战后自带紫霞剑气效果",
"Ｎ",
"Ｄ组合特效：混元功or混沌气决+纯阳无极功",
"Ｗ◇无视中毒、冰封、内伤造成的集气降低",
"Ｗ◇时序恢复15生命、30内力、3体力、3基础状态",
"Ｗ◇强化混元功法行动后恢复体力内伤的效果，几率直接清除大量内伤、体力",
"Ｗ◇武当派：蓄力后前三次连击不会被打断",
"Ｗ◇纯阳天内：攻击时概率恢复消耗武功内力值的生命值",
"Ｗ◇混元或混沌气决天内：攻击根据自身体力与敌人体力差，增加伤害比例",
"Ｗ◇特殊人物车神、觉醒萧半和-自带混元套效果，老张-学会纯阳，概率免疫断连击",
"Ｎ",
"Ｄ组合特效：混元功or混沌气决+蛤蟆功or鲸息功 ",
"Ｗ◇行动后回复100~150点生命值200~300点内力值和4~6点体力值，随机获得一种药品BUFF,每回合结束怒气+10",
"Ｗ◇天赋内功为蛤蟆功/鲸息功时10%概率爆怒一次",
"Ｎ",
"Ｄ组合特效：龙啸九天+混元功 ",
"Ｗ◇龙甲：生命值大于等于最大生命值40%时减伤90%",
"Ｗ◇龙吟：生命低于最大生命40%时自身每时序恢复自身状态，持续20时序",
"Ｗ◇龙息：断连击、断左右，敌人8时序昏迷不醒",
"Ｗ◇龙鸣：敌人8时序无法攻击，行动后全场降低集气200",
"Ｗ◇龙王：攻击者每时序丢失当前生命4%，持续20时序",
"Ｗ◇可复活一次",
"Ｗ◇为我方时，被攻击时可创造一个分身",
"Ｗ◇特殊人物：霍果-自带",
"Ｎ",
"Ｄ组合特效：乾坤大挪移+混元功+暗香疏影",
"Ｗ◇运筹帷幄·决胜千里：休息时自动进入防御和蓄力装填",
"Ｗ◇挪移乾坤：开局10时序处于无敌状态，间隔20时序再次触发",
"Ｗ◇特殊人物：观止、阿凡提、摩尼、齐木思自带",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习混沌气决一脉相承",
}

--newkdef[69狮吼功法]=function()
ItemInfo[69]={
"Ｌ习得内功：狮子吼",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇攻击时必定发动“狮子吼”，对全场内力低于自身1000点的敌人杀退",
"Ｗ  100点集气，且追加造成5-9点内伤",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击时50%几率发动“狮子吼”，对全场内力低于自身1000点的敌人杀退",
"Ｗ  50点集气",
"Ｎ",
"Ｄ组合特效：圣火神功+狮子吼",
"Ｗ◇时序增加2点战意",
"Ｗ◇自身战意不受外力降低",
"Ｎ",
"Ｄ组合特效：龙象般若功+狮子吼+踏雪无痕",
"Ｗ◇攻击必满流血值",
"Ｗ◇密宗功法·金刚降魔：攻击时根据敌内伤值附加真伤，集气倒退10时序",
"Ｗ◇密宗功法·万载空灵：防御降低20时序，时序增加1点灼烧，持续20时序，无法解除灼烧状态",
"Ｗ◇特殊人物：金轮，明王，霍稻自带",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习金刚禅狮子吼一脉相承",
"Ｎ",
"Ｚ特别说明：",  
"Ｗ◇河东狮吼：女性角色发动“狮子吼”效果翻倍，消耗180点内力",
}

ItemInfo[385]={
"Ｌ习得内功：金刚狮子吼",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇集气不会被杀到300以下",
"Ｗ◇减少连击40%伤害、气攻",
"Ｗ◇行动前诵念金刚咒",
"Ｗ◇七格范围内敌方伤害降低20%，受到伤害增加20%",
"Ｗ◇20%几率敌方集气倒退200",
"Ｗ◇行动前诵念菩提咒",
"Ｗ◇七格范围内我方伤害提高10%，受到伤害减少10%",
"Ｗ◇七格范围内我方获得200点护盾",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇集气不会被杀到0以下",
"Ｗ◇减少连击20%伤害、气攻",
"Ｗ◇行动后免疫破绽",
"Ｗ◇内伤上限降低成50",
"Ｎ",
"Ｄ组合特效：金刚狮子吼+鲸息功 ",
"Ｗ◇1.攻击时，内力大于2000：敌全体30点内伤，陷入精神错乱10时序",
"Ｗ◇2.攻击时，内力大于4000：敌全体封穴10点，可突破封穴上限",
"Ｗ◇3.攻击时，内力大于6000：敌全体集气倒退10时序",
"Ｗ◇4.攻击时，内力大于8000：敌全体集气静止10时序",
"Ｗ◇5.触发特效时强制全场杀气50点",
"Ｗ◇特殊人物：方证-自带，无条件2、4条，谢逊-自带，无条件1、3条",
}

--newkdef[70圣火神功]=function()
ItemInfo[70]={
"Ｌ习得内功：圣火神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇奇门招式+30%，奇门武功破防+10%",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇被攻击，降低50%本次攻击所造成的封穴（与其他同类效果乘法叠加）",
"Ｗ◇攻击时60%几率，无视对方集气条位置击中其破绽",
"Ｗ  在人物第一次行动之前是不会被击中破绽的",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇奇门招式+16%，奇门武功破防+6%",
"Ｗ◇进入战斗时的初始集气值+200~300",
"Ｗ◇攻击可造成‘观火’状态",
"Ｗ◇如行动前未移动或者移动格数未消耗完，可在行动后获得一次移动机会",
"Ｎ",
"Ｄ组合特效：圣火神功+狮子吼",
"Ｗ◇时序增加2点战意",
"Ｗ◇自身战意不受外力降低",
"Ｎ",
"Ｄ组合效果：先天功+圣火神功+凌波微步",
"Ｗ◇玉女·阴进阳退：行动前进入休息状态",
"Ｗ◇玉女真气：休息时根据自身轻功恢复生命值",
"Ｗ◇玉女化身：创造出一个人偶分担伤害",
"Ｗ◇特殊人物：林朝英、敌人版杨过小龙女自带",
"Ｎ",
"Ｄ组合特效：主运圣火神功+乾坤大挪移",
"Ｗ◇开局标记20格内任意1格的标记点，被攻击后会移动到标记点上闪避攻击，每一回合行动结束后可标记15格标记点，前提是上一次标记点已使用。（我方专属）",
"Ｗ◇熊熊烈火：休息后自身恢复中级异常",
"Ｗ◇攻击时根据敌我灼烧值增伤",
"Ｗ◇光明普遍皆清净·常乐寂灭无动诅：明教成员为敌人附加15~30层光明圣火，非明教成员附加10层",
"Ｗ◇彼受欢乐无烦恼·若言有苦无是处：敌人灼烧值大于20点被攻击后生命减300点，明教成员攻击额外减200点，并且标记敌人",
"Ｗ◇如有得住彼国者·究竟普会无忧愁：敌人灼烧值大于40点被攻击后集气紊乱10时序",
"Ｗ◇特殊人物：摩尼-必然触发",
"Ｎ",
"Ｚ奇门武功：",
"Ｗ◇使用圣火神功攻击算奇门系数"
}

--newkdef[71神照经]=function()
ItemInfo[71]={
   "Ｌ习得内功：神照功",
   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇复活时的回复百分比由（35+天书数量）提高至（70+天书数量×2）",
   "Ｎ",
   "Ｄ被动效果：",
   "Ｗ◇首次被击退时，100%发动“神照功起死回生”复活，之后有6%的几率发动",
   "Ｗ◇复活时回复（35+天书数量）%的生命/耗损内力/耗损体力以及异常状态、",
   "Ｗ◇集气值+500",
   "Ｎ",
   "Ｄ组合特效：武穆遗书+长生诀or神照经",
   "Ｗ◇野生逮虾户：提高自身集气上限为100，行动后回气200，回气上限提高至700",
   "Ｎ",
   "Ｄ组合特效：神照功+纯阳无极功+君子风",
   "Ｗ◇神照密传·万物复苏：攻击回合结束后根据自身最大生命值恢复相应生命",
   "Ｗ◇攻击后必恢复200点内力，2点体力",
   "Ｗ◇神照密传·不开光照：攻击必附加25点流血值，根据3倍流血值触发真伤",
   "Ｗ◇神照密传·山河倾泻：攻击自身增加怒气15点，气功增加1000点",
   "Ｗ◇神照密传·土崩瓦解：敌全体集气位置-150点，附加内伤15-20点，内力减少700点",
   "Ｗ◇特殊人物：狄云、江澜自带",
   "Ｎ",
   "Ｄ组合特效：主运神照经+龟息功",
   "Ｗ◇太初之道·道神同行·所谓天道：被攻击时根据自身最大内力值降低伤害，最高80%，基础负面状态各减少50点，自身生命值低于40%时自动恢复到40%",
   "Ｗ◇万物复苏·不离光照·神游太虚：被攻击时几率清除自身高级异常状态",
   "Ｗ◇万物复苏·不离光照·神游太虚：被攻击时几率触发根据自身现有内力恢复生命",
   "Ｗ◇法天自然·妙悟自在：使用休息指令后触发恢复生命、内力，降低冰封、灼烧值",
   "Ｗ◇休息时自身可触发蓄力、防御两种效果",
   "Ｗ◇自动触发休息效果",
   "Ｗ◇起有太初·神照自生：生命恢复330点，内力260点，体力4点，内伤减少8点",
   "Ｗ◇道于神行·神游太虚：蓄力后可进入防御状态",
   "Ｗ◇攻击时无视敌人25%防御",
   "Ｗ◇攻击增加15%伤害",
   "Ｗ◇神照护盾，被攻击时自身生成一个3000防御的护盾，护盾消失后计算自身防御",
   "Ｗ◇特殊人物：狄云主运神照经",
   "Ｎ",
   "Ｚ一脉相承：",
   "Ｗ◇学习长生诀一脉相承",

}

--newkdef[72十八泥偶]=function()
ItemInfo[72]={
"Ｌ习得内功：罗汉伏魔功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇行动结束后恢复10%已损失的生命值（上限200）",
"Ｗ◇每时序额外回复1点流血",
"Ｗ◇被攻击时，降低60%本次攻击所造成的内伤",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇行动结束后恢复5%已损失的生命值（上限100）",
"Ｗ◇本内功加力时发动“罗汉伏魔”，根据以下公式提升伤害与杀气[高优先级]",
"Ｗ  罗汉伏魔提升伤害和杀气效果为：[(当前内力值/30000)+(武功消耗内力/2000)]%",
"Ｗ  同时学有易筋神功+罗汉伏魔功，主运【易筋神功】攻击时必出“罗汉伏魔”",
"Ｗ◇被攻击时，降低60%本次攻击所造成的内伤",
"Ｎ",
"Ｄ组合特效：罗汉伏魔功+金刚不坏体",
"Ｗ◇第一击触发罗汉金身，大幅度减伤增伤，并且无视一般杀气",
"Ｗ◇被攻击概率触发固若金汤降低一半伤害，反之降低500伤害",
"Ｗ◇特殊人物：达摩-自带",
"Ｎ",
"Ｄ组合效果：罗汉伏魔功+大周天or小周天",
"Ｗ◇被攻击减伤400点，增加6点集气，行动后恢复",
"Ｗ◇罗汉小周天调息-攻击时触发，自身恢复200点生命、400点内力、4点体力、4点内伤、4点中毒 ",
"Ｗ◇特殊人物：达摩-自带",
"Ｎ",
"Ｄ组合特效：枯荣禅功+罗汉伏魔功+龙行虎步",
"Ｗ◇秘传·混元一气：被攻击者时序增加6点封穴值，减少1点体力，持续20时序",
"Ｗ◇秘传·双龙出海：被攻击者时序增加15点内伤值，根据现有内力值的0.6%时序降低生命，持续20时序",
"Ｗ◇秘传·气法自然：攻击后消耗自身现有内力的1%恢复自身生命值，持续15时序",
"Ｗ◇特殊人物：段思平、剑太一 自带",
"Ｎ",
"Ｄ组合特效：主运罗汉伏魔功+狮子吼or金刚狮子吼",
"Ｗ◇罗汉狂狮·不染物欲：攻击时敌人必满灼烧，根据3倍灼烧值扣除生命",
"Ｗ◇罗汉狂狮·伏魔逆气：攻击时敌人集气倒走10时序",
"Ｗ◇罗汉狂狮·阿罗汉法：罗汉伏魔的效果大幅增加，并提高自身战意",
"Ｗ◇罗汉狂狮·斗战狮吼：触发罗汉伏魔时，必定触发另一者。如果是搭配金刚狮子吼，则额外给全体我方提升战意。(要有学狮吼或金刚狮吼) ",
}

--newkdef[73蛤蟆功法]=function()
ItemInfo[73]={
"Ｌ习得内功：蛤蟆功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇蓄力必成功，并同时执行防御指令，且下回合集气+300",
"Ｗ◇强化蓄力效果，伤害加成从25%提升至50%，气攻加成从600提升至1200",
"Ｗ◇每时序增加1点怒气",
"Ｗ◇被攻击时，降低30%本次攻击所造成的内伤",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇无其他内功护体时，必定触发蛤蟆功护体气防提升900点",
"Ｗ◇受攻击时触发“蛤蟆功.蓄力”，累计蓄力值",
"Ｗ◇蓄力值满100后，下次攻击时可发动“蟾震九天”，根据蓄力值追加气攻",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习鲸息功一脉相承",

"Ｎ",
"Ｄ组合特效：混元功or混沌气决+蛤蟆功or鲸息功 ",
"Ｗ◇行动后回复100~150点生命值200~300点内力值和4~6点体力值，随机获得一种药品BUFF,每回合结束怒气+10",
"Ｗ◇天赋内功为蛤蟆功/鲸息功时10%概率爆怒一次",
"Ｎ",
"Ｄ组合特效：蛤蟆功+逆运真经+瞬息千里",
"Ｗ◇白驼奥义·幻花引梦：集气位置减少，增幅毒性爆发的减血",
"Ｗ◇白驼奥义·金花梵夜：攻击必满中毒值，2倍中毒值减少内力",
"Ｗ◇白驼奥义·金花落烬：攻击必满冰封值，根据敌方最大生命值的15%附加真实伤害",
"Ｗ◇白驼奥义·御气护体：被攻击时处于霸体状态",
"Ｗ◇特殊人物：欧阳锋自带",
"Ｎ",
"Ｄ组合特效：主运蛤蟆功+狮子吼",
"Ｗ◇攻击增伤25%，并根据自身吸收杀气额外增伤",
"Ｗ◇火蟾·火：被攻击几率触发对自身周围8格范围内的敌人反弹灼烧、焚炎不尽",
"Ｗ◇冰蟾·冰：被攻击几率触发对自身周围8格范围内的敌人反弹冰封、玄冰不化",
"Ｗ◇毒蟾·毒：被攻击几率触发对自身周围8格范围内的敌人反弹中毒、中毒不解",
"Ｗ◇气吞山河·吞：被攻击几率触发吸收攻击者的杀气，增加蓄气值",
"Ｗ◇气吞山河·御：被攻击时根据伤害消耗蓄气值减伤",
"Ｗ◇气吞山河·崩：杀气吸收超过2000时，第一次攻击时对所有敌方目标造成杀气，根据储气增加额外伤害，蓄气值不会低于100，时序蓄气，当蓄气值大于3000时引爆，使敌人集气倒退、损血，蓄气值回归300",
"Ｗ",
"Ｗ◇被攻击减少特效伤害50%",
"Ｗ◇特殊人物：欧阳锋-学会蛤蟆，欧阳克-主运蛤蟆",
}

--newkdef[74乾坤大挪移]=function()
ItemInfo[74]={
"Ｌ习得内功：乾坤大挪移",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇内力高于对方时,被攻击75%几率触发“乾坤大挪移反弹”反弹30%伤害",
"Ｗ◇被攻击，降低50%本次攻击所造成的封穴（与其他同类效果乘法叠加）",
"Ｗ◇每时序额外回复1点流血",
"Ｗ◇被攻击时，降低60%本次攻击所造成的内伤",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇内力高于对方时,被攻击(40+天书)%几率触发“乾坤大挪移反弹”反弹20%伤害",
"Ｎ",
"Ｄ组合特效：九阳神功+乾坤大挪移",
"Ｗ◇攻击增加所使用武功真实威力的伤害和气功",
"Ｗ◇至阳焚心：攻击概率附加敌人灼烧值伤害，以及“阳气侵蚀”特效",
"Ｎ",
"Ｄ组合特效：乾坤大挪移+混元功+暗香疏影",
"Ｗ◇运筹帷幄·决胜千里：休息时自动进入防御和蓄力装填",
"Ｗ◇挪移乾坤：开局10时序处于无敌状态，间隔20时序再次触发",
"Ｗ◇特殊人物：观止、阿凡提、摩尼、齐木思自带",
"Ｎ",
"Ｄ组合特效：主运乾坤大挪移+龟息功",
"Ｗ◇被攻击减少特效伤害50%，满足乾坤组合且面板上有乾坤大挪移时，被攻击时如果当前内力大于敌方，则无视免疫反击",
"Ｗ◇明尊白莲·天地无情：被攻击后，敌方全体扣除武功威力的生命值",
"Ｗ◇明尊白莲·无相天音：被攻击后自身根据敌方数量恢复生命、内力、体力，敌人越多越强",
"Ｗ◇明尊白莲·乾坤易理：被攻击后我方减少全基础异常20点，反弹敌方全体10点",
"Ｗ◇明尊白莲·乾坤逆转：被攻击命中时，当敌人伤害大于你的当前生命时，交换敌我当前血量百分比（敌人最低保留25%），全场只能触发一次",
"Ｗ◇特殊人物：摩尼-必然触发",
"Ｎ",
"Ｇ我方专属效果：",
"Ｗ◇每获得一本天书，触发反弹几率+3%（包括主动及被动）",
}

--newkdef[75小无相功]=function()
ItemInfo[75]={
"Ｌ习得内功：小无相功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇总气防提升30%",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇“无我无相”，攻击与被攻击时，兵器值判定必定不低于敌方",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇总气防提升10%",
"Ｗ◇降低修炼武功兵器值需求10点、降低兵器装备需求兵器值10点",
"Ｗ◇小无相功加力时，必定发动武功招式（降龙、六脉无效）",
"Ｎ",
"Ｄ组合特效：小无相功+北冥神功+八荒六合功",
"Ｗ◇逍遥派专属，灵鹫宫观看玉像解锁：",
"Ｗ◇攻击与被攻击均有机会触发特效“逍遥御风”，累积点数（单次攻击累积“逍遥御风”上限为3次）",
"Ｗ◇当累积点数达到9点时（学有凌波8点），清空封穴立刻行动（此状态不会被杀气或封穴，直到下次行动后）",
"Ｗ◇特殊人物：逍遥子-觉醒自带",
"Ｎ",
"Ｄ组合特效：化功大法+小无相功+摘星功",
"Ｗ◇攻击必触发中毒，冰封两种状态",
"Ｗ◇星宿邪功·摧筋化脉：时序增加中毒25点，冰封50点，根据2种负面状态总和时序扣血，持续16时序（效果为中级负面状态）",
"Ｗ◇星宿邪功·寒毒摧体：没有利刃寒锋的时候，敌减少集气位置/25的集气速度，最小为5点，当集气速度小于30时，根据冰封值扣血",
"Ｗ◇特殊人物：丁春秋自带",
"Ｎ",
"Ｄ组合特效：紫霞神功+小无相功+神行百变",
"Ｗ◇五岳剑经·运行不息：几率5连击",
"Ｗ◇五岳剑经·生克循环：除中毒效果外，其他基础负面效果各20点",
"Ｗ◇五岳剑经·五行生克：混乱1回合，几率下降10时序",
"Ｗ◇特殊人物：风清扬、剑九歌、陈长风自带",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇基础效果",
"Ｗ◇基础威力<500的武功必然触发以下效果；基础威力>=500则低几率触发，（极阴无相功不受武功威力限制、触发机率提升）",
"Ｗ◇七宝琉璃：攻击概率无视敌人50%气防，逍遥派武学威力增加200点",
"Ｗ◇任意拳法",
"Ｗ◇扶摇直上：几率增加一次连击。以拳系数增加伤害，敌方内伤大于80时附加重度内伤",
"Ｗ◇鹏飞千里：必然内伤，如果敌方内伤满则附加重度内伤，行动后增加100点回气",
"Ｗ◇任意指法",
"Ｗ◇一点红：必然连击，最高三连，必然流血并减少等同于流血值的生命",
"Ｗ◇八仙指路：必然连击，最高三连，必暴击，暴击伤害翻倍",
"Ｗ◇任意剑法",
"Ｗ◇青龙啸天：几率触发暴击，暴击时几率清除自身基础异常（冰封等）",
"Ｗ◇凤翼天翔：随自身怒气计算，无视敌方防御（满怒气则无视70%)",
"Ｗ◇任意刀法",
"Ｗ◇剥极而复：根据战意增加伤害，战意爆发时附加虚弱与脆弱",
"Ｗ◇复无极也：根据战意计算几率，攻击时无视所有条件触发左右互搏",
"Ｗ◇任意奇门",
"Ｗ◇风随白云飞：根据自身轻功值附加伤害，必定击中",
"Ｗ◇梦中云莱境：攻击打出6x6的极意，直接扣除5%~10%的血量并附加内伤",
"Ｎ",
}

--newkdef[76纯阳无极功]=function()
ItemInfo[76]={
"Ｌ习得内功：纯阳无极功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每时序回复1点中毒",
"Ｗ◇降低武功内力消耗60%",
"Ｗ◇每时序额外回复1点冰封",
"Ｗ◇【男性专属】减伤气防增加20%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇降低武功内力消耗50%",
"Ｗ◇被攻击时，降低50%本次攻击所造成的冰封",
"Ｎ",
"Ｄ组合特效：混元功or混沌气决+纯阳无极功",
"Ｗ◇无视中毒、冰封、内伤造成的集气降低",
"Ｗ◇时序恢复15生命、30内力、3体力、3基础状态",
"Ｗ◇强化混元功法行动后恢复体力内伤的效果，几率直接清除大量内伤、体力",
"Ｗ◇武当派：蓄力后前三次连击不会被打断",
"Ｗ◇纯阳天内：攻击时概率恢复消耗武功内力值的生命值",
"Ｗ◇混元或混沌气决天内：攻击根据自身体力与敌人体力差，增加伤害比例",
"Ｗ◇特殊人物车神、觉醒萧半和-自带混元套效果，老张-学会纯阳，概率免疫断连击",
"Ｎ",
"Ｄ组合特效：神照功+纯阳无极功+君子风",
"Ｗ◇神照密传·万物复苏：攻击回合结束后根据自身最大生命值恢复相应生命",
"Ｗ◇攻击后必恢复200点内力，2点体力",
"Ｗ◇神照密传·不开光照：攻击必附加25点流血值，根据3倍流血值触发真伤",
"Ｗ◇神照密传·山河倾泻：攻击自身增加怒气15点，气功增加1000点",
"Ｗ◇神照密传·土崩瓦解：敌全体集气位置-150点，附加内伤15-20点，内力减少700点",
"Ｗ◇特殊人物：狄云、江澜自带",
"Ｎ",
"Ｄ组合特效：纯阳无极功+龟息功+梯云纵横",
"Ｗ◇被攻击后反弹25%伤害",
"Ｗ◇被攻击后根据伤害25%反弹杀气",
"Ｗ◇被攻击时减少25%杀气",
"Ｗ◇被攻击后杀气转变为集气",
"Ｗ◇被攻击后敌人增加内伤30点",
"Ｗ◇被攻击后降低伤害25%",
"Ｗ◇根据自身防御力增加集气速度",
"Ｗ◇攻击结束后回集气200点",
"Ｗ◇特殊人物：张三丰、霍果自带",
"Ｎ",
"Ｄ组合特效：主运纯阳无极功+梯云纵",
"Ｗ◇纯阳无极：攻击后回气200",
"Ｗ◇攻击增伤50%",
"Ｗ◇纯阳奥义·万物无极：被攻击概率绝对气防，反杀敌人杀气，阳内被攻击减少特效伤害50%",
"Ｗ◇特殊人物：张三丰-自带，张无忌-学会纯阳，武当2级弟子-学会纯阳无极功+太极神功",
}

--newkdef[77先天功秘笈]=function()
ItemInfo[77]={
"Ｌ习得内功：先天功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇被攻击时，降低30%本次攻击所造成的内伤",
"Ｗ◇行动前发动“先天调息”，获得一次休息效果",
"Ｗ◇被杀气到-500位置的时候，回复10%生命最大值，集气位置归零",
"Ｗ◇“先天罡气”：攻击时清除目标的蓄力效果，",
"Ｗ  进入战场触发先天罡气护盾 抵消500点伤害，",
"Ｗ  护盾被击破后5个回合后概率再次生成",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇每时序回复1点生命，2点内力",
"Ｗ◇被杀气到-500位置的时候，身上所有内伤清零",
"Ｗ◇被杀气到-500位置的时候，回复5%生命最大值，集气位置归零",
"Ｗ *同时学有先天功+玉女心经，每时序额外回复1点封穴",
"Ｎ",
"Ｄ组合特效：九阴神功+先天功",
"Ｗ◇吸纳天地：攻击50%几率使敌方不会内力护体",
"Ｗ◇大道无情·运行日月：被攻击时概率无视本次攻击，转移部分伤害到敌人身上，固定恢复生命500点",
"Ｗ◇先天风雅：行动后休息一次，提升我方集气100点",
"Ｗ◇特殊人物：一灯-自带佛本是道，王重阳-自带大道无情·运行日月",
"Ｎ",
"Ｄ组合效果：太极神功+先天功+凌波微步",
"Ｗ◇行动结束后可在移动6格",
"Ｗ◇无我无相·虚无缥缈：被攻击时可触发挪移效果（被天罗，拳奇穴，夜雨楼针对）",
"Ｗ◇特殊人物：张三丰、王重阳、逍遥三老、李小妹、逍遥子自带",
"Ｎ",
"Ｄ组合效果：先天功+圣火神功+凌波微步",
"Ｗ◇玉女·阴进阳退：行动前进入休息状态",
"Ｗ◇玉女真气：休息时根据自身轻功恢复生命值",
"Ｗ◇玉女化身：创造出一个人偶分担伤害",
"Ｗ◇特殊人物：林朝英、敌人版杨过小龙女自带",
"Ｎ",
"Ｄ组合特效：主运先天功+神照or长生诀",
"Ｗ◇当自身生命百分比大于内力百分比时，攻击触发“内力互通”根据自身资质恢复内力（1000~3000）；当自身生命百分比不大于内力百分比时，攻击触发“气汇百脉”根据“先天护盾”恢复生命值，根据自身体质恢复基础状态",
"Ｗ",
"Ｗ◇进场增加7层先天真气，每次攻击敌人根据真气层数恢复自身生命，增加敌人内伤、伤害，行动后恢复1层真气，每25时序恢复1层",
"Ｗ◇攻击时根据自身气攻的10%增加伤害",
"Ｗ◇自身生命大于50%时，增伤50%，小于50%时，减伤50%",
"Ｗ◇被攻击时根据自身先天护盾减伤，减少内力恢复500点生命",
"Ｗ◇腾云驾雾：被攻击时概率根据损失生命值，恢复自身内力，清除自身内伤",
"Ｗ◇气通百会：被攻击时概率根据损失内力值，恢复自身生命，清除自身流血",
"Ｗ◇攻击时触发以下三种先天真气之一：",
"Ｗ◇    气走先天·贯通日月：攻击破防50%，攻击力提高50%，清空自身中毒",
"Ｗ◇    气足开关·八脉俱通：敌人时序损失2%最大及当前生命值，持续10时序",
"Ｗ◇    凝神气穴·心息相依：根据自身基础异常越低，恢复生命速率越快，持续10时序",
"Ｗ◇先天罡气机制：",
"Ｗ◇每次行动后机率增加先天罡气值（当自身先天罡气为零时则必然增加）",
"Ｗ◇满足先天神照/先天长生组合条件时，先天功时序回血量略微提升，并且在自身血量大于80％时，回血量会同步增加自身先天罡气",
"Ｗ◇满足先天神照/先天长生组合条件时，若同时为全真教门人，则先天罡气可以阻挡真实伤害",
"Ｗ◇特殊人物：王重阳-学会先天功，周伯通-学会先天功",
}

--newkdef[78辟邪剑谱]=function()
ItemInfo[78]={
"Ｌ习得外功：辟邪剑法",
"Ｎ",
"Ｗ武功威力：140",
"Ｗ武功气攻：随招式变化",
"Ｗ内力消耗：70",
"Ｗ武功范围：米 1+3格",
"Ｎ",
"Ｚ特别说明：辟邪剑法与葵花神针联动",
"Ｎ",
"Ｄ组合特效：葵花神功+辟邪剑法",
"Ｗ◇辟邪剑法威力提高至1200",
"Ｗ◇必触发“真辟邪剑法·葵花刺目”：被刺目的敌人，本场战斗伤害和杀气均下降15%，攻击时有40%几率落空",
"Ｗ◇攻击时必触发以下招式之一",
"Ｗ◇  无额外效果",
"Ｗ◇  飞燕穿柳：伤害+100，气攻+800",
"Ｗ◇  花开见佛：增加气攻1000，命中目标虚弱状态20时序",
"Ｗ◇  锺馗抉目：必刺目，目标100%miss一回合",
"Ｗ◇  扫荡群魔：增加气攻1200，5X5面功，为敌人附加状态“扫荡群魔”",
"Ｗ◇（有流血时，则时序损失目标1%最大生命）",
"Ｗ◇  紫气东来：连击3~4次，我方恐惧一回合",
"Ｎ",
"Ｄ组合特效：主运葵花神功+辟邪剑法",
"Ｗ◇根据攻击次数与自身集气速度增伤",
"Ｗ◇行动后附加辟邪剑气：根据御剑扩大范围、扣血内",
"Ｗ◇流星飞堕：攻击时必定触发，全场敌人扣血2.5%最大生命值，杀20点集气",
"Ｗ◇飞燕穿柳：敌人基础攻击按0计算30时序",
"Ｗ◇锺馗抉目：敌人基础防御减少50%30时序",
"Ｗ◇群邪辟易：敌人生命值大于50%，每次攻击减少10%生命，追加最大生命值的2%生命扣除",
"Ｗ◇以上3招每招都加200点攻击，攻击都多增加1次，都根据当前生命值扣除1.5%生命",
"Ｗ◇紫气东来：我方全体伤害增加30%",
"Ｗ◇江上弄笛：敌全体防御降低30%",
"Ｗ◇直捣黄龙：攻击根据上一次攻击的30%追加伤害",
"Ｗ◇扫荡群魔：攻击后恢复50点生命",
}

--newkdef[79八荒六合功]=function()
ItemInfo[79]={
"Ｌ习得内功：八荒六合功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇被攻击时，60%几率触发护体气盾，吸收33.3%所受伤害，并回复等量内力",
"Ｗ◇防御状态下，被攻击额外减伤20%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇防御时的效果加成由25%提升至40%，气防由500提升至1000",
"Ｗ◇免疫难5以上NPC根据伤害高低所追加的杀气及龙象的追加杀气",
"Ｗ◇被攻击时，20%几率触发护体气盾，吸收33.3%所受伤害，并回复等量内力",
"Ｗ *触发八荒六合功护体时，必定发动护体气盾减伤",
"Ｗ◇防御状态下，被攻击额外减伤10%",
"Ｎ",
"Ｄ组合特效：小无相功+北冥神功+八荒六合功",
"Ｗ◇逍遥派专属，灵鹫宫观看玉像解锁：",
"Ｗ◇攻击与被攻击均有机会触发特效“逍遥御风”，累积点数（单次攻击累积“逍遥御风”上限为3次）",
"Ｗ◇当累积点数达到9点时（学有凌波8点），清空封穴立刻行动（此状态不会被杀气或封穴，直到下次行动后）",
"Ｗ◇特殊人物：逍遥子-觉醒自带",
"Ｎ",
"Ｄ组合特效：主运八荒六合功+北冥神功",
"Ｗ◇气防大幅度提升、根据自身气防提升伤害",
"Ｗ◇敌人气攻越高修炼者受到的伤害越低，最高时无视全部特效伤害",
"Ｗ◇攻击时根据内力扣除敌人生命",
"Ｗ◇八荒·纯阳至尊：攻击必灼烧，为全场敌人附加10时序无明业火、阳气侵蚀",
"Ｗ◇八灭·倒转阴阳：攻击必冰封，为全场敌人附加10时序利刃寒锋、阴气污染",
"Ｗ◇八荒六合：攻击后如果自身未处于隐蔽状态，则进入隐蔽状态10时序",
"Ｗ◇当自身集气位置被敌人打倒-250的位置时可进行一次抢跑",
"Ｗ◇特殊人物：天山童姥-学会八荒",
}

--newkdef[80太玄经]=function()
ItemInfo[80]={
"Ｌ习得内功：太玄神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇攻击时，有50+（天书数X2+实战/25）%的几率发动“太玄之重”，不造成怒气",
"Ｗ◇发动“太玄之重”时，若敌方已暴怒，则有50+（天书数X2+实战/25）%的几率",
"Ｗ  发动“救赵挥金锤.邯郸先震惊”，使敌方怒气值降低20点",
"Ｗ◇被攻击时，有40%的几率发动“太玄之轻”，将被杀气值转换成提升集气值",
"Ｗ◇发动“太玄之轻”时，免疫内伤和普通中毒",
"Ｗ◇攻击时造成的怒气降低50%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击时，体力消耗减少2点",
"Ｗ◇高优先级提升战场五系系数40%",
"Ｗ◇防御时触发“防御开始.太玄蓄力”，防御的同时执行蓄力指令",
"Ｎ",
"Ｄ组合特效：主运太玄神功+乾坤大挪移+武穆遗书",
"Ｗ◇主运时增加1000血量上限",
"Ｗ◇基础效果：基础附加三维之和加五系最大值的增伤（敌人增伤减半）",
"Ｗ◇攻击时必定触发以下效果：",
"Ｗ◇太玄·万般皆通：根据使用武功的不同给敌方附加不同的陷阱状态",
"Ｗ用拳触发残劲袭魄；用剑触发败血破命；用指触发火毒攻心；用刀触发寒毒侵脉；用特触发五蕴炽盛",
"Ｗ◇攻击时机率触发以下效果：",
"Ｗ◇【十步杀一人，千里不留行】根据当前内力增加伤害，并在3回合内增加集气速度、行动后回气100点",
"Ｗ◇【赵客缦胡缨，吴钩霜雪明】附加额外杀气，并在50时序内降低目标防御50%",
"Ｗ◇【救赵挥金锤，邯郸先震惊】减少敌人20点怒气，若敌人是爆怒状态则减少50点并附加内伤",
"Ｗ◇【三杯吐然诺，五岳倒为轻】以自身实战增加伤害，并随机附加回魂仙梦或冻结效果给敌人",
"Ｗ◇【谁能书阁下，白首太玄经】同时出以上四个特效效果",
"Ｗ◇被攻击机率触发以下效果：",
"Ｗ◇【将炙啖朱亥，持觞劝侯嬴】减少伤害、杀气并回复200血量",
"Ｗ◇【闲过信陵饮，脱剑膝前横】机率减少所有敌方100~200点集气",
"Ｗ◇【眼花耳热后，意气素霓生】机率进入10时序闪避和增加内力500点",
"Ｗ◇【千秋二壮士，烜赫大梁城】以自身所有异常数值总和减伤，减伤后机率清空基础异常",
"Ｗ◇【纵死侠骨香，不惭世上英】同时触发以上四个效果",
"Ｗ◇行动前机率触发：【银鞍照白马，飒沓如流星】使自己该回合移动范围＋3 ",
"Ｗ◇行动后机率触发：【事了拂衣去，深藏身与名】使自己在30时序内，大幅度降低伤害",
"Ｗ◇行动后机率触发：【太玄·浮摇谪仙】机率触发清除中级异常特效",
"Ｚ特别说明：",
"Ｗ◇主角打通侠客行正线（长乐帮分支选择不去）资质50及以下三维下限为1500，资质50以上可以突破2500三维上限，主运太玄即视为满足太玄组合条件，太玄组合触发时资质50以上攻击减少敌人60%防御，资质50以下60%概率无视敌人高级减伤",
"Ｗ",
"Ｗ◇主角打通侠客行邪线（长乐帮分支选择去）取得天书并领悟混沌太玄，此天赋不占天赋格子，主角资质30以下面板上有太玄自运太玄",
"Ｗ◇特殊人物：李白-自带，石破天-觉醒后自带，阿青-主运太玄",
}

--newkdef[81龙象般若功]=function()
ItemInfo[81]={
"Ｌ习得内功：龙象般若功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇高优先级提升10%伤害、降低10%所承受伤害",
"Ｗ◇人物每次行动前自动进行蓄力",
"Ｗ◇“龙象之力”的追加气攻随自身怒气值提高而提高；暴怒时，无视敌方绝对气防",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇“龙之蓄力·象之防御”，蓄力必成功，并同时执行防御指令",
"Ｗ◇使50%攻击伤害转化为额外杀气（需破对方气防才能生效）",
"Ｗ◇攻击时有60%几率发动“龙象之力”，追加1000气攻",
"Ｎ",
"Ｄ组合特效：金刚不坏体+铁布衫+龙象般若功",
"Ｗ◇十三太保横练：免疫破绽，免疫杀气，受到伤害降低13%",
"Ｗ◇十三太保横练：当自身生命大于50％，受到足以致死的【武功伤害】时，消耗自身当前生命的60％，免疫此次攻击伤害并获得霸体状态",
"Ｗ◇（此效果对于「因特效产生的真实伤害致死」无效）",  
"Ｗ◇鳌拜-自带，天赋十三太保-自带",
"Ｎ",
"Ｄ组合特效：龙象般若功+狮子吼+踏雪无痕",
"Ｗ◇攻击必满流血值",
"Ｗ◇密宗功法·金刚降魔：攻击时根据敌内伤值附加真伤，集气倒退10时序",
"Ｗ◇密宗功法·万载空灵：防御降低20时序，时序增加1点灼烧，持续20时序，无法解除灼烧状态",
"Ｗ◇特殊人物：金轮，明王，霍稻自带",
"Ｎ",
"Ｄ组合特效：主运龙象般若功+神足经",
"Ｗ◇攻击时40%机率对全场敌人附加「龙象之怒」，可叠加",
"Ｗ◇龙象之怒：将龙象力分为「一～十三」，攻击时根据自身攻击及龙象力的层数来增加气攻与伤害，学会十龙十象天赋后，会把增加伤害的10%转化为真伤",
"Ｗ◇血龙之怒：攻击时40%机率对敌方附加龙象气劲。身负龙象气劲的敌人在攻击时，气劲一分为二，分为明、暗劲:",
"Ｗ◇明劲·爆：敌方攻击时，根据敌方身上的「血龙之怒」引爆敌人龙象气劲，扣除全场敌人血量",
"Ｗ◇暗劲·再爆：在敌人有任何回血特效时累积，并于敌方攻击时根据回血累积量扣除全场敌人血量",
"Ｗ◇龙王之怒·破灭：第一击触发，攻击拥有龙象气劲的敌人，催发身上的气劲，造成微量生命、内力流失",
"Ｗ◇休息时触发“龙象之力·调息”，根据受损生命恢复自身生命、内力，10点中毒、内伤",
"Ｗ◇血龙炎劲：被阳内武功攻击减伤80%，被调和武功攻击减伤40%",
"Ｗ◇特殊人物：金轮法王、霍果-必然触发，霍都-觉醒后自运龙象，学会龙象，鸠小智-学会龙象",
"Ｗ◇天赋-十龙十象：触发的龙象力将不小于「十一」",
"Ｗ◇天赋-龙象尊者：主运龙象般若功即可享有组合，行动后回气350点",
}

--newkdef[82逆运真经]=function()
ItemInfo[82]={
"Ｌ习得内功：逆运经脉",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇被攻击时，降低30%本次攻击所造成的内伤",
"Ｗ◇暴击率提高50%",
"Ｗ◇暴击的攻击效果增加20%",
"Ｗ◇每时序回复1点中毒",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇每6时序回复1点体力",
"Ｗ◇减少暴击伤害30%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇免疫封穴10点",
"Ｗ◇集气概率向前跳跃50时序，学会九阴后跳跃100时序",
"Ｗ◇暴击率提高30%",
"Ｗ◇暴击伤害增加10%",
"Ｎ",
"Ｄ组合特效：九阴神功+逆运真经",
"Ｗ◇概率集气位置增加10~30，暴怒2倍效果",
"Ｗ◇攻击时暴击伤害提高40%，被攻击时暴击伤害减少40%",
"Ｎ",
"Ｄ组合特效：蛤蟆功+逆运真经+瞬息千里",
"Ｗ◇白驼奥义·幻花引梦：集气位置减少，增幅毒性爆发的减血",
"Ｗ◇白驼奥义·金花梵夜：攻击必满中毒值，2倍中毒值减少内力",
"Ｗ◇白驼奥义·金花落烬：攻击必满冰封值，根据敌方最大生命值的15%附加真实伤害",
"Ｗ◇白驼奥义·御气护体：被攻击时处于霸体状态",
"Ｗ◇特殊人物：欧阳锋自带",
"Ｎ",
"Ｄ组合特效：主运逆运真经+瞬息千里",
"Ｗ◇自身集气在1.6~3倍之间跳跃，攻击增加50%",
"Ｗ◇被攻击几率免疫杀气，被强制无视",
"Ｗ◇[逆运走火]变「逆运暴走」状态，必二连，增加暴击、加力护体机率",
"Ｗ◇特殊人物：逆运欧阳锋-觉醒后，主运逆运不用学全组合",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇学有逆运真经，进入战场后会进入「逆运走火状态」，此状态下攻击有机率",
"Ｗ◇二连、大幅增加暴击机率，自身集气速度会在0.8~1.5倍之间跳跃。",
}

--wkdef[83九阳真经]=function()
ItemInfo[83]={
"Ｌ习得内功：九阳神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇【阳内专属】高优先级降低45%所承受伤害（不与被动叠加）",
"Ｗ◇【阳内专属】内力消耗降低70%",
"Ｗ◇【阳内专属】每7时序自动解除自身封穴",
"Ｗ◇【阳内专属】每时序回复6点内力值",
"Ｗ◇每时序额外回复1点冰封",
"Ｗ◇每时序回复1点中毒",
"Ｗ◇每3时序回复1点内伤（内伤大于50时，效果加倍）",
"Ｗ◇【氤氲紫气】伤害大于99时，如果伤害大于199减伤99点，否则减伤66点",
"Ｗ◇【阳内专属】行动前发动“九阳.抱元守一” 清除自身所有不良状态",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇【阳内专属】高优先级降低20%所承受伤害",
"Ｗ◇【阳内专属】灼烧系武功必出灼烧",
"Ｗ◇【阳内专属】被攻击有（20+天书数×3）%几率，发动“九阳真气”提升",
"Ｗ   650点气防（可叠加）",
"Ｎ",
"Ｄ组合特效：九阳神功+九阴神功",
"Ｗ◇森罗万象：敌人暴击时伤害不增加反而减少；被攻击获得1200气防，被暴怒敌人攻击获得绝对气防",
"Ｎ",
"Ｄ组合特效：九阳神功+乾坤大挪移",
"Ｗ◇攻击增加所使用武功真实威力的伤害和气功",
"Ｗ◇至阳焚心：攻击概率附加敌人灼烧值伤害，以及“阳气侵蚀”特效",
"Ｎ",
"Ｄ组合特效：主运九阳神功+两个阳内内功",
"Ｗ◇初始自带：减伤50%，九层九阳护盾，被攻击时一层护盾抵消一次伤害，25时序恢复一层护盾。（此项必须主运）根据护盾层数减少真实伤害，层数越多减伤越多，免疫阳气侵蚀",
"Ｗ◇生生不息：攻击或者被攻击时如果自身内力低于30%则恢复，额外恢复9点体力",
"Ｗ◇抱元守一：被攻击后和休息后，都会触发并恢复生命、内力、体力、内伤、中毒",
"Ｗ◇氤氲紫气：被攻击后根据伤害恢复生命、内力、气防值",
"Ｗ◇诸法不侵：被攻击后强制反弹封穴，自己封穴值清0",
"Ｗ◇九阳神功反震：根据自身内力值来反弹伤害并且自身集气速度上升",
"Ｗ◇他强由他强·清风拂山岗：被攻击时绝对气防，减伤1999点",
"Ｗ◇他横任他横·明月照大江：被攻击时根据敌方1/2的攻击力反弹给对方",
"Ｗ◇他自狠来他自恶·我自一口真气足：被攻击消耗内力999，强制减伤至99点",
"Ｗ◇被攻击后杀气转变为集气，攻击必灼烧，阳内武功增伤30%，时序恢复生命、内力，如果自身处于受伤状态恢复加倍",
"Ｗ◇被攻击时必定触发「他横任他横·明月照大江」或「九阳神功反震」其一",
"Ｗ◇战意爆发时，攻击随机触发九阳招式：敌人虚弱10时序/敌人散功10时序/自身时序恢复生命、内力10时序",
"Ｗ◇特殊人物：斗酒僧-必然触发，黄裳、张无忌-自带",
"Ｗ◇天赋仁阳佛光-主运九阳即可享有组合",
}

--newkdef[84九阴真经]=function()
ItemInfo[84]={
"Ｌ习得内功：九阴神功",
"Ｄ运功效果：",
"Ｗ◇【阴内专属】提升20%伤害",
"Ｗ◇【阴内专属】连击率提高50%",
"Ｗ◇【阴内专属】每时序额外回复5点生命值",
"Ｗ◇【阴内专属】第一击必定触发,连击30%概率触发“九阴破体”无视目标65%防御",
"Ｗ◇每时序额外回复1点灼烧",
"Ｗ◇每6时序回复1点体力",
"Ｗ◇每3时序回复1点内伤（内伤大于50时，效果加倍）",
"Ｄ被动效果：",
"Ｗ◇【阴内专属】高优先级降低10%所承受伤害",
"Ｗ◇【阴内专属】冰封系武功必出冰封",
"Ｗ◇【阴内专属】被攻击有（20+天书数×3）%几率，发动“九阴真气”提升",
"Ｗ   650点气防（可叠加）",
"Ｗ◇【阴内专属】攻击时概率触发“飞絮劲”攻击必中，并附加100点伤害，暴怒必触发",
"Ｎ",
"Ｄ组合特效：九阳神功+九阴神功",
"Ｗ◇森罗万象：敌人暴击时伤害不增加反而减少；被攻击获得1200气防，被暴怒敌人攻击获得绝对气防",
"Ｎ",
"Ｄ组合特效：九阴神功+逆运真经",
"Ｗ◇概率集气位置增加10~30，暴怒2倍效果",
"Ｗ◇攻击时暴击伤害提高40%，被攻击时暴击伤害减少40%",
"Ｎ",
"Ｄ组合特效：九阴神功+先天功",
"Ｗ◇吸纳天地：攻击50%几率使敌方不会内力护体",
"Ｗ◇大道无情·运行日月：被攻击时概率无视本次攻击，转移部分伤害到敌人身上，固定恢复生命500点",
"Ｗ◇先天风雅：行动后休息一次，提升我方集气100点",
"Ｗ◇特殊人物：一灯-自带佛本是道，王重阳-自带大道无情·运行日月",
"Ｎ",
"Ｄ组合特效：主运九阴+两个阴内内功",
"Ｗ◇初始自带：9层九阴破体真气，每层真气削减敌人最大生命5%，随攻击减少，25时序恢复一道，根据轻功额外增加集气，免疫阴气污染",
"Ｗ◇攻击敌人时概率必中，根据自身最大内力值增伤，转化一部分伤害为真实伤害",
"Ｗ◇九阴飞絮劲：攻击时几率触发13道飞絮劲：根据飞絮劲层数增加伤害",
"Ｗ◇（1-4道：气攻增加2000点，削减敌人500点内力、5点体力；5-8道：封穴敌人3~5点，攻击后自身加怒气15点；9-12道：攻击后敌人昏迷状态，削减500点生命；13道：必破气防，最追加敌人10%最大生命值伤害）",
"Ｗ",
"Ｗ◇螺旋九影：蓄力后必成功、蓄力次数叠加层数，随着层数增加伤害、内伤，蓄力时增加集气，根据轻功值和蓄力层数提高集气位置",
"Ｗ◇九阴摄魂：被击中的敌人攻击范围必偏移，触发几率30%（黄裳40%）",
"Ｗ◇九阴真劲·无坚不摧：自身所有攻击增加40%，无视敌人防御50%",
"Ｗ◇九阴真气：阴内武功增伤40% ",
"Ｗ◇九阴奥义·蛇形狸翻：被攻击后，免疫杀气、断连、断左右，自身恢复300点生命",
"Ｗ◇天之道·损有余而补不足：休息后根据自身缺失内力值恢复命、内力、体力、内伤、中毒，概率清除自身中级异常",
"Ｗ◇如果自身有内伤会根据内伤的5倍效果恢复生命，额外清除5点流血",
"Ｗ◇天赋万寿道藏-主运九阴可以享受九阴组合效果，进场拥有9道真气（无需判定成功）",
"Ｗ◇特殊人物：黄裳-必然触发",
"Ｎ",
}

--newkdef[85易筋经]=function()
ItemInfo[85]={
"Ｌ习得内功：易筋神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇被攻击时，40%几率触发“易筋真谛”绝对气防",
"Ｗ◇每3时序回复1点内伤（内伤大于50时，效果加倍）",
"Ｗ◇每时序回复1点中毒",
"Ｗ◇同时学有易筋神功+罗汉伏魔功，攻击时必出“罗汉伏魔”特效",
"Ｗ *此状态触发的“罗汉伏魔”，且有1.1倍效果",
"Ｗ◇同时学有易筋神功+金刚不坏体，被攻击必出“金刚不坏”特效",
"Ｗ◇少林武功威力+200",
"Ｗ◇每时序回复6点内力值",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇战场三围增加30%",
"Ｗ◇每时序额外回复1点封穴",
"Ｗ◇使用罗汉掌，60%几率触发“般若掌”伤害+50",
"Ｗ◇使用大力金刚掌，40%几率触发“达摩掌”伤害+100",
"Ｗ◇被攻击有（20+天书数×3）%几率，发动“易筋真气”提升650点气防（可叠加）",
"Ｎ",
"Ｄ组合特效：主运易筋经+两个佛门内功",
"Ｗ金刚狮子吼、罗汉伏魔功、金刚不坏体、少林九阳功、少林心法、九阳神功、临济十二桩、峨嵋九阳功",
"Ｗ◇基础自带：攻击时追加自身气功值的伤害，减伤500~1500点，概率附加自身气防值的减伤",
"Ｗ◇易筋真谛：根据道德（道德/2）独立计算加力护体机率（优先于普通的加力护体计算）。在加力护体时清空自身异常，战意高于100时回内回体回血",
"Ｗ◇易筋神罡：被北冥吸内力时扣除攻击者内力、被吸星攻击时扣除攻击者血量、被化功攻击时扣除攻击者体力；其他扣除内力的特效皆吸收一半的扣除量，下一次行动前回复血量",
"Ｗ◇易筋神髓·释迦禅意：攻击时机率无视绝对气防，并对自己叠加「神兵」状态。满怒气时必触发，并同时强杀全场杀气",
"Ｗ◇易筋神髓·锭光真谛：攻击时，杀气翻倍，根据杀气量增加伤害，若是易筋经加力再额外增加伤害。并附加迟缓、脆弱",
"Ｗ◇易筋神髓·彌勒寶讖：免疫封穴；每回合行动后机率获得「集气上升」效果",
"Ｗ◇易筋神髓·過去彌陀：被攻击时根据气防减伤，并反弹「业力引爆」特效",
"Ｗ◇易筋神髓·現世如來：被攻击时机率免疫杀气，并根据杀气量，机率对攻击者反弹伤害及「集气紊乱」特效",
"Ｗ◇易筋神髓·未來無生：全场敌人每30时序被附加一次「业障缠身」",
"Ｗ◇天佛化生·应法反劫：被攻击几率根据敌人杀气的2倍削减敌人生命",
"Ｗ◇当被武功攻击致死时，扣减等同于内力最大值的20％内力，维持不死，并机率断连击。若剩馀内力不足最大内力值的20％，扣除所有内力，对所有己方队友回复大量生命、内力、体力，并清除部分异常状态后死亡",
"Ｗ",
"Ｗ◇当自身调和内并内力大于40％时，免疫昏迷",
"Ｗ◇我方专属-战斗中可以复活一次",
"Ｗ◇特殊人物：达摩-必然触发，扫地-主运易筋即享有「释迦、锭光、弥勒」三特效，不用学其他内功，方证-击败铜人巷后觉醒，自运易筋经",
"Ｗ◇天赋黑级浮屠-主运易筋即可享有组合",
}

--newkdef[86降龙十八掌]=function()
ItemInfo[86]={
"Ｌ习得外功：降龙十八掌",
"Ｎ",
"Ｗ武功威力：750",
"Ｗ武功气攻：1500",
"Ｗ内力消耗：490",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｗ◇真实攻击：敌方最大生命值的7.5%+敌方现有内力的5.3%",
"Ｄ招式特效：（实际拳掌系数/14，最大25%；拳主和乔峰/10，最大30%）",
"Ｗ◇双龙取水：攻击两次",
"Ｗ◇亢龙有悔：无视目标防御30%，拳系大于200后几率使敌人处于昏迷状态，暴怒必出",
"Ｗ◇潜龙勿用：行动后自动防御",
"Ｗ◇飞龙在天：下回合集气速度增加50%",
"Ｗ◇见龙在田：必中，造成的伤害增加200",
"Ｗ◇时乘六龙：连击加1",
"Ｗ◇天赋-侠之大者：必出降龙招式",
"Ｎ",
"Ｄ组合特效：降龙十八掌+打狗棒法",
"Ｗ◇丐世无双：被攻击50%绝对气防，免疫本次攻击内伤",
"Ｗ◇丐世无双：使用降龙或者打狗攻击后，触发另一个武功的追击效果，最多追加1次（一次降龙一次打狗，可以触发连击特效）",
"Ｎ",
"Ｄ组合特效：九阴真经+降龙十八掌",
"Ｗ◇攻击改为可移动的菱形范围，可误伤",
"Ｗ◇秘技·有余不尽：攻击附加10点内伤，以敌人受内伤的3%成倍增加自身伤害，恢复自身最大内力值的30%",
"Ｗ◇秘技·长江三叠浪：攻击时触发三连击，连击附加200点真实伤害，附加刚柔混劲，持续10时序",
"Ｎ",
"Ｄ组合特效：九阴真经+降龙十八掌",
"Ｗ◇降龙到极攻击范围增加为15格（乔峰使用降龙享受）",
"Ｗ◇降龙虚劲：攻击为敌人附加内伤，根据敌人内伤程度增加伤害，为敌人附加“降龙虚劲”，敌人出手后受到伤害，并附加集气紊乱",
"Ｗ◇羽蛇化龙：使用降龙攻击命中敌人，获得一次休息状态",
"Ｗ◇六龙回旋：攻击为敌人附加麻痹、迟缓、虚弱状态，攻击必内伤封穴16点；并根据敌人的内伤和封穴6倍削减生命，自身进入6时序的轻云状态，最高16时序",
"Ｗ◇天蝮之屈：被攻击必定反击一次降龙，并为自己施加1次蓄力，减少自身体质X100的伤害，并为敌人附加霸王破甲状态10时序",
"Ｗ◇羽蛇腾云：行动前触发“腾云”，提高自身集气位置100点，降低敌人集气位置100点，并自动进入防御状态，被攻击增加“腾云值”，根据腾云值层数的概率（最高50%）闪避攻击",
"Ｗ腾云值累积100点使增加自身集气为1005，并清除高级异常，回复自身损失生命值10%的生命，清零腾云值",
"Ｗ◇特殊人物：郭靖、洪七公-使用降龙十八掌",
"Ｎ",
"Ｄ组合特效：主运九阴真经+降龙十八掌",
"Ｗ◇行动后为敌人附加荒天龙灭（荒天龙灭：敌人概率无法攻击，必然自由行动）",
"Ｗ◇攻击必然触发以下4招：",
"Ｗ◇升龙威：攻击几率附加3%的生命伤害，为自己附加“升龙天威”（buff存在的时候，敌人根据“龙威”层时序降低三围、五系）",
"Ｗ◇五龙噬：攻击减少敌人10点体力，根据敌我体力差距增加伤害，为敌人附加“噬魂”，当敌人触发内功加力时，为敌人附加“摄魂”“力竭”“龙爪毒”“肝损”“疯魔”效果",
"Ｗ（疯魔：根据buff层数时序损失生命值，攻击后减少层数，被攻击后伤害增加，攻击后减少体力）",
"Ｗ◇苍龙落：攻击附加20点封穴，根据封穴增加伤害，恢复生命体力，敌方集气静止10时序，我方静止5时序，持续时间内敌方时序损失生命值，我方时序回复生命值",
"Ｗ◇荒龙爆：攻击附加20点内伤，根据内伤增加伤害，并且引爆敌人身上的内伤，附加自身内伤+敌人内伤的伤害。并为敌人附加“荒龙爆”buff",
"Ｗ（荒龙爆：敌人行动后根据自身内伤X层数损失生命，根据层数损失体力，清零）",
"Ｗ◇攻击范围为菱形、没有超远距离距离，无极意范围",
"Ｗ◇降龙·亢龙：攻击时可出现8X8攻击范围，无误伤",
"Ｗ◇降龙·飞龙：攻击时敌人必满内伤、满流血值",
"Ｗ◇降龙·潜龙：攻击时根据2倍流血值、3倍内伤值总和扣除生命",
"Ｎ",
"Ｄ组合特效：主运擒龙功，使用降龙十八掌攻击伤害翻倍",
"Ｗ◇擒龙傲世·降龙无双-攻击几率增加内伤，以敌方内伤的3倍削减生命",
"Ｗ◇以自身拳系的1/3附加伤害，以自身60%最大内力值增加攻击力",
"Ｗ◇龙魂不灭-使用降龙攻击自身会恢复大量内力",
"Ｗ◇龙吞天下-降龙攻击必触发9X9范围，消耗内力为10%，降龙攻击为双倍",
"Ｗ◇降龙攻击必定触发以下三招之一：",
"Ｗ◇帝释天临·御雷龙：攻击增加（攻击力+拳掌系数）的伤害，攻击必定使敌人伤重不治，内功停运10时序，几率进入“帝释天临“状态10时序，上限30",
"Ｗ类似霸体，不受到攻击伤害，被攻击恢复自身损失血量8%的伤害，并且反弹帝天狂雷（伤害随着自身生命值降低而增加）",
"Ｗ◇降龙尊相·伏魔龙：无视敌人所有防御和气防，自身攻击、伤害翻倍，敌人进入重度内伤状态10时序，附加肝损状态，几率进入“降龙尊相” 状态10时序，上限30",
"Ｗ持续时间内，敌方集气大幅度下降，使用降龙攻击必削减敌人生命/内力上限80/120点，削减体力5点",
"Ｗ◇四海王威·播雨龙：攻击附加敌我轻功的伤害，提高自身集气5点；回复自身轻功值/2的内力和/4的血量，并为自己附加长生诀状态10时序，几率进入“四海龙王”状态10时序，上限30",
"Ｗ持续时间内集气根据轻功值跳气，几率根据自身集气值回血，减少敌人集气值，敌人根据受伤程度损失生命",
"Ｗ◇擒龙怒气爆发-行动后增加10点怒气，有几率再次怒气爆发",
"Ｗ◇攻击范围为米字格，15格距离，有极意范围",
"Ｗ◇攻击时根据武功气攻1/3触发真伤，杀气250点，内力-20，体力-1，当敌人灼烧或冰封大于0时，概率进入集气波动10时序，自身内力恢复1250点，体力3点",
"Ｗ◇攻击时无视敌方75%防御",
"Ｗ◇擒龙奥义·龙蛇之蛰：攻击必触发满灼烧、冰封、流血值，根据3种负面状态总和触发真实伤害，附加重度内伤与力竭效果",
"Ｗ◇特殊人物：乔峰-使用降龙享受1~6条，攻击后概率进入“帝释天临”状态50时序；洪七公-触发伏魔龙必定进入“降龙尊相”；郭靖-触发播雨龙必定进入“四海龙王”",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇出招式攻击范围变大",                       --问题不断
"Ｗ◇习得打狗棒法后，再学习降龙十八掌的需求降低40点",
"Ｗ◇有余不尽：拳系大于200后使用降龙攻击几率触发6连击，暴怒必出",
}

--newkdef[87黯然销魂掌]=function()
ItemInfo[87]={
"Ｌ习得外功：黯然销魂掌",
"Ｎ",
"Ｗ武功威力：750",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：490",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｗ◇真实攻击：敌方最大内力值的4.6%+自身掌法",
"Ｄ招式特效：（根据拳法系数触发概率最大20%，根据自身生命损失增加概率，最高45%，拳主最大30%，杨过必然触发，主运怒涛海潮功必然触发） 触发以下招式之一",
"Ｗ◇行尸走肉：敌人陷入“恐惧状态”，破防30%",
"Ｗ◇无中生有：自身回合结束后再次行动",
"Ｗ◇六神不安：敌人集气混乱10时序，行动混乱1回合",
"Ｗ◇倒行逆施：攻击时敌人按负系数计算，我方战意高时增加50%伤害",
"Ｗ◇穷途末路：追加自身损失生命值20%的伤害",
"Ｗ◇饮恨吞声：根据当前内力增加伤害，为敌人附加“同归状态”，如果敌人怒气爆发，则集气归零，否则增加敌人15点怒气",
"Ｎ",
"Ｄ组合特效：怒涛海潮功+黯然销魂掌",
"Ｗ◇根据自身内力，及敌我攻击力的差距增伤",
"Ｗ◇进场时依据我方人数决定黯然值，人数越少黯然值越多上限50。",
"Ｗ◇如果是单通模式则在20～40，畅想杨过额外+10。黯然值上限100",
"Ｗ◇每次被攻击时会累积黯然值。队友退场则会直接增加20点黯然值",
"Ｗ◇群通模式下：队友杨过或畅想杨过，只要小龙女退场则直接黯然值满且不会减少",
"Ｗ◇单通模式下，畅想杨过只要队伍里有小龙女，被打死时，队友小龙女生命变为1，杨过满血并进入满黯然值的状态。（整场战斗只能触发一次）",
"Ｗ◇黯然值将减少部分伤害，增加连击数（最高6）并且爆怒时打出极意，根据黯然值决定大小（保底4格）",
"Ｗ◇主运怒涛，使用黯然攻击，根据连击数增加黯然值",
"Ｎ",
"Ｄ配套插件：主运怒涛、学会逆运",
"Ｗ◇战斗中出手时，攻击力临时增加1～3倍，黯然值满100时，立即出手",
"Ｗ◇使用黯然攻击时机率触发以下三特效：",
"Ｗ◇力不从心：必定附加冰冻，虚弱，机率附加集气倒退效果",
"Ｗ◇魂牵梦萦：全场杀200集气",
"Ｗ◇拖泥带水：附加迟缓、并根据自身轻功值、防御力增幅伤害",
"Ｎ",
"Ｗ◇被攻击时，机率触发以下三特效：",
"Ｗ◇呆若木鸡：当回合霸体，下一回合有固定20％的机率不能攻击，回合结束后自动蓄力、防御、休息 ",
"Ｗ◇面无人色：对敌方附加「摄魂」状态",
"Ｗ◇心惊肉跳：没有触发「呆若木鸡」时触发，直接反弹敌方伤害与杀气的1.2被伤害与杀气。机率恢复自身基础异常状态50点",
"Ｎ",
"Ｗ◇特殊人物：杨过-学会黯然即可触发（还是要学逆运）",
"Ｄ◇黯然值越高触发机率越高，满100则必触发，攻击开启的大招：（首次触发时抢跑）",
"Ｗ◇伤害转化20％为真实伤害，并附加以下效果：",
"Ｗ◇天地妒：必定命中，并附加一项高级异常、一项低级异常给敌方",
"Ｗ◇相思无用；爆击率+60，爆击伤害4倍",
"Ｗ◇别期若有定：全场敌人减少1000内力，被攻击者附加重度内伤",
"Ｗ◇莫道黯然销魂：行动后+300集气",
"Ｗ◇黯然销魂者：抽空全场敌我怒气化为伤害，机率随机魅惑一位敌人10时序",
"Ｄ组合特效：美女拳法+黯然销魂掌",
"Ｗ◇别赋·黯然销魂者：被攻击后敌人每时序减少5点怒气，怒气值不会超过50点，根据受到的内伤触发生命和内力的减少，持续10时序",
"Ｗ◇别赋·唯别而已矣：敌人攻击时同时附加冰封、灼烧状态，根据两种状态之和的1.5%倍增加伤害",
"Ｎ",
"Ｚ特别说明：", 
"Ｗ◇敌人生命值低于30%时，概率根据敌人当前生命增伤 ",
"Ｗ◇内伤>30或生命小于70%触发，暴怒必出极意，攻击范围变成面攻，无误伤，追加1200气攻，必破气防 ",
"Ｗ◇资质≥30暴怒触发极意必定连击；资质<30暴怒触发极意高连击 ",
"Ｄ◇黯然销魂掌·三叠浪：杨过专属，需完成杨过领悟黯然极意的剧情（帮瑛姑百花谷战周伯通，胜利后）",
"Ｗ◇生命越低、内伤越高几率越高，资质越高几率越高，触发三连击 ",                               --问题不断
}

--newkdef[88须弥山神掌]=function()
ItemInfo[88]={
"Ｌ习得外功：须弥山神掌",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：420",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：大力金刚掌+须弥山神掌",
"Ｗ◇凝神运气·掌藏须弥：攻击时附加15点流血值，根据流血值的2%倍增加伤害，在根据自身所剩内力的2.5%恢复生命值，350点内力，3点体力",
"Ｎ",
"Ｄ组合特效：易筋经+须弥山神掌",
"Ｗ◇根据自身当前内力值10%增伤，根据自身体质翻倍伤害，根据内力最大值削减生命",
"Ｗ◇行动前自动蓄力且100%成功，蓄力攻击提升4倍 ",
"Ｗ◇三千世界：攻击时敌人几率被附加封穴、流血、内伤、锁足状态 ",
"Ｗ◇一切怨害·慈心相同：攻击杀敌人怒气值10点，如果敌人怒气不足20，则怒气清零 ",
"Ｗ◇攻击距离为10格 ",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带灼烧", 
"Ｗ◇敌人生命值低于50%时，额外附加最大生命值8%的伤害",
"Ｗ◇对生命值低于20%的目标概率直接斩杀",
"Ｎ",                                        --问题不断
}

--newkdef[89七伤拳谱]=function()
ItemInfo[89]={
"Ｌ习得外功：七伤拳",
"Ｎ",
"Ｗ武功威力：540",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：350",
"Ｗ武功范围：■ 5+5×5",
"Ｎ",
"Ｄ组合特效：七伤拳+阴阳无极功",
"Ｗ◇额外削减敌人内伤的5~7倍生命",
"Ｗ◇七伤拳前六式分别会给敌人造成冰封、灼烧、流血、迟缓、内伤、耗内、刺目、集气紊乱效果",
"Ｗ◇七伤拳总诀让敌人无法攻击1回合",
"Ｗ◇七伤拳攻击根据敌人7倍内伤值增加伤害",
"Ｗ◇七伤拳劲·力破千军：7格攻击范围，附加2000点气攻",
"Ｗ◇特殊人物：崆峒三老，谢逊-使用七伤拳",
"Ｎ",
"Ｚ特别说明：",                                --问题不断
"Ｗ◇使用七伤拳攻击，必触发其中一招：",
"Ｗ◇损心：增加777伤害，敌人损失77生命",
"Ｗ◇伤肺：降低敌人集气50%，持续7时序",
"Ｗ◇摧肝肠：给敌人随机上1~7层肝损状态，根据状态层数时序扣减生命",
"Ｗ◇藏离：无视敌人武常，敌人下回合无法移动",
"Ｗ◇精失：敌人失去17点体力",
"Ｗ◇意恍惚：降低敌人伤害和气功的30%，叠加7~17时序",
"Ｗ◇七伤总决：以上六招全发",
"Ｗ◇学会阴阳七伤后，可额外触发一招",
}

--newkdef[90大力金刚掌]=function()
ItemInfo[90]={
"Ｌ习得外功：大力金刚掌",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：350",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：须弥山神掌+大力金刚掌",
"Ｗ◇刚猛雄浑·威猛异常：攻击判定分为两次，第一次根据道德倍增，第二次根据内力增加，攻击的同时自身基础负面状态值将至最低，敌人集气减少300点",
"Ｎ",
"Ｄ组合特效：金刚不坏体+大力金刚掌",
"Ｗ◇金刚般若：依照武常、江湖地位，攻击时计算系数伤害时，大幅提升我方拳掌/指法系数，并于攻击时使敌方拳掌/指法系数计算值大幅降低；被攻击时，系数伤害会扣减防御力再行结算",
"Ｗ◇照見諸法：每次行动前机率蓄力。在有蓄力的情况下攻击，根据自身所学武功数增幅伤害。若武功学满15个，则额外有高机率免疫反击反弹",
"Ｗ◇怒相行深：攻击时机率、受击时必定增加怒气，暴怒时触发「怒目金刚」特效，全场敌人机率附加恐惧状态。当自身怒气值大于15时，被攻击者如有恐惧状态则伤害大幅提升",
"Ｗ◇自在觀空：该场战斗每一次触发「金刚不坏」或「金钟罩护体」特效（金刚不坏体的自带效果，非少林门派效果）时，机率清除部分debuff与内伤，并提升自身战意",
"Ｎ",
"Ｄ组合特效：大力金刚掌+般若掌+易筋经",
"Ｗ◇学会易筋经，大力金刚掌必暴击,般若掌攻击范围变成点，威力双倍。",
"Ｗ◇主运易筋经：使用任意拳掌，破防目标30%，几率附加【业力引爆】效果 ",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇附带灼烧",                                         --问题不断
}

--newkdef[91玄冥神掌]=function()
ItemInfo[91]={
"Ｌ习得外功：玄冥神掌",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：350",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇玄冥·极意：主角攻击时有40%几率触发，暴怒必定触发",
"Ｗ◇玄冥·极意：攻击范围变为面攻，攻击无误伤，并追加1500气攻",
"Ｗ◇增加暴击率",
"Ｗ◇附带冰封、中毒（30）",                                --问题不断
"Ｎ",
"Ｄ组合特效：寒冰绵掌+玄冥神掌",
"Ｗ对应武功威力提升300点",
"Ｗ使用任意武学攻击随即附加1~3层冰冻状态，每层减少1%集气",
"Ｗ被攻击时冻结敌人5时序 ",
"Ｗ◇特殊人物：百损道人-学会玄冥神掌",
"Ｎ",
"Ｄ组合特效：五毒神功+玄冥神掌",
"Ｗ◇根据敌人中毒、内伤和我方面板拳法增伤，并附加内伤15点",
"Ｗ◇玄冥·毒吞天下：敌人全体中毒100点，减体力15点",
"Ｗ◇玄冥·寒冰：敌人增加冰封值50点，随机减集气100点 ",
"Ｗ◇玄冥冰毒：根据敌人身上的冰封、中毒量总和扣除内力",
"Ｗ◇玄冥火毒：根据敌人身上的灼烧、中毒量总和扣除生命",
"Ｗ◇攻击时对敌方附加随机层数玄毒，可叠加，上限50层，每层削减敌方三围2%。满层时爆破敌方50%最大生命伤害，层数大幅减少",
"Ｗ◇被攻击时对自身附加随机层数冥寒，可叠加，上限50层，每层降低所受伤害100点。满层时回复自身50%最大生命，层数大幅减少",
"Ｗ◇攻击时，根据敌方玄毒层数增幅伤害，若敌方玄毒层数大于自身冥寒层数时，自身攻击时，额外再附加玄毒层数%的敌方最大生命伤害",
"Ｗ◇自身冥寒层数大于敌方玄毒层数时，被攻击时，附加冥寒层数＊50的反弹伤害",
"Ｗ◇特殊人物：鹤笔翁，百损道人-学会玄冥神掌",
"Ｎ",
"Ｄ组合特效：寒冰真气or易水寒+玄冥神掌",
"Ｗ◇学会易水寒后根据敌人冰冻值大幅增伤，并为敌人附加冰冻",
"Ｗ◇玄冥·寒冰王座：攻击时无视冰封抗性；被附加冰封时，转化一半的冰封值成为防御性buff",
"Ｗ◇玄冥·冻海冰川：根据敌方的冰冻数值增加伤害，并附加冰冻扣血效果 ",
"Ｗ◇玄冥·寒山霜岭：根据敌方内伤、冰封程度计算破防幅度",
"Ｗ◇玄冥·傲雪凌霜：根据敌我当前内力差值，附加玄冥透骨劲，最高为20层（纯阳无极功会使效果减半，九阳神功or纯阳无极组合完全免疫）",
"Ｗ◇玄冥透骨劲：加大冰封带来的内力值减少，内力掉完掉体力，体力内力掉完掉血。存续其间减少「解除冰封」的减除量，并附加流血。每3时序爆发一次，减少一层透骨劲，对敌方附加随机的冻结、冰破毒、寒毒侵脉以及冰封损血。",
"Ｎ",
"Ｗ",
"Ｗ◇配套插件-寒冰绵掌or化骨绵掌：打上的透骨劲爆发时,附加“阴气污染”特效",
"Ｗ◇配套插件-五毒神掌：使用玄冥神掌攻击引爆毒素溅射，拳法攻击几率大范围极意",
"Ｗ◇特殊人物：游坦之-学会组合后，无视免疫冰封效果",
"Ｗ◇特殊人物：鹿杖客，百损道人-学会玄冥神掌",
"Ｗ◇特殊人物：张三丰、张无忌、斗酒僧-无视玄冥透骨劲",
"Ｎ",
"Ｄ组合特效：非阳内的刀或拳掌+玄冥神掌or沧溟刀法+主运易水寒+雪羽宗宗主",
"Ｗ◇（雪羽宗，且宗主限定，需要救活杨冰羽，见特殊剧情）",
"Ｗ◇杨冰羽-触发「易水寒·此去无返」等三种情形，以下四种攻击效果触发机率独自计算，可能同时出现",
"Ｗ◇进入战斗自身触发玄天寒，随后每10时序随机切换为四寒之一，概率触发以下攻击效果之一：",
"Ｗ◇玄天寒·瀑雪倾泻",
"Ｗ◇周围敌方进入“玄天寒”状态，掌刀系数降低被冰封值，怒气时序降低冰冻层数，且冰封不会时序解除，冰冻解除速度减半",
"Ｗ◇自身攻击触发“瀑雪倾泻”，自身冰封满值，对敌人强制冰封，冰封满则冰冻，冰冻满则冻结，对处于“玄天寒”状态的敌人附加自身三倍冰封值的强制伤害。根据连锁数上升伤害倍数，最多3倍。若对方刚好为玄天寒状态，根据敌方冰封程度附加真实伤害",
"Ｗ",
"Ｗ◇冥狱寒·万鬼哀嚎",
"Ｗ◇周围敌方进入“冥狱寒”状态，攻击值降低被冰封值，战意时序降低冰冻层数，且被冰封时会受到等值灼烧、内伤",
"Ｗ◇自身攻击触发“万鬼哀嚎”，攻击概率恐惧、混乱敌人，并根据敌我双方集气位置差值附加额外伤害，对处于“冥狱寒”状态的敌人额外伤害加倍，附加点燃。根据敌方与我方的集气位置差距，以及敌方冰封值增加伤害。若对方处于冥狱寒，则直接附加等同于集气位置差距值的真实伤害",
"Ｗ",
"Ｗ◇沧海寒·冰覆双极",
"Ｗ◇周围敌方进入“沧海寒”状态，防御力降低被冰封值，特效几率降低10%，且被冰封时会受到等值流血、外伤",
"Ｗ◇自身攻击触发“冰覆双极”，攻击时如敌方发动挪移，闪避，则强制冻结10时序，对处于“沧海寒”状态的敌人，攻击强制命中，并附加敌人最大生命值5%的额外伤害。触发冰覆双极时会给全场敌人附加「冰覆」特效，此特效会在敌方触发闪避、挪移时，附加冻结以及等同于敌方当前冰封值的真实伤害。之后敌方冰封值去除一半。若敌方为沧海寒状态，则攻击伤害根据敌方最大生命值的5%以及敌方冰封值而上升",
"Ｗ",
"Ｗ",
"Ｗ◇溟渊寒·幽魂恸哭",
"Ｗ◇周围敌方进入“溟渊寒”状态，轻功降低被冰封值，集气速度减半，移动力-3，且被冰封时会受到等值的中毒，封穴",
"Ｗ◇自身攻击触发“幽魂恸哭”，攻击概率虚弱、脆弱敌人，并增加（1+（敌我双方距离*10%））倍的伤害（越远伤害越高），对处于“溟渊寒”状态的敌人增加伤害加倍，附加剧毒。若敌方为溟渊寒，则新增以敌我距离的150倍，扣除生命的效果（距离越近扣除的越多）",
"Ｗ",
"Ｗ◇易水寒·此去无还",
"Ｗ◇受到致命伤害时，进入“此去无还”状态，整场战斗只能触发一次，抢跑",
"Ｗ◇四寒效果同时触发，中断对方攻击，回复全部气血，内力，体力，并进入暴怒状态，解除自身全部异常，自身防御力归零(被打就一定死)，攻击力翻倍，攻击破防+50%，附加内力最大值30%伤害，暴击伤害加倍，全特效增加20％成功机率",
"Ｗ*◇此状态触发会维持到战斗结束",
}

--newkdef[92龙爪手]=function()
ItemInfo[92]={
"Ｌ习得外功：龙爪手",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：210",
"Ｗ武功范围：米 5格",

"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高几率流血",                                         --问题不断

"Ｎ",
"Ｄ组合特效：学有龙爪手，成为星宿派掌门",
"Ｗ◇爪影重重：攻击时机率打出大极意范围",
"Ｗ◇星宿派的淬毒手效果独立判定触发机率，并可与门派效果叠加。",
"Ｗ◇攻击时机率为对手附加「九死毒劲」，此毒有以下效果：",
"Ｄ◇a. 敌方中毒上限为300",
"Ｄ◇b. 每攻击一次，毒劲增加一道，并根据毒劲数有以下效果：",
"Ｗ◇1-3道：机率打空。",
"Ｗ◇4-6道：打空机率上升，且打空时给自己附加蛊毒、剧毒效果",
"Ｗ◇7-9道：打空机率不变，但打空时会根据自身中毒量扣减自身血量，并且对全场敌方","Ｗ◇附加剧毒、毒击以及杀气效果。",
"Ｄ插件：鹰爪功+九阴白骨爪",
"Ｗ◇学有鹰爪功，集气速度恒增加10点。被攻击时有10%机率闪避。",
"Ｗ◇学有九阴白骨爪，则机率对敌方附加「撕裂」和等同于中毒值的流血值。",
"Ｗ◇三爪齐全并练有化功大法：必定三连击。",
"Ｗ◇若敌方中毒程度超过100，指系数低于我方时，机率将对方的内力打空并上满中毒。",
"Ｗ◇若敌方血量低于20%，低机率秒杀。",
"Ｗ◇必定触发化功大法，并强化上毒效果。",
}

--newkdef[93葵花宝典]=function()
ItemInfo[93]={
"Ｌ习得内功：葵花神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇体力消耗-2",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇每5时序回复1点体力",
"Ｗ◇基础集气速度提升20%",
"Ｗ◇被攻击，30%的几率发动“葵花移形”，降低30%的所受伤害和杀气",
"Ｗ◇攻击20%机率触发“葵花刺目”：给敌添加肓目BUFF，20%机率攻击MISS", 
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇集气速度+3",
"Ｗ◇攻击40%机率触发“葵花点穴手”：增加气攻1000必封穴",
"Ｗ◇习得葵花神功后，辟邪剑法可发挥出真实威力",

"Ｎ",
"Ｚ特别说明：",
"Ｗ◇正常人需自宫后方可修炼",
"Ｗ◇标主剑神可无视条件修炼",
"Ｗ◇笑傲线打赢葵花尊者后可修炼到葵花奥义【空蝉】：被攻击概率闪现到攻击范围外",
"Ｎ",
"Ｄ组合特效：主运葵花神功+紫霞神功",
"Ｗ◇自带：6层葵花真气，每1层真气闪避1次（三层才开启），25时序恢复1层，护盾存在时触发闪避时反击暗器",
"Ｗ◇葵花挪移大法：25%几率挪移，主运葵花神功时增加35%概率触发「真葵花移行」",
"Ｗ◇葵花重生大法：死亡后可满状态复活1次 ",
"Ｗ◇天人化生·万物滋养：当前内力大于1000时，消耗内力500点，把伤害降为500点 ",
"Ｗ◇提高15点集气速度上限",
"Ｗ◇集气速度增加25%，根据人物位阶额外增加集气速度",
"Ｗ◇攻击根据剑系增加，东方不败额外增加暗器系数攻击",
"Ｗ◇葵花诡影：触发闪避时，概率反击敌人",
"Ｗ◇葵花秘技：行动后概率追上敌人集气位置，随天书增加概率",
"Ｗ◇攻击后恢复300生命、300内力、3点体力、减伤10点内伤",
"Ｗ◇特殊人物：东方不败-自带",
}

--newkdef[94幻阴指法]=function()
ItemInfo[94]={
"Ｌ习得外功：幻阴指",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：315",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：寒冰真气+幻阴指",
"Ｗ◇根据真实指法增伤",
"Ｗ◇一指凝血脉-恐惧1回合，敌人身上冰封值增加20-50点",
"Ｗ◇二指损任督-迟缓10点，利刃寒锋10时序",
"Ｗ◇三指破心神-根据当前内力触发内伤、杀气",
"Ｗ◇无相幻阴·三分天下-攻击触发5X5范围攻击，根据敌人身上的冰封和自身指法扣血",
"Ｗ◇特殊人物：成昆-学会幻阴指",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带冰封、中毒（40）",                                         --问题不断
}

--newkdef[95弹指神通]=function()
ItemInfo[95]={
"Ｌ习得外功：弹指神通",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：350",
"Ｗ武功范围：米 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇桃花绝技：同时修炼弹指/落英/玉箫到极，三种武功威力+200",
"Ｗ◇桃花绝技：40%几率三连击，暴怒必出",
"Ｗ◇桃花绝技：弹指神通：必暴击，气攻+1500",
"Ｗ◇桃花绝技：落英神剑掌：攻击范围变为可移动，并根据敌方内力耗损量增加伤害",
"Ｗ◇桃花绝技：玉箫剑法：攻击距离提升至8格，有60%几率冰封",
"Ｗ◇修炼其中之一后，修炼其余两个的兵器值需求-10",
"Ｗ◇弹指神通·无影神石：使用弹指神通攻击发动",
"Ｗ◇弹指神通·无影神石：追加1000气攻，追加高几率流血，提高60%暴击率",
"Ｗ◇弹指神通·无影神石：黄药师、谢烟客发动时必定暴击",
"Ｗ◇弹指神通·无影神石：*必须学会桃花绝技",
"Ｎ",
"Ｄ组合特效：弹指神通+主运奇门遁甲",
"Ｗ◇根据真实指法、暗器技巧增伤",
"Ｗ◇攻击范围变更为1格，移动范围20格,概率触发8*8范围极意",
"Ｗ◇无视敌人25%防御，无视气防",
"Ｗ◇奇门弹指劲：根据暗器系数附加杀内，内伤10点",
"Ｗ◇桃花弹指劲：根据敌方双倍内伤值增加伤害，强制杀气500，流血值增加50点",
"Ｗ◇弹指·战十方：根据自身攻击力的1/3增加伤害，附加点燃状态",
"Ｗ◇弹指·斗百者：根据敌方所剩内力的1/3增加伤害，封印1回合",
"Ｗ◇弹指·破千钧：根据自身所剩内力的1/3增加伤害，敌方无法内功护体",
"Ｗ◇攻击前，概率向随机一名敌人射击暗器",
"Ｗ◇特殊人物：黄药师-使用弹指神通",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇高几率封穴",                                         --问题不断
}

--newkdef[96一阳指法]=function()
ItemInfo[96]={
"Ｌ习得外功：一阳指",
"Ｎ",
"Ｗ武功威力：560",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：245",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｄ组合特效：一阳指+妙笔丹青",
"Ｗ◇一阳玄指·绝技为先：攻击时敌人封穴50点，集气位置后退150点",
"Ｗ◇气法自然·混辨柔刚：根据敌人受到的4倍封穴值扣除生命",
"Ｎ",
"Ｄ组合特效：一阳指+化骨绵掌",
"Ｗ◇三分之气·变幻小巧：攻击时敌人触发无明业火、创伤、虚弱3个状态个15时序",
"Ｎ",
"Ｄ组合特效：一阳指+六脉神剑",
"Ｗ◇一阳剑气·少阳初生-攻击时根据攻击者剑系增加伤害，攻击必满内伤，根据6倍内伤扣除生命",
"Ｗ◇一阳剑气·生生不息-攻击时根据现有内力值降低生命，冰封、灼烧、流血必满触发",
"Ｎ",
"Ｄ组合特效：枯荣禅功+一阳指",
"Ｗ◇空手进招·暗点大穴：强制全场敌人上2~7点封穴，突破封穴上限",
"Ｗ◇变化无穷·虚实莫测：全场强制杀气50点，附加10~20点流血值内伤值，根据流血、内伤状态扣血",
"Ｗ◇声东击西·欲虚反实：伤害加倍，攻击后根据敌人所剩内力值来消减敌人内力",
"Ｗ◇动若江河·静如山岳：伤害加倍，攻击后根据敌人的内力恢复自身内力，根据敌人指系恢复生命",
"Ｗ◇特殊人物：段思平必触发，一灯大师使用一阳指",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇一指破蟾：一阳指可以克制蛤蟆功，清除对方身上50%蛤蟆功蓄力值",
"Ｗ◇六脉神剑招式几率提升至60%",
"Ｗ◇增加暴击率",
"Ｗ◇附带灼烧、高封穴",                                         --问题不断
}

--newkdef[97太极拳经]=function()
ItemInfo[97]={
"Ｌ习得外功：太极拳",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：70",
"Ｗ武功范围：十 4格",
"Ｎ",
"Ｄ组合特效：太极拳+空明拳",
"Ｗ◇太空卸劲：被攻击几率减伤1/3，降低敌方集气位置100，提高自己集气位置100",
"Ｎ",
"Ｄ组合特效：太极拳or混元掌or白蟒鞭法+混元功or混沌气决+纯阳无极，使用太极拳or混元掌or白蟒鞭法攻击",
"Ｗ◇闪电五连鞭：必中，附带30点真伤，必定五连，对自己附加10时序的集气紊乱（羞耻的文字特效，酷炫的闪电特效）",
"Ｗ◇武当2级以上弟子不会附加集气紊乱",
"Ｎ",
"Ｄ组合特效：太极拳+混元掌+白蟒鞭法+混元功or混沌气决+纯阳无极，主运混元功or混沌气决",
"Ｗ◇接：被打第一下时触发，伤害减少20％",
"Ｗ◇化：被打第二下时触发，为自己储存等同于杀气1/2的伤害",
"Ｗ◇发：被打第三下时触发，先手反击，50％几率为盲目攻击，接化发重新计算 ",
"Ｎ",
"Ｄ组合特效：纯阳无极功+太极拳",
"Ｗ◇额外削减敌人内伤值的生命",
"Ｗ◇太极拳·以柔克刚：攻击后敌人怒气下降，当敌人怒气被降到40点时直接降为0 ",
"Ｗ◇太极拳·以刚克柔：攻击后敌人内伤上升，当敌人内伤值为50点时直接升为100",
"Ｗ◇太极拳法·圆融之道：攻击附加气攻1500，7格范围攻击",
"Ｗ◇太极拳法·运转如流：攻击到敌人将全屏敌人拉到攻击者身边进行攻击",
"Ｗ◇特殊人物：张三丰-无条件触发",
"Ｎ",
"Ｄ组合特效：太极奥义：太极拳+太极剑",
"Ｗ◇基础特效：",
"Ｗ◇太奥组合享受攻防+3%的效果",
"Ｗ◇被攻击几率（资质/4+35%）触发，降低25%所受到的杀气",
"Ｗ◇真.太极奥义 四两拨千斤：触发太极奥义时有25%的几率，完全免疫基础杀气（除强制杀气）",
"Ｗ◇太极剑法必连击",
"Ｗ◇进阶特效：",
"Ｗ◇被攻击时免疫普通杀气，被强制杀气无视，减伤45%",
"Ｗ◇太极奥义·拳罡-太极拳攻击时附加内伤13点，内伤值大于40点后真伤100点",
"Ｗ◇太极奥义·剑劲-太极剑攻击时伤害增加15点，附加9点流血值，7点封穴值",
"Ｗ◇特殊特效：",
"Ｗ◇回合前选择手动蓄力，蓄力成功后触发<剑罡拳劲>（行动前蓄力可以触发，比如主运龙象）",
"Ｗ◇蓄力成功后攻击者集气速度增加5点（不叠加），被攻击者触发满内伤",
"Ｗ◇太极拳攻击时会根据敌人的4倍内伤值附加伤害、杀气以及扣除相应的生命值，恢复自身生命值",
"Ｗ◇太极剑攻击时自身恢复生命150点，现有内伤减少50%",
"Ｎ",
"Ｄ组合特效：",
"Ｚ◇<开太极>",
"Ｗ◇主运太极神功，使用太极拳法或太极剑法",
"Ｗ◇蓄力值超过500且暴怒触发",
"Ｗ◇根据当前生命值跟内力值追加大范围伤害，生命越低/内力越高伤害越高",

}

--newkdef[98空明拳谱]=function()
ItemInfo[98]={
"Ｌ习得外功：空明拳",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：140",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：太极拳+空明拳",
"Ｗ◇太空卸劲：被攻击几率减伤1/3，降低敌方集气位置100，提高自己集气位置100",
"Ｎ",
"Ｄ组合特效：全真剑法+空明拳",
"Ｗ◇增伤666",
"Ｗ◇兵强则灭·木强则折：根据被攻击敌人的攻击力扣除生命值，敌防御力和轻功总和扣除内力值",
"Ｗ◇坚强处下·柔弱处上：自身集气位置增加150，根据自身当前内力的5%恢复生命",
"Ｎ",
"Ｄ组合特效：金关玉锁决+空明拳",
"Ｗ◇增伤666",
"Ｗ◇空朦洞松·风通容梦·冲穷中弄·童庸弓虫：根据敌人全属性增加伤害",
"Ｗ◇奥义·空碗盛饭：强制封穴",
"Ｗ◇奥义·空屋住人：昏迷1回合",
"Ｗ◇奥义·妙手空空：点燃、麻痹1回合",
"Ｗ◇奥义·深藏若虚：根据自身最大内力值/20增加伤害",
"Ｗ◇特殊人物：周伯通-学会空明拳，无条件触发",
"Ｎ",
"Ｚ特别说明：无",  
"Ｗ◇增加连击率",                                        --问题不断
}

--newkdef[99天山折梅手]=function()
ItemInfo[99]={
"Ｌ习得外功：天山折梅手",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：140",
"Ｗ武功范围：▽ 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇天山折梅：天山折梅手修炼到极后，每多一个其他武功到极：",
"Ｗ◇天山折梅：气攻增加100（对所有人有效，此处有具体提示）",
"Ｗ◇天山折梅：威力增加50（仅对虚竹/无崖子/天山童姥/李秋水有效）",
"Ｎ",
"Ｚ特别说明：无",                                  --飘夜
}

ItemInfo[100]={
"Ｌ习得外功：铁掌",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：105",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：铁剑or铁掌+铁布衫",
"Ｗ◇铁甲依然在：护甲提升30%，被攻击20%恢复生命最大值5%",
"Ｎ",
"Ｄ组合特效：铁布衫+铁掌",
"Ｗ◇火锻之身：灼烧效果大幅下降，并与其他负面不产生连动，免疫冰封",
"Ｗ◇炼铁手：当自身被打出灼烧，以及集气过程有灼烧时都会蓄积「炼铁劲」（使用铁掌攻击可以带出「炼铁劲」，必定灼烧，并无视敌方装备的防御力加成(「炼铁劲」针对丐帮效果显著)，之后减少20%~30%「炼铁劲」）",
"Ｎ",
"Ｗ◇炼铁手·化金元诀：攻击时额外附加自身装备攻击力加成的伤害",
"Ｗ◇炼铁手·绝木神罡：攻击附加火毒攻心状态，并在十时序内所有回血效果失效",
"Ｗ◇炼铁手·灭水空焰：攻击必流血、内伤。若敌方已有流血或内伤则附加等值真实伤害",
"Ｗ◇炼铁手·吞火御天：攻击附加点燃，并且根据敌方灼烧增加伤害",
"Ｗ◇炼铁手·断土狂雷：八格内的敌人攻击回合结束后，承受自身内力1/30的伤害并减少10点体力",
"Ｗ◇炼铁极意·焚海锻天：自身满怒气、「炼铁劲」 >= 500。打出8X8范围的攻击，「炼铁劲」的攻击加成大幅增加，并极大程度降低敌方防御力，清空「炼铁劲」",
"Ｗ◇特殊人物：裘千仞-使用铁掌",
"Ｎ",
"Ｚ特别说明：", 
"Ｗ◇强上内伤：使用铁掌攻击，几率触发",
"Ｗ◇强上内伤：无视对方气防追加12-15点内伤",                                 --飘夜
}

ItemInfo[101]={
"Ｌ习得外功：落英神剑掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：900",
"Ｗ内力消耗：105",
"Ｗ武功范围：十 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇桃花绝技：同时修炼弹指/落英/玉箫到极，三种武功威力+200",
"Ｗ◇桃花绝技：40%几率三连击，暴怒必出",
"Ｗ◇桃花绝技：弹指神通：必暴击，气攻+1500",
"Ｗ◇桃花绝技：落英神剑掌：攻击范围变为可移动，并根据敌方内力耗损量增加伤害",
"Ｗ◇桃花绝技：玉箫剑法：攻击距离提升至8格，有60%几率冰封",
"Ｗ◇修炼其中之一后，修炼其余两个的兵器值需求-10",
"Ｎ",
"Ｄ组合特效：碧海潮生功+落英神剑掌",
"Ｗ◇根据敌人2倍流血扣血、增伤",
"Ｗ◇景严·落英散华：7格范围攻击，1000点气攻，无视敌人15%防御，必破气防",
"Ｗ◇亢景·落英汇聚：全屏杀集气50，造成流血和内伤效果，根据自身内力增加伤害和杀气值",
"Ｗ◇终景·黄帝剑掌：敌人刺目、点燃、止杀1回合",
"Ｗ◇触发以上任意攻击必触发流血，根据流血的3倍增加伤害",
"Ｗ◇特殊人物：黄药师-学会落英神剑掌",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇高几率封穴",                                         --问题不断
}

ItemInfo[102]={
"Ｌ习得外功：九阴白骨爪",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：105",
"Ｗ武功范围：米 6格",
"Ｎ",
"Ｄ组合特效：火焰刀法+九阴白骨爪",
"Ｗ◇增伤500，攻击变成菱形，可移动为8格，攻击范围根据拳系增加",
"Ｗ◇腐骨摧心·元阴无限：攻击附加满冰封值，20时序内无法解毒，根据中毒、冰封值总和扣除生命，进入恐惧状态",
"Ｎ",
"Ｄ组合特效：九阴白骨爪+主运九阴神功",
"Ｗ◇根据真实拳法、指法增加伤害",
"Ｗ◇摧坚神爪·五指发劲：攻击敌人时进入蓄力状态",
"Ｗ◇摧坚神爪·无坚不破：敌人处于封印、点燃、麻痹状态",
"Ｗ◇摧坚神爪·摧敌首脑：敌人攻击必偏移",
"Ｗ◇摧坚神爪·如穿腐土：敌人处于混乱、昏迷状态",
"Ｗ◇攻击根据使用者拳、指双系叠加伤害",
"Ｗ◇攻击无视敌人50%防御",
"Ｗ◇特殊人物：黄裳-无条件触发",
"Ｚ特别说明：无",                                  --问题不断
}

ItemInfo[103]={
"Ｌ习得外功：百花错拳",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：800",
"Ｗ内力消耗：70",
"Ｗ武功范围：■ 5+7×7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",
"Ｗ◇增加连击率",                             --飘夜
}

ItemInfo[104]={
"Ｌ习得外功：灵蛇拳",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：800",
"Ｗ内力消耗：70",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：灵蛇拳+主运蛤蟆功",
"Ｗ◇根据自身真实拳掌值和敌人中毒值增加额外伤害", 
"Ｗ◇八岐·烈火毒：对敌附加火毒、阳气侵蚀状态8时序。机率附加点燃8时序。皆可叠加 ", 
"Ｗ◇八岐·玄冰毒：对敌附加寒毒、阴气污染状态8时序。机率附加冰冻与扣血8时序，皆可叠加", 
"Ｗ◇八岐·七死毒：对敌附加毒击4回合。可叠加 ", 
"Ｗ◇八岐·冰魄毒：对敌附加冰魄毒8时序，可叠加，上限30时序 ", 
"Ｗ◇八岐·剧蛇毒：对敌附加西域蛇毒8时序，可叠加，上限30时序 ", 
"Ｗ◇八岐·龙眠毒：对敌附加龙眠毒8层，可叠加。龙眠毒会在行动后根据层数减少回气。（5层则减少100～500回气、8层则减少100～800回气） ", 
"Ｗ◇八岐·蛇蛊毒：附加白驼蛇蛊特效8时序，可叠加 ", 
"Ｗ◇八岐·裂创毒：附加出血蛇毒特效8时序，可叠加", 
"Ｗ◇特殊大招：当自身中毒超过100时，机率触发「八岐天灾」，全场附加中毒25点，并扣减10点体力，触发八岐天灾时，再机率判定触发全场减少其中毒程度的集气，并附加集气紊乱", 
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇使用灵蛇拳攻击时机率对自己附加中毒、提升伤害，并触发以上八特效之一，欧阳父子必触发",
"Ｗ◇附带冰封、中毒(10)",                                         --问题不断

}

ItemInfo[105]={
"Ｌ习得外功：天山六阳掌",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：900",
"Ｗ内力消耗：7",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：天山六阳掌+八荒六合功",
"Ｗ◇根据自身真实拳掌值增加额外伤害", 
"Ｗ◇攻击距离增加为12格 ", 
"Ｗ◇灵动飘逸·闲雅清隽：自身集气增加25点", 
"Ｄ组合特效：天山六阳掌+主运八荒六合功",
"Ｗ◇举重若轻·潇洒如意：敌人被攻击后内伤、流血、封穴全满 ", 
"Ｗ◇安禅制龙·青阳岁除：根据内伤、流血、封穴三种状态触发真伤 ", 
"Ｗ◇特殊人物：逍遥子，天山童姥-无条件触发", 
"Ｎ",
"Ｄ组合特效：主运北冥神功+天山六阳掌",
"Ｗ◇根据自身气攻增加额外伤害", 
"Ｗ◇落日熔金：攻击时以自身现有内力值一半削减敌人内力 ", 
"Ｗ◇天山阴阳掌：攻击时根据敌人内力属性附加不同效果，阴内必冰封、沉睡，阳内必灼烧、点燃，调和沉睡、麻痹", 
"Ｗ◇真·阳歌天钧：特效伤害翻倍，根据拳掌系数的15倍附加杀气，根据气防的一般削减内力，根据气攻值降低自己内伤 ", 
"Ｗ◇真·阳春白雪：攻击必定破防，封印1回合 ", 
"Ｗ◇真·阳关三叠：攻击敌人后恢复生命333点，体力13点 ", 
"Ｗ◇日斜归路晚霞明：触发9格范围攻击，附加气攻2000 ", 
"Ｗ◇云霞出海曙·白日参辰现：大幅度增加灼烧值，再根据拳系、敌人现有灼烧值附加伤害 ", 
"Ｗ◇特殊人物：逍遥子，无崖子，天山童姥-无条件触发", 
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带灼烧",                                         --问题不断
}

--newkdef[106绵掌掌谱]=function()
ItemInfo[106]={
"Ｌ习得外功：绵掌",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：700",
"Ｗ内力消耗：28",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：纯阳无极功+绵掌",
"Ｗ◇根据敌人3倍内伤值增伤",
"Ｗ◇内蓄刚劲·外现绵柔：攻击时附加内伤11点，敌人内伤超过20点后，被攻击掉血200点",
"Ｗ◇刚而不犟·柔而步软：以自身内力、拳系、敌方2倍内伤附加伤害，敌人内伤超过30点每次被攻击增加25点流血",
"Ｗ◇快而不乱·慢而不断：基础伤害增加300点，每次攻击敌人冰封、灼烧增加25点，敌人内伤值超过40点昏迷1回合",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高连击",                                         --问题不断
"Ｗ◇张三丰：无条件触发",
"Ｗ◇武当3级以上弟子：学会组合，用拳法可以带出",
}

--newkdef[107美女拳法]=function()
ItemInfo[107]={
"Ｌ习得外功：美女拳法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：700",
"Ｗ内力消耗：14",
"Ｗ武功范围：■ 4+7×7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                        --飘夜
}

--newkdef[108寒冰绵掌]=function()
ItemInfo[108]={
"Ｌ习得外功：寒冰绵掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：35",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带冰封、中毒(10)",                                         --问题不断
"Ｄ组合特效：化骨绵掌+寒冰绵掌",
"Ｗ◇寒冰化骨·青寒：根据敌我2倍冰封值增伤，攻击时额外附加7点冰封值，冰封值大于40点时集气停止10时序",
"Ｎ",
"Ｄ组合特效：寒冰真气or易水寒+寒冰绵掌",
"Ｗ◇根据自身内力最大值的3%附加额外伤害，攻击附加冻结5时序",
"Ｗ◇春寒阴云：攻击造成额外封穴",
"Ｗ◇夏寒瀑雨：再次根据自身内力最大值的3%附加额外伤害",
"Ｗ◇秋寒瑟风：根据敌方冰封值强制杀气，下回合自身集气速度+10",
"Ｗ◇冬寒飞雪：攻击对自身周围7格敌人造成额外20点冰封值",
"Ｗ◇特殊人物：韦一笑-使用寒冰绵掌",
"Ｗ◇特殊人物：杨冰羽-无条件",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习玄冥神掌一脉相承",

}

--newkdef[109鹰爪功法]=function()
ItemInfo[109]={
"Ｌ习得外功：鹰爪功",
"Ｎ",
"Ｗ武功威力：375",
"Ｗ武功气攻：700",
"Ｗ内力消耗：35",
"Ｗ武功范围：米 6格",
"Ｎ",
"Ｄ组合特效：乾坤大挪移+鹰爪功",
"Ｗ◇根据5倍封穴增伤",
"Ｗ◇鹰爪擒拿·爪擒打拿：攻击降低敌方20点怒气，无法攻击1回合",
"Ｗ◇鹰爪擒拿·辗转腾挪：敌全体处于封穴状态，每次攻击增加5~15点封穴值",
"Ｗ◇鹰爪擒拿·分筋错骨：根据敌人的封穴增伤，削减生命、内力，附加冰封、灼烧值12点",
"Ｗ◇特殊人物：殷天正-使用鹰爪功",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高几率流血",                                         --问题不断
}

--newkdef[110五毒秘传]=function()
ItemInfo[110]={
"Ｌ习得外功：五毒神掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：21",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带冰封、中毒(20)", 
"Ｎ",
"Ｄ组合特效：五毒神掌+五毒神功",
"Ｗ◇组合基础效果：每次攻击敌人必附加6点中毒值，根据敌人3倍中毒值增加自身攻击力，敌人被攻击后减少1点体力值",
"Ｗ◇五毒神掌·赤毒-敌人中毒值超过20时，每次攻击敌人内伤增加10点，根据3倍内伤值提高攻击力，敌人50时序内处于迟缓状态",
"Ｗ◇五毒神掌·翠毒-敌人中毒值超过40时，每次攻击敌人冰封、灼烧增加12点，根据3倍冰封、灼烧值增加伤害，额外扣除200点生命，400点内力，混乱一回合",
"Ｗ◇五毒神掌·青毒-敌人身上超过60点中毒值时每次流血值增加15点，根据3倍流血值增加伤害，根据生命值最大值的2%扣除生命，时序紊乱10-15时序",
"Ｎ",
"Ｄ<配套插件：冰蚕毒掌>",
"Ｗ◇对应武功威力增加300",
"Ｗ◇毒布武林：行动前使全场敌人中毒,随着用施毒能力增加而增加，并几率叠加随机负面状态，扣减敌方中毒值的血量",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇特殊人物：李莫愁，使用五毒神掌",
"Ｎ",                                       --问题不断
}

--2
--newkdef[111逍遥游]=function()
ItemInfo[111]={
"Ｌ习得轻功：逍遥游",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇移动格数+1",
"Ｗ◇被连击、暴击伤害减少30%，轻功位置判定+200",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇进一步降低连击伤害，当敌方四连或以上则机率闪避，连击数越高闪避机率越大(敵方有削弱此機率)",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇包裹里有酒时，每15时序以下效果之一：",
"Ｗ◇逍遥醉步·命：十时序的持续回血状态",
"Ｗ◇逍遥醉步·气：十时序的持续回内状态",
"Ｗ◇逍遥醉步·速：出手前集气速度上升",
"Ｗ◇每一次触发逍遥醉步，都会为自己叠加「微醺」状态。微醺状态中，攻击伤害上升但低机率打空",
"Ｗ◇当叠加到八层微醺后，再触发逍遥醉步，就会开启「醉八仙」状态",
"Ｗ◇【醉八仙】拳特类武功伤害大幅增加，被拳特类武功攻击必然闪避，被其他系攻击免疫普通杀气并减伤",
"Ｗ◇醉八仙状态持续三回合，醉八仙结束后微醺状态清零（主动运用门派指令开启醉八仙也会清零微醺）",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇被集气速度低于自己的敌人攻击时机率免疫杀气",
"Ｗ◇【托尼福利】：满足高阶条件并装备酒神秘籍，战斗后练出的酒量增加（但食材需求数量不变）",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇【丐帮】使用物品的效果翻倍。降低逍遥醉步的时序要求",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇萧峰：万水千山纵横：所有集气速度低于自己的敌人，被攻击时承受双倍伤害",
"Ｗ◇洪七公：当偷到的东西是药品时，立刻享受该药品的效果（不消耗数量）",                                       --问题不断
}

--newkdef[112罗汉拳谱]=function()
ItemInfo[112]={
"Ｌ习得外功：罗汉拳",
"Ｎ",
"Ｗ武功威力：140",
"Ｗ武功气攻：-",
"Ｗ内力消耗：7",
"Ｗ武功范围：米 3格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇般若掌：同时修炼易筋神功，使用罗汉拳60%几率触发",
"Ｗ◇般若掌：伤害提高50点",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高连击",  
"Ｚ一脉相承：",
"Ｗ◇学习韦陀掌一脉相承",                                         --飘夜
}

--newkdef[113六脉神剑]=function()
ItemInfo[113]={
"Ｌ习得外功：六脉神剑",
"Ｎ",
"Ｗ武功威力：1000",
"Ｗ武功气攻：2000",
"Ｗ内力消耗：700",
"Ｗ武功范围：《 9格",
"Ｎ",
"Ｄ招式特效：攻击时（25+实战/20）%几率触发招式之一或者使用六脉对应招式：",
"Ｗ◇中冲剑（剑逆天光）：无视敌方气防，必破防50%（2回合cd）",
"Ｗ◇关冲剑（剑煌镜影）：增加一次连击，附带灼烧效果（3回合cd）",
"Ｗ◇少冲剑（南柯万剑）：必暴击，且暴击攻击加成提升至200%（3回合cd）",
"Ｗ◇少泽剑（皇玺剑印）：对目标造成随机眩晕/虚弱/定身（5回合cd）",
"Ｗ◇剑气碧烟横：本次敌方的指法系数按50%计算"  ,
"Ｗ◇特殊人物：段思平-必触发招式之一",
"Ｎ",
"Ｄ组合特效：六脉神剑+一阳指",
"Ｗ◇根据自身剑、指系增加伤害",
"Ｗ◇六脉指劲·急如电闪：攻击时敌全体集气降低100集气，66点生命",
"Ｗ◇六脉指劲·迅猛绝伦：攻击时敌全体封穴16-26点，减少6点体力",
"Ｎ",
"Ｄ组合特效：六脉神剑+一阳指+主运天南易阳",
"Ｗ◇攻击翻6倍，额外损失面板攻击的生命，攻击时敌人防御按照70%计算  ",
"Ｗ◇少商剑：必冰封，根据攻击者指法系数的33%附加伤害，每次攻击触发内伤25点",
"Ｗ◇商阳剑：必灼烧，根据被攻击者的2被内伤附加伤害，6倍内伤削减内力",
"Ｗ◇中冲剑：根据自身的内力和生命值之差附加流血值和伤害，根据自身最大生命值增加杀气",
"Ｗ◇关冲剑：根据敌人的冰封、灼烧的6倍总和增加伤害",
"Ｗ◇少冲剑：攻击翻倍，封印1回合，利刃寒锋10时序",
"Ｗ◇少泽剑：攻击翻倍，点燃、沉睡1回合",
"Ｗ◇六脉剑气：攻击时触发全体敌人减6点体力，封穴附加30-50点",
"Ｗ◇六剑合一：攻击时同时触发六脉组合效果",
"Ｗ◇战意爆发时触发大招六脉奥义·剑气碧烟横：根据指法范围扩大极意，根据自身当前内力值增加伤害，根据敌我指法差、最大内力值与敌人当前内力值差扣除敌方生命值",
"Ｗ◇特殊人物：段誉-学会六脉，段思平-无条件触发，剑太一使用六脉",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇可触发必须使用剑系武功才能触发的特效",
}

--newkdef[114独孤九剑]=function()
ItemInfo[114]={
"Ｌ习得外功：独孤九剑",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1600",
"Ｗ内力消耗：140",
"Ｗ武功范围：米 7格",
"Ｎ",
"Ｄ组合特效：独孤九剑+持瑶琴",
"Ｗ◇被攻击时概率增加御剑值最高到上限",
"Ｎ",
"Ｄ组合特效：独孤九剑+天赋-九剑真传",
"Ｗ◇根据自身实战增伤",
"Ｗ◇有进无退：攻击时后，如果自身没有回气，则增加集气位置300点",
"Ｗ◇使用独孤九剑攻击：攻击必命中，必触发之一，其余概率触发。战意爆发时，攻击特效全出：",
"Ｗ◇奥义·破剑式：攻击时根据流血附加伤害、时序流血效果，流血不会恢复",
"Ｗ◇奥义·破刀式：攻击附加昏迷、点燃、冰封",
"Ｗ◇奥义·破枪式：攻击时吸取敌人全体的集气位置增加我方集气位置",
"Ｗ◇奥义·破鞭式：攻击时自身范围9格根据敌我内力扣除敌人生命",
"Ｗ◇奥义·破索式：敌人陷入麻痹状态，阻止敌人正常集气",
"Ｗ◇奥义·破掌式：攻击时不产生怒气，并使敌人怒气减半",
"Ｗ◇奥义·破箭式：攻击敌人使其致盲，并使敌人内伤无法化解",
"Ｗ◇奥义·破气式：一次性秒掉所有敌人大量内力，并阻止敌人内力恢复",
"Ｗ◇奥义·破尽天下：攻击叠减敌人所有兵器值81点，9点连击、暴击概率，敌人行动后恢复",
"Ｗ◇特殊人物：令狐冲二次觉醒-使用独孤九剑，风清扬-使用剑法，独孤求败-无条件",
"Ｎ",
"Ｄ组合特效：独孤九剑+天赋-九剑真传",
"Ｗ◇离剑式：无视攻击距离带来的伤害降低",
"Ｗ◇倒剑式：降低敌人集气位置200点",
"Ｗ◇撩剑式：增伤20%",
"Ｗ◇荡剑式：攻击后回气150点",
"Ｗ◇有进无退：如果自身没有回气效果，则行动后额外回气300点",
"Ｎ",
"Ｄ组合特效：独孤九剑+九霄仙息",
"Ｗ◇初始集气1005，被攻击后增加9点战意",
"Ｗ◇独孤剑意调息：行动前清除所有异常，回合开始时休息一次，恢复状态，恢复生命50、内力500、体力9，内伤减9、中毒减9",
"Ｗ◇后发先至：被攻击后，会触发以暗器为基础的反击（根据自身剑系和暗器值）",
"Ｗ◇自带九层独孤剑气，每道剑气伤害提升伤害，并且根据自身实战增伤，9时序恢复一道",
"Ｗ◇奥义·总决式：攻击随机触发1~9级剑气,必封穴、流血、冰封、灼烧",
"Ｗ◇特殊人物：独孤求败-无条件",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                         --问题不断
"Ｗ◇习得持瑶琴后，再学习独孤九剑的需求降低40点",
}

--newkdef[115太极剑法]=function()
ItemInfo[115]={
"Ｌ习得外功：太极剑法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：280",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：太极剑法+柔云剑法",
"Ｗ◇被攻击时，有50%几率将被杀气量的一半转化为回血",
"Ｗ◇剑法攻击增加御剑/200范围，最高+2",
"Ｎ",
"Ｄ组合特效：太极剑法+太极神功",
"Ｗ◇增伤30%+150",
"Ｗ◇以慢打快·后发先至：被攻击时触发，根据防御力反击敌人的杀气",
"Ｗ◇神在剑先·连绵不绝：被攻击时触发，集气增加200点或免疫杀气",
"Ｗ◇意在剑先·连绵不绝：攻击触发封印效果",
"Ｗ◇太极剑法·太极圆转：攻击触发7X7攻击范围，气攻1500",
"Ｗ◇太极剑法·阴阳动静：被攻击后，如果敌人怒气为50,减10点",
"Ｗ◇特殊人物：张三丰-使用太极剑",
"Ｎ",
"Ｄ组合特效：太极奥义：太极拳+太极剑",
"Ｗ◇基础特效：",
"Ｗ◇太奥组合享受攻防+3%的效果",
"Ｗ◇被攻击几率（资质/4+35%）触发，降低25%所受到的杀气",
"Ｗ◇真.太极奥义 四两拨千斤：触发太极奥义时有25%的几率，完全免疫基础杀气（除强制杀气）",
"Ｗ◇太极剑法必连击",
"Ｗ◇进阶特效：",
"Ｗ◇被攻击时免疫普通杀气，被强制杀气无视，减伤45%",
"Ｗ◇太极奥义·拳罡-太极拳攻击时附加内伤13点，内伤值大于40点后真伤100点",
"Ｗ◇太极奥义·剑劲-太极剑攻击时伤害增加15点，附加9点流血值，7点封穴值",
"Ｗ◇特殊特效：",
"Ｗ◇回合前选择手动蓄力，蓄力成功后触发<剑罡拳劲>（行动前蓄力可以触发，比如主运龙象）",
"Ｗ◇蓄力成功后攻击者集气速度增加5点（不叠加），被攻击者触发满内伤",
"Ｗ◇太极拳攻击时会根据敌人的4倍内伤值附加伤害、杀气以及扣除相应的生命值，恢复自身生命值",
"Ｗ◇太极剑攻击时自身恢复生命150点，现有内伤减少50%",
"Ｎ",
"Ｄ组合特效：",
"Ｚ◇<开太极>",
"Ｗ◇主运太极神功，使用太极拳法或太极剑法",
"Ｗ◇蓄力值超过500且暴怒触发",
"Ｗ◇根据当前生命值跟内力值追加大范围伤害，生命越低/内力越高伤害越高",                                  --问题不断
}

--newkdef[116玄铁剑法]=function()
ItemInfo[116]={
"Ｌ习得外功：玄铁剑法",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1500",
"Ｗ内力消耗：420",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：玄铁剑法+天赋-剑魔再临",                                       --问题不断
"Ｗ◇根据自身气攻、武功威力、敌我体质差增伤",
"Ｗ◇重剑无锋：攻击时根据自身内力、气攻附加伤害，扣除2%最大生命值，9X9格内无法移动",
"Ｗ◇大巧不工：攻击时根据自身剑系、内伤增伤，敌人内功无法护体，攻击时敌人必满内伤",
"Ｗ◇天极剑渊：攻击破防50%",
"Ｗ◇破尽天下：攻击气攻增加800，必破气防",
"Ｗ◇真·重剑无锋·大巧不工：战意爆发或者怒气爆发时攻击触发9X9范围攻击，暴击大幅度增加，破防40%，伤害加倍，强制封穴5~20点，敌人无法移动，并为敌人附加“玄铁剑创”",
"Ｗ◇玄铁剑创：削弱敌人三围，生命、内力",
"Ｗ◇特殊人物：杨过独孤剑冢胜大雕-使用玄铁剑法，大雕-使用剑法，独孤求败-无条件",
"Ｎ", 
"Ｄ组合特效：玄铁剑法+怒涛海潮功",
"Ｗ◇重剑无锋·破尽天下：随实战提高暴击概率，暴击时概率破气防增加2000气攻",
"Ｎ", 
"Ｄ组合特效：玄铁剑法+怒涛海潮功",
"Ｗ◇玄铁重剑·倒劈：全场杀气100，敌人概率昏迷",
"Ｗ◇玄铁重剑·横削：连续攻击4~5次，自身进入霸体状态，攻击后混乱1回合",
"Ｗ◇玄铁重剑·逆挑：必破气防，必封穴，为敌人附加“气阻中门”“封气绝脉”",
"Ｗ◇玄铁重剑·顺刺：将部分气攻转化为真实伤害，削减敌人生命、内力",
"Ｗ◇特殊人物：独孤求败-无条件，杨过、神雕-使用玄铁剑攻击",
"Ｎ",
"Ｚ特别说明：重剑真传（剑主、杨过、大雕、独孤专属）：",
"Ｗ◇玄铁极意：玄铁剑法可移动，增加300威力",
"Ｗ◇重剑真传·浪如山涌剑如虹：攻击概率随御剑增加范围，暴怒必然触发，增加1200气攻",
}

--newkdef[117苗家剑法]=function()
ItemInfo[117]={
"Ｌ习得外功：苗家剑法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：350",
"Ｗ武功范围：《 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇胡刀苗剑·归真合一：同时修炼胡家刀法与苗家剑法到极，",
"Ｗ◇胡刀苗剑·归真合一：用其中一种武功攻击时几率触发",
"Ｗ◇胡刀苗剑·归真合一：攻击效果提升40%，追加1500气攻",
"Ｎ",
"Ｚ特别说明：",                                        --飘夜
"Ｗ◇习得胡家刀法后，再学习苗家剑法的需求降低40点"
}

--newkdef[118斗转星移]=function()
ItemInfo[118]={
"Ｌ习得秘技：斗转星移",
"Ｎ",
"Ｄ学会斗转，打到豪侠位阶： 被攻击根据顺序强制减伤",
"Ｗ◇斗转妙法·北斗移辰-根据敌方攻击力扣除内力",
"Ｗ◇斗转妙法·陨石星浪-根据敌方攻击威力扣除相应的生命",
"Ｗ◇斗转妙法·参商合离-敌人被附加参合状态，双目失明",
"Ｗ◇斗转妙法·日月交替-断连、断左右",
"Ｗ◇（触发斗转星移反击时，本次武功威力伤害随翻倍）",
"Ｎ",
"Ｄ觉醒方法：限定天邪，获得天龙天书，队伍中有慕容复，对话扫地僧书架，战胜扫地",
"Ｎ",
"Ｗ◇学会斗转，需要斗转觉醒",
"Ｗ◇斗转·无间轮：30%概率免疫伤害并反弹敌方（视为敌方自己攻击自己）",
"Ｗ◇以彼之道还施彼身：对招技能，无伤，并根据自身内力和敌方攻击威力情况反弹对方伤害",
"Ｗ◇（进阶斗转触发斗转武功反击时，不会再触发反击）",
"Ｎ",
"Ｚ特别说明：",    
"Ｗ◇自身系数之和/8>360必然触发离合参商，自身系数之和/8>550概率进化幻梦星辰",
"Ｗ◇根据自身系数概率进化斗转大招耀若星日（慕容龙城挨打必出）",
"Ｗ◇80资质以上且学会斗转，扫地线后如果资质不足可以获得大蟠桃X5、千年人参X5、地灵丹X1",                 --问题不断
"Ｎ",
"Ｄ组合效果：斗转星移 + 参合指",
"Ｗ◇慕·玄指为先 敌全体减集气200点，附加30-50点流血值，流血值附加内伤",
"Ｗ◇容·混气柔刚 以自身指法系数的50%附加伤害",
"Ｗ◇参·海运洞显 以自身现有内力值的1.5倍量削减敌内力值，伤害增加1.5倍",
"Ｗ◇合·日月济世 以自身30%最大内力值附加伤害",
"Ｗ◇以上效果慕容博学会参合指后即可触发，其他人物主运斗转即可触发",
}

--newkdef[119玉女剑法]=function()
ItemInfo[119]={
"Ｌ习得外功：玉女剑法",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：280",
"Ｗ武功范围：《 5格",
"Ｎ",
"Ｄ组合特效：全真剑法+玉女剑法+左右互搏",
"Ｗ连击率+30%,防守时触发<双剑合壁.守>，免疫破绽，免疫被杀气到-100以下",
"Ｎ",
"Ｄ组合特效：玉女剑法+主运玉女心经",
"Ｗ◇额外削减冰封程度的生命",
"Ｗ◇玉女素心·浪迹天涯：根据自身轻功的1/2增加伤害，每次增加5点内伤",
"Ｗ◇玉女素心·花前月下：根据自身剑系的1/2增加伤害，敌人处于盲目状态，攻击无误伤",
"Ｗ◇玉女素心·冷月窥人：附加冰封值50点，敌人附加冰封值1/5的冰冻状态，并附加冰冻扣血",
"Ｗ◇玉女素心·清饮小酌：伤害加300，如果敌人内伤大于50点就处于昏迷状态",
"Ｗ◇玉女素心·小园艺菊：根据敌方内力我方攻击力的1/30附加伤害，附加迟缓状态",
"Ｗ◇玉女素心·举案齐眉：当敌方怒气值到极的时候，消除10点怒气，附加混乱状态",
"Ｗ◇玉女剑法组合触发左右互搏时，伤害翻倍",
"Ｗ◇特殊人物：林朝英-使用玉女素心剑",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                         --问题不断
"Ｚ一脉相承：",
"Ｗ◇学习玉女素心剑一脉相承",
}

--newkdef[120倚天剑谱]=function()
ItemInfo[120]={
"Ｌ习得外功：倚天剑法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：210",
"Ｗ武功范围：《 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇200御剑以上时，剑法增加一次连击，暴怒必触发，攻击几率必流血，随着实战增加几率",
"Ｗ◇增加剑法威力200点，周芷若、灭绝增加300点",
"Ｗ◇附带灼烧",                                         --问题不断
}

--newkdef[121金蛇剑法]=function()
ItemInfo[121]={
"Ｌ习得外功：金蛇剑法",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：900",
"Ｗ内力消耗：210",
"Ｗ武功范围：米 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇附带灼烧",                                         --飘夜
}

--newkdef[122七星剑谱]=function()
ItemInfo[122]={
"Ｌ习得外功：全真剑法",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：800",
"Ｗ内力消耗：140",
"Ｗ武功范围：《 7格",
"Ｎ",
"Ｄ组合特效：全真剑法+玉女剑法+左右互搏",
"Ｗ◇连击率+30%,防守时触发<双剑合壁.守>，免疫破绽，免疫被杀气到-100以下",
"Ｗ◇使用全真剑法攻击范围+1",
"Ｎ",
"Ｄ组合特效：全真剑法+全真心法",
"Ｗ◇增伤777",
"Ｗ◇全真剑法·明河共影：增加等同于自身御剑的1/3、自身内力的17％数值的伤害，并对敌方附加「举火燎原」",
"Ｗ◇全真剑法·兰烬蕉暗：附加等同于敌方御剑的1/3、敌方内力的17％数值的伤害，并对敌方附加「昏迷状态」",
"Ｗ◇全真剑法·胡霜千里：附加等同于自身内力的17％、敌方内力的17％数值的伤害，并对全体敌方附加冰冻状态，若敌方冰冻状态较高，则额外附加冻结状态",
"Ｗ◇全真剑法组合+触发左右互搏时，伤害翻倍",
"Ｗ◇特殊人物：王重阳-无条件触发，丘处机-进全真教使用全真剑法，全真3级以上弟子-学会全真剑法",
"Ｎ",
"Ｄ组合特效：全真剑法+空明拳",
"Ｗ◇根据自身面板攻击力增伤，根据自身当前内力翻倍伤害",
"Ｗ◇全真剑法攻击范围增加",
"Ｗ◇九天之上·运转七星：根据现有内伤提高攻击，最高2倍，根据自身攻击力扣除全体内力值，并附加无明业火状态，几率提高  ",
"Ｎ",
"Ｄ组合特效：全真剑法+先天功",
"Ｗ◇增伤777",
"Ｗ◇全真剑气：自带7道全真剑气，每道剑气伤害300，杀气1250点，25时序恢复1道",
"Ｗ◇全真剑法增加「同归」的效果，并微幅增加伤害幅度",
"Ｗ◇附加等同于自身生命的77％、敌方生命的49％数值的伤害",
"Ｗ◇攻击时随机触发以下七星效果之一：",
"Ｗ◇  天枢贪狼：御剑值该回合临时成长1.5倍",
"Ｗ◇  天璇巨门：给自己附加15时序的坚甲状态。坚甲：防御力以1.5倍计算",
"Ｗ◇  天玑禄存：给自己15怒气，20～50的战意。若自身怒气在60以上，有45％的机率直接怒气爆发",
"Ｗ◇  天权文曲：攻击必冰封，并清除自身低级异常",
"Ｗ◇  玉衡廉贞：攻击后为自己增加200～1000点血量",
"Ｗ◇  开阳武曲：附加给自己15时序的「神兵状态」以及「天香续命」效果",
"Ｗ◇  瑶光破军：附加给敌方10时序的「霸王破甲」、2回合的「脆弱状态」",
"Ｗ◇特殊人物：王重阳-无条件触发",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",                                         --问题不断
"Ｚ一脉相承：",
"Ｗ◇学习玉女素心剑一脉相承",
}

--newkdef[123玉箫剑法]=function()
ItemInfo[123]={
"Ｌ习得外功：玉箫剑法",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：800",
"Ｗ内力消耗：140",
"Ｗ武功范围：《 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇桃花绝技：同时修炼弹指/落英/玉箫到极，三种武功威力+200",
"Ｗ◇桃花绝技：40%几率三连击，暴怒必出",
"Ｗ◇桃花绝技：弹指神通：必暴击，气攻+1500",
"Ｗ◇桃花绝技：落英神剑掌：攻击范围变为可移动，并根据敌方内力耗损量增加伤害",
"Ｗ◇桃花绝技：玉箫剑法：攻击距离提升至8格，有60%几率冰封",
"Ｗ◇修炼其中之一后，修炼其余两个的兵器值需求-10",
"Ｎ",
"Ｄ组合特效：玉箫剑法+持瑶琴",
"Ｗ◇琴箫和鸣·玉箫：攻击时我方恢复生命333点，体力3点",
"Ｎ",
"Ｄ组合特效：玉箫剑法+落英神剑掌",
"Ｗ◇攻击时附加15点流血值",
"Ｗ◇攻击时敌人内力小于3000点时，根据敌我内力差扣除敌人生命",
"Ｗ◇敌人集气紊乱10时序",
"Ｎ",
"Ｄ组合特效：玉箫剑法+碧海潮生",
"Ｗ◇碧海潮生曲·八音穿心：敌人在根据移动格数扣除的生命与内力，第一次攻击时自爆，自爆威力根据敌人的各种异常状态结算，最高720点真实伤害，自爆后解除当前八音穿心状态",
"Ｗ◇碧海潮生曲·次声震脉：对全体敌人附加内伤，并将内伤转化成流血状态并且扣除生命",
"Ｗ◇碧海潮生曲·阎魔蟋蟀：全场敌人附加3时序冻结，可叠加至15时序",
"Ｗ◇特殊人物：黄药师-学会玉箫剑法无条件",
"Ｎ",
"Ｚ特别说明：无",                                        --问题不断
}

--newkdef[124两仪剑谱]=function()
ItemInfo[124]={
"Ｌ习得外功：两仪剑法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：-",
"Ｗ内力消耗：105",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：两仪剑法+反两仪刀法",
"Ｗ◇两仪守护：两仪守护：被攻击几率减伤30%",
"Ｗ◇两仪守护：几率变两仪守护·极，减伤60%，减少1000气功 ",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高连击",                                         --问题不断
}

--newkdef[125柔云剑谱]=function()
ItemInfo[125]={
"Ｌ习得外功：柔云剑法",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：105",
"Ｗ武功范围：《 7格",
"Ｎ",
"Ｄ组合特效：柔云剑法+太极剑法",
"Ｗ◇被攻击时，有50%几率将被杀气量的一半转化为回血",
"Ｗ◇剑法攻击增加御剑/200范围，最高+2",
"Ｎ",
"Ｚ特别说明：无",                                         --问题不断
}

--newkdef[126雪山剑谱]=function()
ItemInfo[126]={
"Ｌ习得外功：雪山剑法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：600",
"Ｗ内力消耗：49",
"Ｗ武功范围：米 7格",
"Ｎ",
"Ｄ组合特效：雪山剑法+金乌刀法",
"Ｗ◇金乌映雪：造成灼烧、冰封互相追加；附加冰封值+灼烧值的伤害",
"Ｗ◇特殊人物：石破天-自带",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带冰封",            
"Ｗ◇天外连击时随机增加0.5-3倍原武功威力",                               --问题不断
}

--newkdef[127太岳三青峰]=function()
ItemInfo[127]={
"Ｌ习得外功：太岳三青峰",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：600",
"Ｗ内力消耗：49",
"Ｗ武功范围：《 6",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
"Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20 连击率+5%",
"Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
"Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
"Ｗ◇五岳剑法：暴怒必定发动",
"Ｗ◇五岳剑法：被攻击时如未护体几率发动“以剑御气”降低50%气攻",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高连击",                                                                        --飘夜
"Ｚ一脉相承：",
"Ｗ◇学习五岳神剑一脉相承，限定五岳派",
}

--newkdef[128万岳朝宗]=function()
ItemInfo[128]={
"Ｌ习得外功：万岳朝宗",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：70",
"Ｗ武功范围：《 6",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
"Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20 连击率+5%",
"Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
"Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
"Ｗ◇五岳剑法：暴怒必定发动",
"Ｗ◇五岳剑法：被攻击时如未护体几率发动“以剑御气”降低50%气攻",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高暴击",
"Ｗ◇附带冰封",                                                                        --飘夜
"Ｚ一脉相承：",
"Ｗ◇学习五岳神剑一脉相承，限定五岳派",
}

--newkdef[129云雾十三式]=function()
ItemInfo[129]={
"Ｌ习得外功：云雾十三式",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：600",
"Ｗ内力消耗：35",
"Ｗ武功范围：《 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
"Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20 连击率+5%",
"Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
"Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
"Ｗ◇五岳剑法：暴怒必定发动",
"Ｗ◇五岳剑法：被攻击时如未护体几率发动“以剑御气”降低50%气攻",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习五岳神剑一脉相承，限定五岳派",                                                                       --飘夜
}

--newkdef[130泰山十八盘]=function()
ItemInfo[130]={
"Ｌ习得外功：泰山十八盘",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：35",
"Ｗ武功范围：米 7格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
"Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20 连击率+5%",
"Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
"Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
"Ｗ◇五岳剑法：暴怒必定发动",
"Ｗ◇五岳剑法：被攻击时如未护体几率发动“以剑御气”降低50%气攻",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                                                       --飘夜
"Ｚ一脉相承：",
"Ｗ◇学习五岳神剑一脉相承，限定五岳派",
}

--newkdef[131万花剑法]=function()
ItemInfo[131]={
"Ｌ习得外功：万花剑法",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：500",
"Ｗ内力消耗：35",
"Ｗ武功范围：■ 6+7×7",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇五岳剑法：同时修炼五岳剑法（太岳/云雾/泰山/万花/万岳）",
"Ｗ◇五岳剑法：每修炼一门五岳剑法武功威力+100，御剑+20 连击率+5%",
"Ｗ◇五岳剑法：集齐五岳剑法，判定额外增加两门",
"Ｗ◇五岳剑法：使用五岳剑法攻击几率发动气贯五岳提升1000气攻，",
"Ｗ◇五岳剑法：暴怒必定发动",
"Ｗ◇五岳剑法：被攻击时如未护体几率发动“以剑御气”降低50%气攻",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习五岳神剑一脉相承，限定五岳派",                                                                      --飘夜
}

--newkdef[132三分剑术]=function()
ItemInfo[132]={
"Ｌ习得外功：三分剑法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：400",
"Ｗ内力消耗：9",
"Ｗ武功范围：《 7格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇素质三连：同时修炼三分剑法/连城剑法",
"Ｗ◇素质三连：暴怒时使用剑法必定三连击",
"Ｚ特别说明：",
"Ｗ◇高连击",                                         --飘夜
}

--newkdef[133雷震剑法]=function()
ItemInfo[133]={
"Ｌ习得外功：雷震剑法",
"Ｎ",
"Ｗ武功威力：110",
"Ｗ武功气攻：300",
"Ｗ内力消耗：7",
"Ｗ武功范围：《 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高暴击",                                         --飘夜
}

--newkdef[134松风剑法]=function()
ItemInfo[134]={
"Ｌ习得外功：松风剑法",
"Ｎ",
"Ｗ武功威力：140",
"Ｗ武功气攻：300",
"Ｗ内力消耗：4",
"Ｗ武功范围：《 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习狂风剑法一脉相承",                                        --飘夜
}

--newkdef[135火焰刀法]=function()
ItemInfo[135]={
"Ｌ习得外功：火焰刀法",
"Ｎ",
"Ｗ武功威力：650",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：350",
"Ｗ武功范围：△ 7格",
"Ｎ",
"Ｄ组合特效：火焰刀+金乌刀+燃木刀法",
"Ｗ◇举火燎原：攻击时，有50%几率追加10时序的引燃状态，暴怒必触发",
"Ｗ引燃状态下，每时序损失2%当前血量",
"Ｎ",
"Ｚ特别说明：",                                        --问题不断
"Ｗ◇可触发必须使用刀系武功才能触发的特效",
"Ｗ◇大轮密宗·火焰刀：使用火焰刀法攻击30%几率触发，刀主有二次判定（鸠摩智100%触发）",
"Ｗ◇大轮密宗·火焰刀：全场敌方受到内伤30点，且追加1000气攻",
"Ｗ◇附带灼烧",
"Ｗ◇天龙邪少林寺大战击败天龙三兄弟后，领悟火之高兴",
"Ｗ◇火之高兴：攻击几率或者暴怒必出，气功加1000，攻击无误伤，附加刀系伤害",

"Ｎ",
"Ｄ组合特效：火焰刀法+主运龙象般若功",
"Ｗ◇根据自身最大内力值和所剩内力值总和的1/40和敌人受伤、封穴程度来增加伤害",
"Ｗ◇攻击必触发以下特效其中之一",
"Ｗ◇火焰刀·凝集-将敌方集气杀至0，并强制封穴10~20点",
"Ｗ◇火焰刀·虚无缥缈-根据自身当前内力值和最大内力值来减少敌人集气，附加麻痹状态",
"Ｗ◇火焰刀·虚劲伤人-攻击触发9X9范围，9格内敌人根据灼烧程度损失生命、内力",
"Ｗ◇根据资质高低几率触发火焰气劲（30以上6~10层，30及以下1~5层）攻击火焰气劲敌人根据自身刀系增加伤害、气攻",
"Ｗ◇攻击敌人后会给敌人种下火焰刀气，效果同龙象气劲，最高10层",
"Ｗ◇火焰刀气：如果敌人身上有火焰刀气，则第一下攻击可以削减敌人生命",
"Ｗ◇特殊人物：鸠摩智-使用火焰刀法",
"Ｎ",
"Ｄ组合特效：火焰刀法+九阴白骨爪",
"Ｗ◇增伤500",
"Ｗ◇火焰刀可移动范围为6格，攻击范围根据拳系增加",
"Ｗ◇缥缈虚无·纯阳无极：敌全体附加满内伤、灼烧，根据内伤、灼烧总和扣除生命",
}

--newkdef[136胡家刀法]=function()
ItemInfo[136]={
"Ｌ习得外功：胡家刀法",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：210",
"Ｗ武功范围：井 5格",
"Ｎ",
"Ｄ组合特效：胡家刀法+主运飞天神行（刀法350不用主运）",
"Ｗ◇根据自身战意、真实刀法增伤",
"Ｗ◇基础效果：每次行动前机率执行蓄力、防御或休息三功能之一，并根据执行何种功能触发对应刀法。（可跟内功自带的蓄力、防御叠加，因此同时可能可以触发一种以上的刀法）",
"Ｗ◇若执行休息，则触发「胡刀·天生牙」效果：",
"Ｗ◇ 仁慈之刀：对于敌方血量低于100时，有固定15％的机率，伤害大幅衰减，但同时补充我方中量血内",
"Ｗ◇ 苍龙破：攻击时机率对自己叠加「苍龙破」状态，最高10层。苍龙破存在时，攻击机率为自己增加怒气，并提升每时序的战意提升机率与提升量",
"Ｗ◇  身上有苍龙破状态时，攻击有狱龙破状态的敌人，会附加「六大基础异常随机一项X狱龙破层数」的伤害",
"Ｗ◇  身上有苍龙破状态时，暴怒攻击将附加自身苍龙破层数乘以怒气值的伤害。若敌方身上有狱龙破则伤害再增加",
"Ｗ",
"Ｗ◇若执行防御，则触发「胡刀·丛云牙」特效：",
"Ｗ◇ 狱龙破：攻击时机率对敌方附加狱龙破，最高24层。敌方的防御力会根据狱龙破层数下降，最高下降72％",
"Ｗ◇  敌方身上有狱龙破状态时，被攻击会减少5-10点战意，机率被扣减10点怒气和被附加20点流血",
"Ｗ◇  敌方身上有狱龙破状态时，被打至怒气爆发实会被附加「五蕴炽盛」、头晕目眩、逆杀等debuff",
"Ｗ◇ 比良黄泉：敌方身上有狱龙破状态，被攻击致死时，有35％的机率会被魅惑并清除所有异常状态",
"Ｗ",
"Ｗ◇若执行蓄力，则触发「胡刀·铁碎牙」特效：",
"Ｗ◇ 风之伤：敌我双方内力、内力上限以一个波动值计算，伤害不增加，或小幅、或大幅增加",
"Ｗ◇ 被攻击时会储蓄伤害，储存之后，下回合以储存之伤害增加伤害",
"Ｗ◇ 铁碎牙 变：触发铁碎牙时，铁碎牙会附加以下三者状态其中之一：",
"Ｗ◇  甲.血玉碎牙：该次攻击吸血",
"Ｗ◇  乙.龙麟碎牙：该次攻击吸内，若敌方内力少于1％，有固定1/10的机率秒杀",
"Ｗ◇  丙.金刚碎牙：必破气防且不会触发大部分的减伤特效",
"Ｗ",
"Ｗ◇若战意爆发时：不管当下处于何种刀法，必定触发「斩刃冥道」效果：以苍龙破层数、狱龙破层数、自身三围计算伤害加成，并将伤害的1/10转化成真实伤害，并附加等同于敌方流血值的时序「撕裂」效果",
"Ｗ",
"Ｗ◇天下霸道三刀：以自身耍刀技巧以及战意数值增加伤害",
"Ｗ◇特殊人物：胡一刀-使用胡家刀法，胡斐-觉醒后使用胡家刀法",
"Ｎ",
"Ｚ特别说明：",                                        --问题不断
"Ｗ◇习得苗家剑法后，再学习胡家刀法的需求降低40点",
"Ｗ◇胡刀苗剑·归真合一：同时修炼胡家刀法与苗家剑法到极",
"Ｗ◇胡刀苗剑·归真合一：用其中一种武功攻击时几率触发",
"Ｗ◇胡刀苗剑·归真合一：攻击效果提升40%，追加1500气攻",
"Ｗ◇胡刀刀法·极意：限主角与胡斐胡一刀，用胡家刀法攻击时几率触发",
"Ｗ◇胡刀刀法·极意：攻击无误伤，攻击范围变为9X9，气攻提升至1500",
"Ｗ◇胡刀刀法·极意：暴怒时必触发",
}

--newkdef[137燃木刀法]=function()
ItemInfo[137]={
"Ｌ习得外功：燃木刀法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：900",
"Ｗ内力消耗：175",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇举火燎原：同时修炼金乌/燃木/火焰刀到极",
"Ｗ◇举火燎原：攻击时，有50%几率追加10时序的引燃状态，暴怒必触发",
"Ｗ            *引燃状态下，每时序损失2%当前血量",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇据当前加力内功提升攻击效果",
"Ｗ◇增加暴击率",
"Ｗ◇附带灼烧",                                         --飘夜
}

--newkdef[138玄虚刀法]=function()
ItemInfo[138]={
"Ｌ习得外功：玄虚刀法",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：-",
"Ｗ内力消耗：175",
"Ｗ武功范围：井 4格",
"Ｎ",
"Ｄ组合特效：玄虚刀法+纯阳无极",
"Ｗ◇根据自身面板轻功增伤",
"Ｗ◇纯阳玄虚·镜花水月：攻击时根据自身轻功、敌方内伤值附加伤害，每次攻击附加10层迟缓值",
"Ｗ◇纯阳玄虚·不定虚实：攻击时敌全体被附加10~20点流血，根据流血削减生命",
"Ｎ",
"Ｄ组合特效：玄虚刀法+神门十三剑",
"Ｗ◇炼神还虚：几率将吸收杀气转化为内力增加，并降低一半伤害",
"Ｗ◇特殊人物：张三丰-无条件，武当3级以上弟子-学会组合，用刀法可以带出",
"Ｎ",
"Ｚ特别说明：无",                                        --问题不断
}

--newkdef[139血刀经]=function()
ItemInfo[139]={
"Ｌ习得外功：血刀刀法",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：800",
"Ｗ内力消耗：140",
"Ｗ武功范围：井 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：", 
"Ｗ◇修炼后生命上限降低200",                                       --飘夜
}

--newkdef[140夫妻刀法]=function()
ItemInfo[140]={
"Ｌ习得外功：夫妻刀法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：140",
"Ｗ武功范围：△ 6格",
"Ｎ",
"Ｄ组合特效：鸳鸯刀法+夫妻刀法",
"Ｗ◇天衣无缝：使用任意刀法30%几率3连击",
"Ｗ◇天衣无缝：使用夫妻刀法or鸳鸯刀法必连击，增加500气功，伤害增加20%",
"Ｎ",
"Ｚ特别说明：无",
"Ｗ◇连击时伤害、气攻不会减少",
"Ｎ",
"Ｄ组合效果：夫妻刀法+冰火阴阳诀",
"Ｗ◇女貌郎才珠万斛 天教艳质为眷属：破气防、无视敌人20%防御",
"Ｗ◇清风引佩下瑶台 明月照妆成金屋：必冰封、根据敌人刀系的1/2恢复生命、内力",
"Ｗ◇刀光掩映孔雀屏 喜结丝萝在乔木：必灼烧、根据自身刀系的1/3增伤、削减内力",
"Ｗ◇英雄无双风流婿 却扇洞房燃花烛：增伤200，每次攻击附加5点内伤值，如果内伤大于50点触发昏迷状态 ",
"Ｗ◇碧箫声里双鸣凤 今朝有女颜如玉：增伤200，敌人流血值大于50附加点燃效果",
"Ｗ◇千金一刻庆良宵 占断人间天上福：根据敌我攻击力总和的1/6增加伤害",                                       --问题不断
}

--newkdef[141金乌刀法]=function()
ItemInfo[141]={
"Ｌ习得外功：金乌刀法",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：700",
"Ｗ内力消耗：105",
"Ｗ武功范围：△ 7格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇举火燎原：同时修炼金乌/燃木/火焰刀到极",
"Ｗ◇举火燎原：攻击时，有50%几率追加10时序的引燃状态，暴怒必触发",
"Ｗ            *引燃状态下，每时序损失2%当前血量",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇附带灼烧",                                         --问题不断

"Ｎ",
"Ｄ组合特效：金乌刀法+雪山剑法",
"Ｗ◇金乌映雪：造成灼烧、冰封互相追加；附加冰封值+灼烧值的伤害",
"Ｗ◇特殊人物：石破天-自带",
"Ｎ",
"Ｄ组合效果：金乌刀法+主运罗汉伏魔功or学会太玄神功",
"Ｗ◇金乌烈阳：攻击概率变为蓄力伤害",
"Ｗ◇使用金乌刀法必触发以其中一招：",
"Ｗ◇烈阳·开门揖盗：以自身所剩余内力增加杀气",
"Ｗ◇烈阳·梅雪逢夏：蓄力攻击时伤害提升300%",
"Ｗ◇烈阳·千钧压驼：追加杀气300点",
"Ｗ◇烈阳·大海沉沙：以自身内力值的150%附加伤害，敌人处于流血状态",
"Ｗ◇烈阳·赤日炎炎：以自身刀系的1/3附加伤害，根据敌人攻击力削减内力，并附加15点内伤值，当敌人内伤达到100点后强制150，并附加重度内伤、伤重不治",
"Ｗ◇特殊人物：石破天：觉醒后无条件触发",
}

--newkdef[142反两仪刀法]=function()
ItemInfo[142]={
"Ｌ习得外功：反两仪刀法",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：105",
"Ｗ武功范围：井 7格",
"Ｎ",
"Ｄ组合特效：两仪剑法+反两仪刀法",
"Ｗ◇两仪守护：两仪守护：被攻击几率减伤30%",
"Ｗ◇两仪守护：几率变两仪守护·极，减伤60%，减少1000气功 ",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                         --问题不断
}

--newkdef[143五虎断门刀]=function()
ItemInfo[143]={
"Ｌ习得外功：五虎断门刀",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：600",
"Ｗ内力消耗：70",
"Ｗ武功范围：井 5格",
"Ｎ",
"Ｄ组合特效：五虎断门刀+五虎棍法",
"Ｗ◇赞天虎：攻击时30%几率提升全队100集气",
"Ｗ◇彻地虎：被攻击时30%几率提高1000点气防",
"Ｗ◇穿山虎：攻击时30%几率增加100点伤害",
"Ｗ◇翻江虎：集气条30%几率跳跃10点集气速度",
"Ｗ◇锦毛虎：被攻击时30%几率反弹10%伤害",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高暴击",                                         --问题不断
}

--newkdef[144飞狐外传]=function()
ItemInfo[144]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[145雪山飞狐]=function()
ItemInfo[145]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[146连城诀]=function()
ItemInfo[146]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[147天龙八部]=function()
ItemInfo[147]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[148射雕英雄传]=function()
ItemInfo[148]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[149白马啸西风]=function()
ItemInfo[149]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[14千年灵芝]=function()
ItemInfo[14]={
"Ｌ物品说明：可增加人物体质",
"Ｎ",
"Ｄ使用效果：人物体质增加1点",
                                    -- by 飘夜
}

--newkdef[150鹿鼎记]=function()
ItemInfo[150]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[151笑傲江湖]=function()
ItemInfo[151]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[152书剑恩仇录]=function()
ItemInfo[152]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[153神雕侠侣]=function()
ItemInfo[153]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[154侠客行]=function()
ItemInfo[154]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[155倚天屠龙记]=function()
ItemInfo[155]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[156碧血剑]=function()
ItemInfo[156]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[157鸳鸯刀]=function()
ItemInfo[157]={
"Ｌ物品说明：十四天书之一",                                    -- by 飘夜
}

--newkdef[158修罗刀谱]=function()
ItemInfo[158]={
"Ｌ习得外功：修罗刀",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：70",
"Ｗ武功范围：△ 4格",
"Ｎ",
"Ｄ组合特效：修罗刀+沧溟刀",
"Ｗ◇利刃寒锋：利刃寒锋：攻击50%给敌人附加冻结状态（冻结状态下，无法集气，亦无法时序回复状态）",
"Ｎ",
"Ｄ组合特效：修罗刀+紫霞神功",
"Ｗ◇根据自身怒气值来提升伤害",
"Ｗ◇集气速度增加10点",
"Ｗ◇根据怒气值来增加杀气量,杀集气上限5000",
"Ｗ◇攻击人物越多怒气越高，闪避或者不破防的情况下无法增加怒气，怒气爆发计算为2次",
"Ｎ",
"Ｄ组合特效：修罗刀+天魔功",
"Ｗ◇根据自身最大生命值和所剩生命值总和的1/20来增加伤害",
"Ｗ◇集气速度增加10点",
"Ｗ◇根据怒气值来增加杀气量,杀集气上限5000",
"Ｗ◇根据怒气值来提升伤害，攻击人物越多怒气越高，闪避或者不破防的情况下无法增加怒气，怒气爆发计算为2次",
"Ｗ◇无妄成法：攻击几率触发必3连，如果攻击小于6连击则几率增加1连击",
"Ｗ◇鬼禅六断：攻击范围内根据伤害增加杀生证道值，根据杀生证道值触发以下特效，范围逐渐扩大；行动后根据自身道德增加杀生证道值，越低增加越多",
"Ｗ    3000以上梵鬼同悲-附加10时序精神错乱；根据敌人道德追加伤害，道德越低伤害越高",
"Ｗ    2000以上众相唯灭-减少集气位置，减少敌人战意，附加5点封穴",
"Ｗ    1500以上辅轮天葬-增加10~50点内伤，减少1~3倍内伤点数生命",
"Ｗ    1000以上屠印杀界-减少50~200生命；200~500内力",
"Ｗ    500以上神迷堕世-附加混乱状态、重度内伤",
"Ｗ◇密宗使用血刀or修罗刀or火焰刀+僧正级或以上，可以触发鬼禅六断",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高暴击",
"Ｗ◇附带冰封" ,                                        --问题不断
}

--newkdef[159奇门三才刀]=function()
ItemInfo[159]={
"Ｌ习得外功：奇门三才刀",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：600",
"Ｗ内力消耗：35",
"Ｗ武功范围：井 5格",
"Ｎ",
"Ｄ组合特效：奇门三才刀+万劫刀法",
"Ｗ◇万劫不复·深渊-攻击时增加伤害76点，灼烧、封穴、流血各8点，创伤状态",
"Ｎ",
"Ｄ组合特效：奇门三才刀+大剪刀",
"Ｗ◇根据自身面板耍刀系数增伤",
"Ｗ◇奇门五行·虚弱：根据敌我刀系总和扣除生命，被攻击者杀气、伤害减半20时序，怒气增加6点，重伤不治10时序",
"Ｗ◇奇门五行·碎骨：此次攻击必暴击，3倍暴击伤害",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",                                        --问题不断
}

--newkdef[160慈悲刀法]=function()
ItemInfo[160]={
"Ｌ习得外功：慈悲刀法",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：600",
"Ｗ内力消耗：35",
"Ｗ武功范围：△ 7格",
"Ｎ",
"Ｄ组合特效：慈悲刀法+大慈大悲手",
"Ｗ◇慈悲为怀：道德高于60时，60%减伤品德*6的伤害",
"Ｎ",
"Ｄ组合特效：慈悲刀法+大智无定指",
"Ｗ◇根据自身内力/20增伤",
"Ｗ◇龙树菩提·大智大慧：攻击回合结束后根据自身所剩内力的15%恢复生命，内力越高恢复越高",
"Ｗ◇龙树菩萨·慈悲：攻击必触发封穴，几率增加3层麻痹值",
"Ｗ◇龙树菩萨·大智：攻击必触发内伤，几率集气停止15时序",
"Ｗ◇其他效果可根据自身道德值增加触发几率，道德越高几率越高，最高为60%",
"Ｚ特别说明：",
"Ｗ◇高连击",                                         --问题不断
}

--newkdef[161狂风刀法]=function()
ItemInfo[161]={
"Ｌ习得外功：狂风刀法",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：700",
"Ｗ内力消耗：21",
"Ｗ武功范围：米 6格",
"Ｎ",
"Ｄ组合特效：狂风刀法+黄沙万里鞭",
"Ｗ◇你是风儿我是沙：伤害增加30%，必定追加一次组合武功，攻击范围按照先使用的武学基础范围计算，使用对应武学可以带出相应的组",
"Ｗ◇你是风儿我是沙：攻击几率万里风沙，回气150",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高连击",                                         --问题不断
"Ｎ",
"Ｄ组合效果：狂风刀法+混元功",
"Ｗ◇根据自身刀系的1/6增加伤害，每次攻击附加内伤10，生命减75，内力减100，体力减1",
"Ｗ◇狂风刀法·风雨交加：攻击触发6X6范围攻击，气功加1000点，在根据自身刀系的3倍附加杀气 ",
"Ｗ◇狂风刀法·斩：攻击破防，根据敌我内力差来增加杀气量，额外增加内伤20点，持续流血20时序，如果流血值超过30点以50点计算",
"Ｗ◇狂风刀法·破：根据自身内力来增加杀气",
"Ｗ◇特殊人物：田伯光-使用狂风刀法",
"Ｎ",
"Ｄ组合特效：黄沙万里鞭+狂风刀法+主运天罗地网",
"Ｗ◇黄天无极·氤氤氲氲：进场后蓄积天地之气上限120，时序增加天地之气，跟随天地之气增加自身伤害攻击、防御、集气、战意积蓄速度，天地之气大于50，攻击可以触发兽法相；天地之气大于70，攻击可以触发自然流",
"Ｗ",
"Ｗ◇黄天无极·诡变巧异：天地之气大于100的时候，开始持续吸收敌人的生命与体力，吸收程度与天地之气层数有关",
"Ｗ◇黄天无极·兽法相:",
"Ｗ  黄天无极·响蛇鸣：根据自身轻功附加伤害，并附加“割裂效果”，敌人移动后损失生命内力",
"Ｗ  黄天无极·蝎尾针：根据自身防御附加伤害，并附加“霸王破甲”，一定时序内，敌方护甲和气防降低一半",
"Ｗ  黄天无极·沙蜥噬：根据自身攻击附加伤害，并附加“禁疗”",
"Ｗ◇黄天无极·自然流:",
"Ｗ  黄天无极·风掠境：攻击附加自身轻功值/10的真实伤害，并附加“创伤”",
"Ｗ  黄天无极·沙弥漫：攻击附加流血状态，根据流血扣减体力，并附加“力竭”一定时序内敌方体力不会增长，并根据体力缺失流失生命",
"Ｗ  黄天无极·水枯竭：攻击附加灼烧状态，根据灼烧扣减内力，并附加“引燃”“无明业火”",
"Ｄ配套插件：混元功",
"Ｗ◇狂沙漫天·妖风祸世：进场后三围及五系按照敌方最高属性计算，为敌方附加以下debuff：攻击后概率落空，概率被附加混乱，判定几率降低，集气速度概率降低",
}

--newkdef[162鸳鸯刀法]=function()
ItemInfo[162]={
"Ｌ习得外功：鸳鸯刀法",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：21",
"Ｗ武功范围：井 6格",
"Ｎ",
"Ｄ组合特效：鸳鸯刀法+夫妻刀法",
"Ｗ◇天衣无缝：使用任意刀法30%几率3连击",
"Ｗ◇天衣无缝：使用夫妻刀法or鸳鸯刀法必连击，增加500气功，伤害增加20%",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                        --问题不断
}

--newkdef[163南山刀谱]=function()
ItemInfo[163]={
"Ｌ习得外功：南山刀法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：600",
"Ｗ内力消耗：14",
"Ｗ武功范围：△ 7格",
"Ｎ",
"Ｄ组合特效：南山刀法+黄沙万里鞭",
"Ｗ◇首次攻击时如果命中，则追加一次攻击",
"Ｗ◇攻击必暴击，暴击时伤害增加1.5倍",
"Ｗ◇南山樵子·燕子入朝：攻击时根据气攻的25%增加伤害，气攻提高2倍",
"Ｗ◇南山樵子·燕子离巢：攻击时敌人每次增加5点内伤，根据内伤增加基础伤害",
"Ｎ",
"Ｚ特别说明：无",                                        --问题不断
}

--newkdef[164鬼头刀法]=function()
ItemInfo[164]={
"Ｌ习得外功：鬼头刀法",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：600",
"Ｗ内力消耗：14",
"Ｗ武功范围：井 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                        --飘夜
}

--newkdef[165万劫刀法]=function()
ItemInfo[165]={
"Ｌ习得外功：万劫刀法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：-",
"Ｗ内力消耗：7",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：万劫刀法+奇门三才刀",
"Ｗ◇万劫不复·沉沦：攻击时增加伤害90点，内伤、中毒、冰封各8点，无明业火状态",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习修罗刀一脉相承",                                         --问题不断
}

--newkdef[166柴刀十八路]=function()
ItemInfo[166]={
"Ｌ习得外功：柴刀十八路",
"Ｎ",
"Ｗ武功威力：140",
"Ｗ武功气攻：500",
"Ｗ内力消耗：7",
"Ｗ武功范围：井 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习庖丁解牛刀一脉相承",                                     --问题不断
}

--newkdef[167打狗棒法]=function()
ItemInfo[167]={
"Ｌ习得外功：打狗棒法",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1400",
"Ｗ内力消耗：70",
"Ｗ武功范围：米 3格",
"Ｎ",
"Ｄ招式特效：（实际奇门系数/14，最大30%；奇门主和洪七/10，最大50%；主运擒龙功增加10%；装备打狗棒额外增加10%）攻击时任意触发以下其中一招：",
"Ｗ◇绊字决：降低敌人集气，使敌人陷入麻痹状态小概率无法行动",
"Ｗ◇封字决：封印敌人攻击、移动8时序",
"Ｗ◇转字决：连击小于3时必3连击，大于3时加1连击",
"Ｗ◇缠字决：缠绕住场上所有敌人，使敌人的集气不大于自己，持续1回合，cd1回合",
"Ｗ◇挑字决：无视敌方60%防御",
"Ｗ◇戳字决：必定封穴，封穴+10，40%概率造成刺目",
"Ｗ◇打狗棒至高绝学·天下无狗：攻击范围变为面攻，气攻提升1000招式",
"Ｗ◇天赋-傲世神罡：必出打狗招式",
"Ｎ",
"Ｄ组合特效：主运擒龙功后，打狗招式进化",
"Ｗ◇额外损失敌人300生命，为敌人附加疯魔状态",
"Ｗ◇打狗棒法·挑字诀：强制封穴10点",
"Ｗ◇打狗棒法·封字诀：伤害加倍，额外增加杀气值，根据敌方所剩体力附加内伤",
"Ｗ◇打狗棒法·戳字诀：攻击无误伤，敌人处于刺目状态",
"Ｗ◇打狗棒法·缠字诀：强制杀气50~100点",
"Ｗ◇打狗棒法·绊字诀：攻击后为全场敌人附加洞火状态",
"Ｗ◇打狗棒法·转字决：本次攻击回合内，免疫封穴、内伤、中毒",
"Ｗ◇打狗棒最高绝学·天下无狗：攻击后强制扣除敌方全员的1600生命、2000内力",
"Ｗ◇特殊人物：乔峰、洪七公-使用打狗棒法",
"Ｎ",
"Ｄ组合特效：降龙十八掌+打狗棒法",
"Ｗ◇丐世无双：被攻击50%绝对气防，免疫本次攻击内伤",
"Ｗ◇丐世无双：使用降龙或者打狗攻击后，触发另一个武功的追击效果，最多追加1次（一次降龙一次打狗，可以触发连击特效）",
"Ｎ",
"Ｚ特别说明：无",                      --问题不断
"Ｗ◇习得降龙十八掌后，再学习打狗棒法的需求降低40点",
}

--newkdef[168伏魔杖法]=function()
ItemInfo[168]={
"Ｌ习得外功：伏魔杖法",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：210",
"Ｗ武功范围：田 5格",
"Ｎ",
"Ｄ组合特效：伏魔杖法+罗汉伏魔功",
"Ｗ◇攻击根据自身特系兵器值的为附加伤害",
"Ｗ◇伏魔杖法·大鹏展翅：攻击触发全屏麻痹状态",
"Ｗ◇伏魔杖法·秦王鞭石：攻击触发6X6范围攻击，必封穴、流血、冰封、灼烧",
"Ｗ◇伏魔杖法·罗汉护法：当自身怒气大于0时，以自身所剩内力的5%X怒气为基础触发杀气及伤害；当怒气爆发时，所有攻击提升20%，必杀气",
"Ｗ◇伏魔杖法·拨云见日：自身怒气最低为30，攻击增加怒气8点，怒气增长为双倍",
"Ｗ◇世尊降魔：暴击率增加50%，攻击时40%几率触发，暴怒必触发：攻击增加气功/2的伤害（暴怒时为气功X0.8），造成伤害如果小于100则额外增加100",
"Ｗ◇增加伏魔杖法威力200点，根据自身怒气值概率增加连击次数",
"Ｗ◇特殊人物：达摩-自带效果",
"Ｎ",
"Ｄ组合特效：降魔刀法+伏魔杖法",
"Ｗ◇时序增加怒气值2点",
"Ｗ◇时序恢复，根据自身刀系恢复生命，自身特系恢复内力",
"Ｗ◇破防增加",
"Ｗ◇特殊人物：玄澄、达摩-自带",
"Ｎ",
"Ｚ特别说明：无",                                      
}

--newkdef[169倚天屠龙功]=function()
ItemInfo[169]={
"Ｌ习得外功：倚天屠龙功",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：63",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
"Ｗ◇琴棋书画·秉笔直书：攻击必定造成封穴，",
"Ｗ◇琴棋书画·秉笔直书：且伤害提升20%几率发动",
"Ｎ",
"Ｄ组合特效：倚天屠龙功+纯阳无极功",
"Ｗ◇攻击翻倍",
"Ｗ◇武林至尊·宝刀屠龙：攻击时附加10点内伤值，内伤值大于30点敌人进入昏迷状态，附加20点流血值",
"Ｗ◇号令天下·莫敢不从：攻击时附加10点灼烧值，灼烧值大于30点敌人进入刺目装填，附加20点冰封值",
"Ｗ◇倚天不出·谁与争锋：攻击时附加10点封穴值，封穴值大于20点敌人进入锁足状态，附加迟缓值2-5层",
"Ｗ◇特殊人物：张三丰-使用倚天屠龙功，柳如絮-自带",
"Ｎ",
"Ｄ组合特效：倚天屠龙功+主运太极神功",
"Ｗ◇根据攻击者自身的内力值之差附加攻击力",
"Ｗ◇尺蠖之屈·狡兔之脱：附加无明业火状态20时序",
"Ｗ◇淋漓酣畅·雄浑刚健：被攻击者根据自身内力值之差进入时序消耗生命状态，持续20时序",
"Ｗ◇特殊人物：张三丰-使用倚天屠龙功，柳如絮-自带",
"Ｎ",
"Ｚ特别说明：无",                                         --问题不断
}

--newkdef[170无上大力杵]=function()
ItemInfo[170]={
"Ｌ习得外功：无上大力杵",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：350",
"Ｗ武功范围：■ 5+5×5",
"Ｎ",
"Ｄ组合特效：罗汉伏魔功+无上大力杵",
"Ｗ◇世尊降魔：暴击几率增加50%，攻击时40%几率触发，暴怒必触发：攻击增加气功/20的伤害（暴怒时为气功/15），造成伤害如果小于100则增加100",
"Ｎ",
"Ｄ组合特效：主运龙象般若功+无上大力杵",
"Ｗ◇攻击根据敌我三围差增加伤害，暴击几率大幅度增加",
"Ｗ◇大力法相·力贯三千：攻击时进入蓄力状态（不会触发高级蓄力）",
"Ｗ◇一大三千·大力真禅：攻击附加大量气攻（侵略如火），8X8格范围攻击",
"Ｗ◇一大三千·神威世界：集气停止15时序并附加点燃状态",
"Ｗ◇特殊人物：金轮-自带效果",
"Ｎ",
"Ｚ特别说明：", 
"Ｗ◇附带灼烧",                                     --问题不断
}

--newkdef[171金刚伏魔圈]=function()
ItemInfo[171]={
"Ｌ习得外功：金刚伏魔圈",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：56",
"Ｗ武功范围：田 3格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇金刚伏魔阵：战场上队伍里同时修炼金刚伏魔圈2人以上",
"Ｗ◇金刚伏魔圈护体：2人，提升15%防御且气防+500",
"Ｗ◇真·金刚伏魔圈护体：2+人，提升30%防御且气防+1000",
"Ｎ",
"Ｄ世尊降魔(组合特效)：",
"Ｗ◇修炼<罗汉伏魔功>后领悟“世尊降魔”",
"Ｗ◇效果：暴击率增加50%",
"Ｗ *如果造成的伤害<300,则伤害等于300，暴怒追加一定气攻伤害",
"Ｗ *如果造成的伤害>300则追加少量气攻值伤害暴怒则追加大量气攻值伤害",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带灼烧",                                         --飘夜
}

--newkdef[172妙笔丹青]=function()
ItemInfo[172]={
"Ｌ习得外功：妙笔丹青",
"Ｎ",
"Ｗ武功威力：444",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：56",
"Ｗ武功范围：◇ 4格",
"Ｎ",
"Ｄ组合特效：妙笔丹青+一阳指",
"Ｗ◇削减生命300",
"Ｗ◇攻击变为可移动，范围6格",
"Ｗ◇六门绝技·二龙争珠：敌全体减少内力300点，内力归零时每次200生命替代",
"Ｗ◇六门绝技·双龙出海：根据自身特系扣除生命值，附加无明业火状态",
"Ｗ◇特殊人物：柳如絮-自带",
"Ｎ",
"Ｄ组合特效：持瑶琴+棋盘招式+倚天屠龙功+妙笔丹青",
"Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
"Ｗ◇琴棋书画·画地为牢：使妙笔丹青攻击附带冰封，高几率发动",
"Ｗ◇琴棋书画·江山如画：大幅提升妙笔丹青冰封效果，几率发动",
"Ｎ",
"Ｚ特别说明：无"                                         --问题不断
}

--newkdef[173黄沙万里鞭]=function()
ItemInfo[173]={
"Ｌ习得外功：黄沙万里鞭",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：600",
"Ｗ内力消耗：49",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：天罗地网+玄武真功+黄沙万里鞭",
"Ｗ◇天地玄黄·天：被攻击10%概率反弹伤害给对面",
"Ｗ◇天地玄黄·地：被攻击10%概率将伤害降低为0点",
"Ｗ◇天地玄黄·玄：被攻击10%概率吸收伤害的1/4回复生命",
"Ｗ◇天地玄黄·黄：被攻击10%概率吸收一半的伤害增加内力",
"Ｎ",
"Ｄ组合特效：狂风刀法+黄沙万里鞭",
"Ｗ◇你是风儿我是沙：伤害增加30%，必定追加一次组合武功，攻击范围按照先使用的武学基础范围计算，使用对应武学可以带出相应的组",
"Ｗ◇你是风儿我是沙：攻击几率万里风沙，回气150",
"Ｎ",
"Ｄ组合特效：黄沙万里鞭+南山刀法",
"Ｗ◇根据敌人流血值增伤，首次攻击命中敌人时，追加2次攻击",
"Ｗ◇黄沙万里·风沙漫天：攻击时敌人处于刺目状态",
"Ｗ◇黄沙万里·飞沙扬砾：每次攻击敌人增加7点流血，根据现有的2倍流血扣除生命",
"Ｎ",
"Ｄ组合特效：黄沙万里鞭+狂风刀法+主运天罗地网",
"Ｗ◇黄天无极·氤氤氲氲：进场后蓄积天地之气上限120，时序增加天地之气，跟随天地之气增加自身伤害攻击、防御、集气、战意积蓄速度，天地之气大于50，攻击可以触发兽法相；天地之气大于70，攻击可以触发自然流",
"Ｗ",
"Ｗ◇黄天无极·诡变巧异：天地之气大于100的时候，开始持续吸收敌人的生命与体力，吸收程度与天地之气层数有关",
"Ｗ◇黄天无极·兽法相:",
"Ｗ  黄天无极·响蛇鸣：根据自身轻功附加伤害，并附加“割裂效果”，敌人移动后损失生命内力",
"Ｗ  黄天无极·蝎尾针：根据自身防御附加伤害，并附加“霸王破甲”，一定时序内，敌方护甲和气防降低一半",
"Ｗ  黄天无极·沙蜥噬：根据自身攻击附加伤害，并附加“禁疗”",
"Ｗ◇黄天无极·自然流:",
"Ｗ  黄天无极·风掠境：攻击附加自身轻功值/10的真实伤害，并附加“创伤”",
"Ｗ  黄天无极·沙弥漫：攻击附加流血状态，根据流血扣减体力，并附加“力竭”一定时序内敌方体力不会增长，并根据体力缺失流失生命",
"Ｗ  黄天无极·水枯竭：攻击附加灼烧状态，根据灼烧扣减内力，并附加“引燃”“无明业火”",
"Ｄ配套插件：混元功",
"Ｗ◇狂沙漫天·妖风祸世：进场后三围及五系按照敌方最高属性计算，为敌方附加以下debuff：攻击后概率落空，概率被附加混乱，判定几率降低，集气速度概率降低",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇附带灼烧",                                         --飘夜
}

--newkdef[174银两]=function()
ItemInfo[174]={
"Ｌ物品说明：有钱能使鬼推磨",                                        --飘夜
}

--newkdef[175银索金铃]=function()
ItemInfo[175]={
"Ｌ习得外功：银索金铃",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：900",
"Ｗ内力消耗：49",
"Ｗ武功范围：■ 4+5×5",
"Ｎ",
"Ｄ组合特效：银索金铃+五毒神掌",
"Ｗ◇额外损失敌人冰封值的生命",
"Ｗ◇银索金铃·天罗：攻击增加25点冰封值，根据2倍冰封值扣除生命，刺目一回合",
"Ｗ◇银索金铃·地网：攻击提升200%，三连击，锁足一回合",
"Ｎ",
"Ｄ组合特效：渔叟钓法+银索金铃",
"Ｗ◇铁锁横江：自身范围1格内20%几率免受伤害（除空挥外免疫一切伤害气功和特效）",                                      
"Ｗ◇轻功暗香疏影：额外增加10%概率", 
"Ｗ◇特殊人物：戚长发-自带概率额外增加20%", 
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                 
}

--newkdef[176阴阳倒乱刃]=function()
ItemInfo[176]={
"Ｌ习得外功：阴阳倒乱刃",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：600",
"Ｗ内力消耗：36",
"Ｗ武功范围：◇ 3格",
"Ｎ",
"Ｄ组合特效：阴阳倒乱刃+铁布衫",
"Ｗ◇必定触发刀剑绝技：范围攻击、根据自身刀、剑系数增加伤害",
"Ｗ◇当未学有左右互搏时，独立享受30%的互搏几率；学有左右互搏则几率加10%",
"Ｗ◇当触发左右互搏时，根据「先刀后剑」或「先剑后刀」来决定效果：",
"Ｗ◇第一次互搏根据最后使用的武功，记录对应武学",
"Ｗ◇任意刀法、剑法",
"Ｗ◇刀剑顺行·黑剑真剑：攻击根据敌方攻击力额外增加伤害",
"Ｗ◇刀剑逆转·黑剑伪剑:攻击不触发反弹并扣除一定内力",
"Ｗ◇刀剑顺行·金刀为刀:攻击根据敌方防御力额外增加伤害",
"Ｗ◇刀剑逆转·金刀非刀:全屏攻击",
"Ｚ◇限定左右互搏真谛触发的第二次互搏",
"Ｗ◇先刀后剑",
"Ｗ◇阳刃化刀·渔网阵:附加锁足、二回合的脆弱状态害",
"Ｗ◇阳刃化刀·烈阳舞:附加10点灼烧值，以及30时序的无明业火",
"Ｗ◇阳刃化刀·一文字:必封穴、额外增加300点杀气、敌方防御下降20%",
"Ｗ◇先剑后刀",
"Ｗ◇阴刃化剑·枣核钉:攻击根据暗器增加额外伤害，攻击结束后增加3-5点暗器值",
"Ｗ◇阴刃化剑·霜雪扬:对敌人附加冰冻、冻结状态并在冰冻状态中会持续掉血",
"Ｗ◇阴刃化剑·天丛云:对敌方附加恐惧一回合、剧毒20时序并自身回复血内",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇特殊人物：NPC公孙止-可以使用阴阳倒乱刃攻击触发特效",
"Ｗ◇高连击",                                         --问题不断
}

--newkdef[177渔叟钓法]=function()
ItemInfo[177]={
"Ｌ习得外功：渔叟钓法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：-",
"Ｗ内力消耗：42",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：渔叟钓法+毒龙鞭法",
"Ｗ◇增伤200",
"Ｗ◇任凭风浪起·稳坐钓鱼船：敌人必无法移动",
"Ｗ◇姜太公钓鱼·愿者上钩：7点中毒值，敌人中毒值超过35点时无法进行攻击",
"Ｎ",
"Ｄ组合特效：渔叟钓法+银索金铃",
"Ｗ◇铁锁横江：自身范围1格内20%几率免受伤害（除空挥外免疫一切伤害气功和特效）",                                      
"Ｗ◇轻功暗香疏影：额外增加10%概率", 
"Ｗ◇特殊人物：戚长发-自带概率额外增加20%", 
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                           --问题不断
}

--newkdef[178大剪刀刀法]=function()
ItemInfo[178]={
"Ｌ习得外功：大剪刀",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：800",
"Ｗ内力消耗：0",
"Ｗ武功范围：田 3格",
"Ｎ",
"Ｄ组合特效：大剪刀+奇门三才刀",
"Ｗ◇根据敌人封穴增伤",
"Ｗ◇疾风鳄嘴·粉碎：攻击时附加20点封穴值，根据4倍封穴值增加伤害，无法攻击1回合",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高暴击",                                         --问题不断
}

--newkdef[179鹤蛇八打]=function()
ItemInfo[179]={
"Ｌ习得外功：鹤蛇八打",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：700",
"Ｗ内力消耗：35",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇附带冰封、中毒（20）",                                         --飘夜
}


--newkdef[180持瑶琴]=function()
ItemInfo[180]={
"Ｌ习得外功：持瑶琴",
"Ｎ",
"Ｗ武功威力：333",
"Ｗ武功气攻：-",
"Ｗ内力消耗：28",
"Ｗ武功范围：■ 5+9×9",
"Ｎ",
"Ｄ组合特效：持瑶琴+棋盘招式+倚天屠龙功+妙笔丹青",
"Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
"Ｗ◇琴棋书画·琴音悦耳：攻击不造成怒气，100%发动",
"Ｗ◇琴棋书画·菩提清心：使敌方怒气减半，几率发动",
"Ｎ",
"Ｄ组合特效：持瑶琴+玉箫剑法",
"Ｗ◇琴箫和鸣·古琴：攻击时我方恢复内力333点，减少内伤3点",
"Ｎ",
"Ｄ组合特效：持瑶琴+独孤九剑",
"Ｗ◇被攻击时概率增加御剑值最高到上限",
"Ｗ◇特殊人物：任盈盈-使用持瑶琴，柳如絮-自带",
"Ｎ",
"Ｄ组合特效：持瑶琴+吸星大法",
"Ｗ◇增伤200",
"Ｗ◇天下风云出我辈·一入江湖岁月催：敌全体被封穴10~15点",
"Ｗ◇王图霸业谈笑中·不胜人生一场醉：我方所有人物恢复生命300点，内力400点，体力5点",
"Ｗ◇特殊人物：任盈盈-使用持瑶琴，柳如絮-自带",
"Ｎ",
"Ｚ特别说明：",                                         --问题不断
"Ｗ◇习得独孤九剑后，再学习持瑶琴的需求降低40点"
}

--newkdef[181棋盘招式]=function()
ItemInfo[181]={
"Ｌ习得外功：棋盘招式",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：28",
"Ｗ武功范围：田 3格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇琴棋书画：需同时修炼琴棋书画，威力提升300",
"Ｗ◇琴棋书画·棋高一着：追加1200气攻，100%发动",
"Ｗ◇琴棋书画·星罗棋布：额外提升1000气攻，几率发动",
"Ｎ",
"Ｚ特别说明：无",                                         --飘夜
}

--newkdef[182罗盘]=function()
ItemInfo[182]={
"Ｌ物品说明：显示坐标",                                    -- by 飘夜
}

--newkdef[183裴将军帖]=function()
ItemInfo[183]={
"Ｌ习得外功：裴将军帖",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：14",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇附带冰封",                                         --飘夜
}

--newkdef[184中平枪法]=function()
ItemInfo[184]={
"Ｌ习得外功：中平枪法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：600",
"Ｗ内力消耗：14",
"Ｗ武功范围：田 4格",
"Ｎ",
"Ｄ组合特效：杨家/中平/呼延/岳家枪法（其中之一）+特系数350以上，完成夜雨楼击杀豪侠的任务（无论是不是夜雨楼杀手），南子传授",
"Ｗ◇燎原百击(以杨家枪、呼延枪、中平枪或岳家枪法攻击",
"Ｗ◇二十针：",
"Ｗ◇攻击敌方时，根据敌方灼烧值附加封穴，并在敌方体内埋下「燎原枪焰」",
"Ｗ◇燎原枪焰：当身有燎原枪焰的敌人封穴值为0时，枪焰爆发，附加集气紊乱、点燃并根据当前灼烧值靠除血量",
"Ｗ◇当敌方封穴值大于等于灼烧值时：直接根据敌方封穴值扣减集气，并降低气防。满怒气时必定破防",
"Ｗ◇当敌方灼烧值大于等于封穴值时：根据灼烧值附加内伤，机率附加重度内伤",
"Ｗ◇三十击:",
"Ｗ◇无定击：第一击时触发，自身八格内敌人遭受一定程度的真实伤害，并提升自身战意",
"Ｗ◇雨暴风狂：强行降低敌方战意，并依据敌我战意差计算机率，使敌方进入恐惧、虚弱状态",
"Ｗ◇迭浪千重：根据自身内力和连击数增加伤害。战意爆发时触发破甲效果",
"Ｗ◇威凌天下：自身怒气满时触发，第一击时为全屏攻击，并为自身加一层九阳气罩",
"Ｗ◇五十式:",
"Ｗ◇斜挑式：此次攻击必定命中破绽",
"Ｗ◇横扫式：此次攻击变为极意攻击，并必定暴击",
"Ｗ◇格勾式：此次攻击特系数以6666计算",
"Ｗ◇无枪式：蓄力后攻击时机率触发必中，并发挥空挥效果，根据自身灼烧对全场敌方扣除血量、体力",
"Ｗ◇主运极阴无相并极阴无相到极的特殊效果：燎原冷焰",
"Ｗ◇比较敌方冰封值和灼烧值，以高者为准，使二者相等",
"Ｗ◇敌方处于冰冻状态时上点燃、敌方处于点燃状态时上冰冻",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇必连击",
"Ｗ◇附带灼烧",                                         --问题不断
}

--newkdef[185毒龙鞭法]=function()
ItemInfo[185]={
"Ｌ习得外功：毒龙鞭法",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：-",
"Ｗ内力消耗：14",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带冰封、中毒（10）",                                         --飘夜
}

--newkdef[186杨家枪]=function()
ItemInfo[186]={
"Ｌ习得外功：杨家枪法",
"Ｎ",
"Ｗ武功威力：140",
"Ｗ武功气攻：500",
"Ｗ内力消耗：7",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：杨家/中平/呼延/岳家枪法（其中之一）+特系数350以上，完成夜雨楼击杀豪侠的任务（无论是不是夜雨楼杀手），南子传授",
"Ｗ◇燎原百击(以杨家枪、呼延枪、中平枪或岳家枪法攻击",
"Ｗ◇二十针：",
"Ｗ◇攻击敌方时，根据敌方灼烧值附加封穴，并在敌方体内埋下「燎原枪焰」",
"Ｗ◇燎原枪焰：当身有燎原枪焰的敌人封穴值为0时，枪焰爆发，附加集气紊乱、点燃并根据当前灼烧值靠除血量",
"Ｗ◇当敌方封穴值大于等于灼烧值时：直接根据敌方封穴值扣减集气，并降低气防。满怒气时必定破防",
"Ｗ◇当敌方灼烧值大于等于封穴值时：根据灼烧值附加内伤，机率附加重度内伤",
"Ｗ◇三十击:",
"Ｗ◇无定击：第一击时触发，自身八格内敌人遭受一定程度的真实伤害，并提升自身战意",
"Ｗ◇雨暴风狂：强行降低敌方战意，并依据敌我战意差计算机率，使敌方进入恐惧、虚弱状态",
"Ｗ◇迭浪千重：根据自身内力和连击数增加伤害。战意爆发时触发破甲效果",
"Ｗ◇威凌天下：自身怒气满时触发，第一击时为全屏攻击，并为自身加一层九阳气罩",
"Ｗ◇五十式:",
"Ｗ◇斜挑式：此次攻击必定命中破绽",
"Ｗ◇横扫式：此次攻击变为极意攻击，并必定暴击",
"Ｗ◇格勾式：此次攻击特系数以6666计算",
"Ｗ◇无枪式：蓄力后攻击时机率触发必中，并发挥空挥效果，根据自身灼烧对全场敌方扣除血量、体力",
"Ｗ◇主运极阴无相并极阴无相到极的特殊效果：燎原冷焰",
"Ｗ◇比较敌方冰封值和灼烧值，以高者为准，使二者相等",
"Ｗ◇敌方处于冰冻状态时上点燃、敌方处于点燃状态时上冰冻",
"Ｎ",
"Ｚ特别说明：", 
"Ｗ◇增加暴连击率",                                         --问题不断
"Ｚ一脉相承：",
"Ｗ◇学习岳家枪法一脉相承",  
}

--newkdef[187子午针灸经]=function()
ItemInfo[187]={
"Ｌ消耗药材获得药品：九转熊蛇丸",                                         --问题不断
"Ｗ◇主动效果（主动释放医术，快捷键F，对应单位会获得增益）",
"Ｗ◇使用针灸激发自身能力，下回合行动前战意爆发，进入神兵状态10时序。",
}

--newkdef[188华佗内昭图]=function()
ItemInfo[188]={
"Ｌ消耗药材获得药品：无常丹、九花玉露丸",                                         --问题不断
"Ｗ◇主动效果（主动释放医术，快捷键F，对应单位会获得增益）",
"Ｗ◇抵挡一次攻击造成的致命伤害，并为自己套上随机500点基础护盾",
}

--newkdef[189胡青牛医书]=function()
ItemInfo[189]={
"Ｌ消耗药材获得药品：黑玉断续膏",                                         --问题不断
"Ｗ◇主动效果（主动释放医术，快捷键F，对应单位会获得增益）",
"Ｗ◇进入10时序的免疫基础debuff状态，时序恢复1.5%的最大生命内力值",
}

--newkdef[190千金方]=function()
ItemInfo[190]={
"Ｌ消耗药材获得药品：小还丹、白云熊胆丸",                                         --问题不断
"Ｗ◇主动效果（主动释放医术，快捷键F，对应单位会获得增益）",
"Ｗ◇行动前随机吃一颗药品（对自己使用医术激活，再次对自己使用医术取消）",
}

--newkdef[191黄帝内经]=function()
ItemInfo[191]={
"Ｌ消耗药材获得药品：天香续命膏、田七鲨胆散",                                         --问题不断
"Ｗ◇主动效果（主动释放医术，快捷键F，对应单位会获得增益）",
"Ｗ◇使用帝王之术鼓舞士气，下回合行动前怒气爆发，进入天人状态2回合",
}

--newkdef[192毒经]=function()
ItemInfo[192]={
"Ｌ消耗药材获得药品：无",                                         --问题不断
"Ｗ◇主动效果（主动释放毒术，快捷键V，对应单位会获得减益）",
"Ｗ◇对敌人施毒时额外降低敌人最大血量10%，并为敌人附加随机一种剧毒",
}

--newkdef[193药王神篇]=function()
ItemInfo[193]={
"Ｌ消耗药材获得药品：黄连解毒丸、牛黄血竭丹、六阳正气丹",                                         --问题不断
"Ｗ◇学习该医术秘籍不占医术格子",
}

--newkdef[194翡翠杯]=function()
ItemInfo[194]={
"Ｌ物品说明：喝酒的杯子",                                         --飘夜
}

--newkdef[195铁铲]=function()
ItemInfo[195]={
"Ｌ物品说明：用于挖土",                                         --飘夜
}

--newkdef[196大燕传国玉玺]=function()
ItemInfo[196]={
"Ｌ物品说明：大燕传国玉玺",                                         --飘夜
}

--newkdef[197大燕皇帝世系谱表]=function()
ItemInfo[197]={
"Ｌ物品说明：大燕皇帝世系谱表",                                         --飘夜
}

--newkdef[198赏善罚恶令]=function()
ItemInfo[198]={
"Ｌ物品说明：一块令牌",                                         --飘夜
}

--newkdef[199两页刀法]=function()
ItemInfo[199]={
"Ｌ物品说明：胡家刀法中的两页纸",                                         --飘夜
}

--newkdef[200七宝指环]=function()
ItemInfo[200]={
"Ｌ物品说明：逍遥派掌门信物", 
"Ｇ装备效果；逍遥派武功威力+100",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇50%发动“七宝琉璃”，减少敌方气防值50%",                            
}

--newkdef[201断肠草]=function()
ItemInfo[201]={
"Ｌ物品说明：有剧毒",                                   -- by 飘夜
}

--newkdef[202闯王军刀]=function()
ItemInfo[202]={
"Ｇ装备效果；胡家刀法威力+100",
"Ｎ",
"Ｄ装备等级：无",                                 -- by 飘夜
}

--newkdef[203玄冰碧火酒]=function()
ItemInfo[203]={
"Ｌ物品说明：内力中和的药酒",                                   -- by 飘夜
}

--newkdef[204苗人凤眼毒解药]=function()
ItemInfo[204]={
"Ｌ物品说明：苗人凤眼毒解药",                                   -- by 飘夜
}

--newkdef[205神杖]=function()
ItemInfo[205]={
"Ｌ物品说明：武林盟主之杖",                                   -- by 飘夜
}

--newkdef[206唐诗选集]=function()
ItemInfo[206]={
"Ｌ物品说明：唐诗选集",                                   -- by 飘夜
}

--newkdef[207七心海棠]=function()
ItemInfo[207]={
"Ｌ物品说明：有剧毒",                                   -- by 飘夜
}

--newkdef[208金钥匙]=function()
ItemInfo[208]={
"Ｌ物品说明：纯金钥匙",                                   -- by 飘夜
}

--newkdef[209药材]=function()
ItemInfo[209]={
"Ｌ物品说明：用于炼药",                                   -- by 飘夜
}

--newkdef[210食材]=function()
ItemInfo[210]={
"Ｌ物品说明：用于做饭",                                   -- by 飘夜
}

--newkdef[211一撮金毛]=function()
ItemInfo[211]={
"Ｌ物品说明：谢逊的呆毛",                                   -- by 飘夜
}

--newkdef[212广陵散琴曲]=function()
ItemInfo[212]={
"Ｌ物品说明：珍贵的琴谱",                                   -- by 飘夜
}

--newkdef[213刘仲甫呕血棋谱]=function()
ItemInfo[213]={
"Ｌ物品说明：珍贵的棋谱",                                   -- by 飘夜
}

--newkdef[214张旭率意帖]=function()
ItemInfo[214]={
"Ｌ物品说明：珍贵的字帖",                                   -- by 飘夜
}

--newkdef[215溪山行旅图]=function()
ItemInfo[215]={
"Ｌ物品说明：珍贵的画作",                                   -- by 飘夜
}

--newkdef[216带头大哥书信]=function()
ItemInfo[216]={
"Ｌ物品说明：一封信",                                   -- by 飘夜
}

--newkdef[217鸳刀]=function()
ItemInfo[217]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：使用夫妻刀法时，必定连击",
"Ｗ◇LV.5：使用夫妻刀法时，必定连击，追加500气攻",
"Ｗ◇LV.6（MAX）：使用夫妻刀法时，必定连击，追加500气攻，伤害提高20%",                                -- by 飘夜
}

--newkdef[218鸯刀]=function()
ItemInfo[218]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：使用夫妻刀法时，必定连击",
"Ｗ◇LV.5：使用夫妻刀法时，必定连击，追加500气攻",
"Ｗ◇LV.6（MAX）：使用夫妻刀法时，必定连击，追加500气攻，伤害提高20%",                                -- by 飘夜
}

--newkdef[219一颗头颅]=function()
ItemInfo[219]={
"Ｌ物品说明：成昆的头",                                   -- by 飘夜
}

--newkdef[220食神秘籍]=function()
ItemInfo[220]={
"Ｌ消耗食材获得食物：叫花鸡、好逑汤、玉笛谁家听落梅、腊八粥",  
"Ｎ",
"Ｗ◇萧中慧、黄蓉修炼必得：玉笛谁家听落梅（15食材）",
"Ｗ◇人厨子修炼必得：腊八粥（25食材）",                                       --飘夜
}

--newkdef[221酒神秘籍]=function()
ItemInfo[221]={
"Ｌ消耗食材获得酒：梨花酒、玉露酒、即墨老酒、五宝花蜜酒",  
"Ｎ",
"Ｗ◇祖千秋修炼必得：五宝花蜜酒（25食材）",                                       --飘夜
}

--newkdef[222手帕]=function()
ItemInfo[222]={
"Ｌ物品说明：一块手帕",                                   -- by 飘夜
}

--newkdef[223手帕]=function()
ItemInfo[223]={
"Ｌ物品说明：一块手帕",                                   -- by 飘夜
}

--newkdef[224手帕]=function()
ItemInfo[224]={
"Ｌ物品说明：一块手帕",                                   -- by 飘夜
}

--newkdef[225闯王藏宝图]=function()
ItemInfo[225]={
"Ｌ物品说明：闯王藏宝图",                                   -- by 飘夜
}

--newkdef[226闯王藏宝图]=function()
ItemInfo[226]={
"Ｌ物品说明：闯王藏宝图",                                   -- by 飘夜
}

--newkdef[227闯王藏宝图]=function()
ItemInfo[227]={
"Ｌ物品说明：闯王藏宝图",                                   -- by 飘夜
}

--newkdef[228半部四十二章经]=function()
ItemInfo[228]={
"Ｌ物品说明：半部四十二章经，4本？不知道是哪4本",                                   -- by 飘夜
}

--newkdef[229四十二章经]=function()
ItemInfo[229]={
"Ｌ物品说明：全部的四十二章经，8本全了",                                   -- by 飘夜
}

--newkdef[230白马]=function()
ItemInfo[230]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：集气速度增加2点",
"Ｗ◇LV.3：集气速度增加3点",
"Ｗ◇LV.5：集气速度增加4点",                                  -- by 飘夜
}

--newkdef[231火蟾]=function()
ItemInfo[231]={
"Ｌ物品说明：一只蟾蜍而已，炼制地灵丹的材料之一",                                   -- by 飘夜
}

--newkdef[232太白三英的书信]=function()
ItemInfo[232]={
"Ｌ物品说明：一封信",                                   -- by 飘夜
}

--newkdef[233金娃娃]=function()
ItemInfo[233]={
"Ｌ物品说明：一条鱼",                                   -- by 飘夜
}

--newkdef[234介绍信]=function()
ItemInfo[234]={
"Ｌ物品说明：一封信",                                   -- by 飘夜
}

--newkdef[235左右互搏之术]=function()
ItemInfo[235]={
"Ｌ习得奇术：左右互搏术",
"Ｎ",
"Ｗ◇左右互搏几率：（71-资质）%",
"Ｎ",
"Ｄ觉醒方法：华山论剑选周伯通，挑战胜利后主角领悟真谛",
"Ｎ",
"Ｗ◇左右互搏真谛：必然无视打断左右的特效",
"Ｗ◇必定互搏，互搏触发后根据资质计算机率（越低越好），触发二度互搏（周伯通必触发）",
"Ｗ◇学会真谛后不会被打断互搏、二度互搏的攻击不会被打断连击（打断连击后立刻行动的效果除外）",
"Ｗ◇互搏之守：被攻击时必定触发格档特效，学有空明拳则增加格档的减伤幅度，并享有绝对气防；若触发太空卸劲则伤害强行压制到1000以下并免疫内伤",
"Ｗ◇互搏之护：被攻击时对敌方附加负集气效果，敌方从破绽区开始集气",
"Ｗ◇互搏·难敌四手：互搏时必定触发击中破绽特效，若敌方集气处于破绽区或低于破绽区，敌方防御大幅下降、并无法触发大部分减伤效果",
"Ｗ◇互搏·左右开弓：互搏时的攻击力会额外纪录前攻击的最终伤害或武功威力（择高者）。前攻击为拳掌类则翻倍记录。互博攻击时释出",
"Ｗ◇互博·上下夹攻：触发互博时机率、二度互博时必定免疫反击，发动第二次互搏时必然免疫断连击，包括独孤的无我无剑",
"Ｎ",
"Ｄ配套插件：铁布衫+阴阳倒乱刃",
"Ｗ◇触发二度互搏时，只要前刀后剑，或前剑后刀，必定同时触发阴刃、阳刃效果",
"Ｎ",
"Ｄ配套插件：太玄组合",
"Ｗ◇觉醒左右互搏真谛时，攻击时视是否有触发太玄组合有以下不同效果：",
"Ｗ◇成功触发太玄组合：",
"Ｗ◇前三次攻击必定免疫反弹反击，第四次攻击开始则有45％机率免疫反弹反击。但若为第二次互搏，则无论攻击次数，必定免疫反弹反击",
"Ｗ◇前三次攻击必定免疫断连击，第四次攻击开始则有50％机率免疫断连击。但若为第二次互搏，则无论攻击次数，必定免疫断连击",
"Ｗ◇没有触发太玄组合：",
"Ｗ◇发动互搏时有45％机率免疫反弹反击，但若为第二次互搏则必然免疫反弹反击",
"Ｗ◇发动互搏时有50％机率免疫断连击，但若为第二次互搏则必然免疫断连击",
"Ｎ",
"Ｚ特别说明：",                                         --问题不断
"Ｗ◇周伯通：自带真谛效果",
"Ｗ◇神雕侠侣双线：黑龙潭帮助瑛姑后，主角学会左右互搏后对话周伯通，提升左右互搏几率20%",
}

--newkdef[237连城剑诀]=function()
ItemInfo[237]={
"Ｌ习得外功：连城剑法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：900",
"Ｗ内力消耗：105",
"Ｗ武功范围：《 6格",
"Ｎ",
"Ｄ组合特效：连城剑法+神照经or长生诀",
"Ｗ◇攻击时附带20点流血，攻击结束后根据敌方6倍流血值恢复自身生命值",
"Ｗ◇岧峣太华俯咸京·天外三峰削不成：根据自身气攻增加攻击",
"Ｗ◇万里寒光生积雪·三边曙色动危旌：攻击时附加10点冰封值，冰封值大等于35点时触发30时序集气紊乱",
"Ｗ◇鸿雁不堪愁里听·云山况是客中过：攻击时附加10点内伤值，内伤值大等于40点时触发10时序封印",
"Ｗ◇云里帝城双凤阙· 雨中春树万人家：攻击时根据自身1/10气攻触发真伤，怒气增加25点",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",
"Ｗ◇高暴击",                                         --问题不断
}

--newkdef[238祖传护身符]=function()
ItemInfo[238]={
"Ｌ物品说明：MOD龙的传人中有用，黑山中暂时没有用，金书中也没有用",                                   -- by 飘夜
}

--newkdef[239金丝手套]=function()
ItemInfo[239]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",                                -- by 飘夜
}

--newkdef[240玄铁匕首]=function()
ItemInfo[240]={
"Ｇ装备效果；无",
"Ｎ",
"Ｄ装备等级：无",                                 -- by 飘夜
}

--newkdef[241君子剑]=function()
ItemInfo[241]={
"Ｇ装备效果；全真剑法威力+100",
"Ｎ",
"Ｄ装备等级：无",                                 -- by 飘夜
}

--newkdef[242淑女剑]=function()
ItemInfo[242]={
"Ｇ装备效果；玉女剑法威力+100",
"Ｎ",
"Ｄ装备等级：无",                                -- by 飘夜
}

--newkdef[243金刀黑剑]=function()
ItemInfo[243]={
"Ｇ装备效果；阴阳倒乱刃威力+200",
"Ｎ",
"Ｄ装备等级：无",                                -- by 飘夜
}

--newkdef[244西毒蛇杖]=function()
ItemInfo[244]={
"Ｇ装备效果；灵蛇杖法威力+200",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：攻击时无视敌方毒抗强制上毒10点",
"Ｗ◇LV.2：攻击时无视敌方毒抗强制上毒15点",
"Ｗ◇LV.3：攻击时无视敌方毒抗强制上毒20点",
"Ｗ◇LV.4：攻击时无视敌方毒抗强制上毒25点",
"Ｗ◇LV.5：攻击时无视敌方毒抗强制上毒30点",
"Ｗ◇LV.6（MAX）：攻击时无视敌方毒抗强制上毒35点",                                  -- by 飘夜
}

--newkdef[245达摩剑谱]=function()
ItemInfo[245]={
"Ｌ习得外功：达摩剑法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：140",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇同时修炼达摩剑法、少林九阳功到极",
"Ｗ◇防御状态下，受击触发格挡；受击时依照伤害增加「苦难达摩」值，苦难值达1600时，立刻进入无敌状态5时序",
"Ｗ◇使用达摩剑法攻击时附带「苦难达摩」增伤，最高增加1000点",
"Ｗ◇「苦难达摩」值可提升暴击机率、伤害、集气跳气机率",
"Ｗ◇拙劲破巧：「苦难达摩」值达2000时，使用达摩剑法攻击概率伤害翻倍，附加随机负面状态，之后苦难达摩值清零",
"Ｗ◇使用达摩剑法攻击必封穴，攻击封穴敌人必杀气；敌人封穴值超过20则附加封气绝脉陷阱",
"Ｎ",
"Ｚ特别说明：无",                                        --飘夜
}

--newkdef[246百胜刀法]=function()
ItemInfo[246]={
"Ｌ习得外功：百胜刀法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：140",
"Ｗ武功范围：△ 6格",
"Ｎ",
"Ｄ组合特效：百胜刀法+神行百变",
"Ｗ◇攻击敌人附加10点流血，根据自身刀系、轻功、敌人流血值总和增加伤害",
"Ｗ◇百胜刀法四式，增伤200点，攻击必然触发其一",
"Ｗ  横扫千军：气攻增加60%，根据气攻20%增加伤害",
"Ｗ  血战八方：气攻增加120%，根据气攻40%增加伤害",
"Ｗ  烈火燎原：气攻增加180%，根据气攻60%增加伤害",
"Ｗ  雷霆万钧：气攻增加240%，根据气攻80%增加伤害",
"Ｗ◇百胜刀法·千军万马：扣除最大生命值的15%",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习天刀九问一脉相承",                                      --问题不断
}

--newkdef[247灵蛇杖法]=function()
ItemInfo[247]={
"Ｌ习得外功：灵蛇杖法",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1400",
"Ｗ内力消耗：70",
"Ｗ武功范围：田 5格",
"Ｎ",
"Ｄ组合特效：灵蛇杖法+主运逆运真经",
"Ｗ◇攻击根据自身特系和敌方2倍中毒量增加伤害",
"Ｗ◇双蛇剧毒·寒毒：敌人中毒量超过30点时必触发，敌人冰封增加20，内力减300",
"Ｗ◇双蛇剧毒·赤毒：敌人中毒量超过30点时必触发，敌人灼烧增加20，体力减5",
"Ｗ◇万蛇天化·赤尾青竹：增加流血值12点，集气紊乱10时序",
"Ｗ◇万蛇天化·眼镜王蛇：怒气值减少8点，昏迷1回合",
"Ｗ◇万蛇天化·金银双环：无法进行攻击1回合",
"Ｗ◇万蛇天化三式每次攻击敌方强制中毒15点",
"Ｗ◇攻击时几率对敌方附加以下毒素：",
"Ｗ◇出血毒：流血所带来的血量损失增加，撕裂的血量损失增加。",
"Ｗ◇神经毒：10时序内，几率判定必然失败",
"Ｗ◇破甲毒：当普通武功伤害最终统计低于2000时，伤害翻倍。",
"Ｗ◇特殊人物：欧阳锋-觉醒后使用灵蛇杖法",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇强制上毒10~40点、附加散功状态20时序",                                         --问题不断
}

--newkdef[248三花聚顶掌]=function()
ItemInfo[248]={
"Ｌ习得外功：三花聚顶掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：35",
"Ｗ武功范围：米 6格",
"Ｎ",
"Ｄ组合特效：三花聚顶掌+主运金关玉锁决",
"Ｗ◇根据气攻额外附加伤害",
"Ｗ◇三花未落·乘兴来过·言有生年·未死之日：6X6攻击范围，气攻1600点",
"Ｗ◇精为玉花·气为金花·神为九花：攻击增加6点怒气，根据3倍怒气值恢复自身生命",
"Ｗ◇气化神·神还虚·聚于顶：攻击时根据自身拳系、内力、敌方3倍内伤值增加伤害，每次增加20点流血值和20点内伤值，再根据内伤值X3+100扣除敌人生命",
"Ｗ◇三花聚顶得归根·五气朝元通透彻：攻击时敌人处于封穴状态，每次增加20点封穴值，并根据敌人现有3倍封穴值增加额外伤害，在根据3倍封穴值扣除相应生命，5时序内丢失生命250点，",
"Ｗ◇特殊人物：王重阳，周伯通-无条件触发",
"Ｎ",
"Ｚ特别说明：必连击",                                     --问题不断
}

--newkdef[249铁指决]=function()
ItemInfo[249]={
"Ｌ习得外功：铁指决",
"Ｎ",
"Ｗ武功威力：140",
"Ｗ武功气攻：300",
"Ｗ内力消耗：7",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｄ组合特效：铁指决+化骨绵掌",
"Ｗ◇三分之气·变幻小巧：攻击时敌人触发无明业火、创伤、虚弱3个状态个15时序",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加暴击率",
"Ｗ◇附带中毒",                                         --问题不断
"Ｚ一脉相承：",
"Ｗ◇学习一阳指一脉相承",
}

--newkdef[250天竺佛指]=function()
ItemInfo[250]={
"Ｌ习得外功：天竺佛指",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：300",
"Ｗ内力消耗：14",
"Ｗ武功范围：▽ 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高暴击",
"Ｄ一脉相承",
"Ｗ◇学习无相劫指一脉相承",                                        --飘夜
}

--newkdef[251夺魄指]=function()
ItemInfo[251]={
"Ｌ习得外功：夺魄指",
"Ｎ",
"Ｗ武功威力：175",
"Ｗ武功气攻：400",
"Ｗ内力消耗：350",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习九阴白骨爪一脉相承",                                         --飘夜
}

--newkdef[252凌波微步]=function()
ItemInfo[252]={
"Ｌ习得轻功：凌波微步",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇移动格数+1",
"Ｗ◇被攻击20%的几率完全闪避攻击，并5时序内闪避翻倍",
"Ｗ◇没闪避时，有30%的几率触发凌波微步减伤，降低40%的伤害及杀气",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇踏海还潮：根据移动距离，回合后回复内力、体力",
"Ｗ◇学有北冥神功则内力回复量增加",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇无视任何必中效果（但凌波本身的闪避依然是机率性）",
"Ｗ◇闪避时触发以下效果：",
"Ｗ◇男性：烟雨谪仙：对自己附加防御上升、集气速度上升、回血等三项效果",
"Ｗ◇女性：羞月洛神：降低攻击者一定时序内的特效机率，并且机率魅惑敌人（男性机率一般但魅惑时间长；女性则高机率魅惑但魅惑时间短；第三性不吃此魅惑）",
"Ｗ◇第三性：邪魅苍生：对全场敌人附加5时序的晕眩和15点内伤，同时自身增加10点怒气",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇未触发闪避时，减伤和减杀气效果增强",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇逍遥派：逍遥御风效果在下一出手前，延长至30时序，逍遥御风的累积改为8次就触发",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇李秋水：凌波闪避有二次判定",
"Ｗ◇天山童姥：凌波微步触发闪避时回血",
"Ｗ◇无崖子：闪避失败触发减伤时，低机率扣减当前内力的20%，抵销等值伤害",
"Ｗ◇逍遥子：以上全包",
}

--newkdef[253去烦恼指]=function()
ItemInfo[253]={
"Ｌ习得外功：去烦恼指",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：700",
"Ｗ内力消耗：175",
"Ｗ武功范围：▽ 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                         --飘夜
"Ｚ一脉相承：",
"Ｗ◇学习大智无定指一脉相承",
}

--newkdef[254袖中指]=function()
ItemInfo[254]={
"Ｌ习得外功：袖中指",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：140",
"Ｗ武功范围：▽ 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习参合指一脉相承",                                         --飘夜
}

--newkdef[255兰花拂穴手]=function()
ItemInfo[255]={
"Ｌ习得外功：兰花拂穴手",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：140",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高几率封穴",                                         --飘夜
}


--newkdef[256透骨打穴]=function()
ItemInfo[256]={
"Ｌ习得外功：透骨打穴",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：105",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：葵花点穴手+透骨打穴",
"Ｗ◇被封穴者，每次触发解除封穴效果时，有一半几率失败，若成功减少封穴则增加对应的内伤",
"Ｗ◇攻击被封穴者时，根据当前封穴值增加伤害并减少战意、几率破气防、自身怒气爆发时伤害更高",
"Ｗ◇当敌方满封穴时，则必然附加脆弱状态，并必破气防，减少防御力",
"Ｎ",
"Ｄ组合特效：透骨打穴+蛤蟆功",
"Ｗ◇攻击时必触发6点封穴、内伤值，根据自身气攻附加额外伤害",
"Ｗ◇攻击必中毒，2倍中毒值恢复自身生命，敌人最多50时序内处于迟缓状态",
"Ｗ◇攻击必中毒，5倍中毒值恢复自生内力",
"Ｗ◇攻击根据指系附加伤害",
"Ｗ◇特殊人物：欧阳锋-无条件，欧阳克-使用透骨打穴",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高几率封穴",                                         --飘夜
}

--newkdef[257旋风扫叶腿]=function()
ItemInfo[257]={
"Ｌ习得外功：旋风扫叶腿",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：35",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                        --飘夜
}

--newkdef[258玄天指]=function()
ItemInfo[258]={
"Ｌ习得外功：玄天指",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：700",
"Ｗ内力消耗：140",
"Ｗ武功范围：▽ 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇高暴击",
"Ｗ◇附带冰封",                                         --飘夜
}

--newkdef[259黑风指法]=function()
ItemInfo[259]={
"Ｌ习得外功：黑风指",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：150",
"Ｗ武功范围：▽ 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",
"Ｗ◇附带冰封",                                         --问题不断
"Ｚ一脉相承：",
"Ｗ◇学习幻阴指一脉相承",
}

--newkdef[260大智无定指]=function()
ItemInfo[260]={
"Ｌ习得外功：大智无定指",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：35",
"Ｗ武功范围：▽ 6格",
"Ｎ",
"Ｄ组合特效：多罗叶指+大智无定指+无相劫指+拈花指",
"Ｗ◇除却四相：被攻击50%概率触发",
"Ｗ◇无我相：免疫本次攻击造成的内伤/封穴/冰封/灼烧",
"Ｗ◇无人相：集气条前进100",
"Ｗ◇无众生相：无视敌方武常",
"Ｗ◇无寿者相：恢复100点生命",
"Ｄ组合特效：多罗叶指+大智无定指+无相劫指+拈花指，主运天魔功/道德为零时主运血河神鉴",
"Ｗ◇魔心四相：根据学会相关指法的数量增加出招几率，使用相关指法几率四连击",
"Ｗ◇特殊条件：自身不是少林派，根据四相指的数量，使用四相指法触发以下效果：",
"Ｗ◇学一指触发魔执我相：攻击必定封穴、灼烧、冰封、内伤。并几率附加火毒、寒毒、封穴陷阱（封穴解除时集气向后150～200）、残劲袭魄 ",
"Ｗ◇学二指触发魔执人相：根据敌方人数增幅攻击力（有保底）",
"Ｗ◇学三指触发众生魔相：大范围极意攻击且使敌方混乱。",
"Ｗ◇学四指触发无佛冥相：必定使敌方受到（敌方道德X4）的真伤（无视护盾）",
"Ｎ",
"Ｄ组合特效：慈悲刀法+大智无定指",
"Ｗ◇根据自身内力/20增伤",
"Ｗ◇龙树菩提·大智大慧：攻击回合结束后根据自身所剩内力的15%恢复生命，内力越高恢复越高",
"Ｗ◇龙树菩萨·慈悲：攻击必触发封穴，几率增加3层麻痹值",
"Ｗ◇龙树菩萨·大智：攻击必触发内伤，几率集气停止15时序",
"Ｗ◇其他效果可根据自身道德值增加触发几率，道德越高几率越高，最高为60%",
"Ｎ",
"Ｚ特别说明：",                                       --问题不断
}

--newkdef[261凝血神爪]=function()
ItemInfo[261]={
"Ｌ习得外功：凝血神爪",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：70",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",
                                         --飘夜
}

--newkdef[262汗血宝马]=function()
ItemInfo[262]={
"Ｇ物品说明；集气+8，时序回复流血值2点",                                  -- by 飘夜
}

--newkdef[263天外玄铁]=function()
ItemInfo[263]={
"Ｇ物品说明；修复断刀断剑",                                  -- by 飘夜
}

--newkdef[264飞云骓]=function()
ItemInfo[264]={
"Ｇ装备效果；集气+12",                                -- by 飘夜
}

--newkdef[265金刚不坏体]=function()
ItemInfo[265]={
"Ｌ习得内功：金刚不坏体",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇被攻击时60%几率发动“金刚不坏”，高优先级降低30%所承受伤害及杀气",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇被攻击时35%几率发动“金钟罩护体”，高优先级降低20%所承受伤害及杀气",
"Ｗ◇同时学有易筋神功+金刚不坏体，主运【易筋神功】被攻击必出“金刚不坏”",
"Ｎ",
"Ｄ组合特效：罗汉伏魔功+金刚不坏体",
"Ｗ◇第一击触发罗汉金身，大幅度减伤增伤，并且无视一般杀气",
"Ｗ◇被攻击概率触发固若金汤降低一半伤害，反之降低500伤害",
"Ｗ◇特殊人物：达摩-自带",
"Ｎ",
"Ｄ组合特效：金刚不坏体+铁布衫+龙象般若功",
"Ｗ◇十三太保横练：免疫破绽，免疫杀气，受到伤害降低13%",
"Ｗ◇十三太保横练：当自身生命大于50％，受到足以致死的【武功伤害】时，消耗自身当前生命的60％，免疫此次攻击伤害并获得霸体状态",
"Ｗ◇（此效果对于「因特效产生的真实伤害致死」无效）",  
"Ｗ◇鳌拜-自带，天赋十三太保-自带",
"Ｎ",
"Ｄ组合特效：金刚不坏体+怒涛海潮功+一苇渡江",
"Ｗ◇真金刚不坏：被攻击时触发霸体状态",
"Ｗ◇水火不侵：攻击结束后清零6种基础状态",
"Ｗ◇不动明王·金刚不坏：休息时可触发清除中级异常",
"Ｗ◇额外增加集气15点",
"Ｗ◇时序恢复15点生命，50点内力，1点体力",
"Ｗ◇特殊人物：罗小鱼、第五蔚柏自带",
"Ｎ",
"Ｄ组合特效：主运金刚不坏体+铁布衫or少林九阳功",
"Ｗ◇金光罩体：被连击时伤害下降，无视暴击伤害并回血",
"Ｗ◇不灭法身：基础防御力以浮动3～7倍结算，若敌方攻击力低于结算后防御力，则该回合免疫杀气，真伤量减半",
"Ｗ◇不坏金身：免疫封穴，爆怒时被杀气量减半",
"Ｗ◇强制降低伤害为999，机率进化为不漏琉璃，下一次被攻击必然免疫被攻击伤害",
"Ｗ◇佛罡业反：被攻击时根据自身内力值反弹对手内伤（高资有加成），并根据敌方内伤直接扣除敌方血量（满内伤资质一次扣900)",
"Ｗ◇基础减少30%特效伤害，根据自身当前内力、金刚护盾额外减伤",
"Ｗ◇特殊人物：达摩-必然触发",
}

--newkdef[266四象步法]=function()
ItemInfo[266]={
"Ｌ习得轻功：飞天神行",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇移动格数+1",
"Ｗ◇集气速度+5，行动结束后，下回合集气+500（可与其他效果叠加）",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇被机率攻击时减少25％的伤害，行动回气上限开放到700",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇被攻击机率减少30％的伤害，若减少后的伤害不为零，则高机率再减少伤害，减少值等同于轻功值",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇触发减伤效果时，下一回合移动距离＋1",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇胡家父子：触发减伤时反弹冰封",
"Ｗ◇苗人凤：触发减伤时反弹灼烧",
"Ｗ◇袁紫衣：以奇门系数再增加减伤幅度，若是被奇门武功攻击则机率闪避",
}

--newkdef[267神行百变]=function()
ItemInfo[267]={
"Ｌ习得轻功：神行百变",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇移动格数+1",
"Ｗ◇被攻击时机率将杀气转为集气，转化值为杀气值的0.5",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇被攻击时机率将杀气转为等值集气",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇被攻击时机率将杀气乘以1.5倍并转化为集气",
"Ｗ◇攻击时第一击必定触发、之后机率触发「神行背刺」效果，必定附加25点流血，并根据流血值附加伤害",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇触发杀气转集气时，额外附加100点集气",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇崆峒派：增加触发杀气转集气的机率",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇阿九：触发杀气转集气效果时，机率满怒气",
"Ｗ◇小宝：触发杀气转集气效果时，机率闪避",
}

--newkdef[268拈花指法]=function()
ItemInfo[268]={
"Ｌ习得外功：拈花指",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：180",
"Ｗ武功范围：米 6格",
"Ｎ",
"Ｄ组合特效：多罗叶指+大智无定指+无相劫指+拈花指",
"Ｗ◇除却四相：被攻击50%概率触发",
"Ｗ◇无我相：免疫本次攻击造成的内伤/封穴/冰封/灼烧",
"Ｗ◇无人相：集气条前进100",
"Ｗ◇无众生相：无视敌方武常",
"Ｗ◇无寿者相：恢复100点生命",
"Ｄ组合特效：多罗叶指+大智无定指+无相劫指+拈花指，主运天魔功/道德为零时主运血河神鉴",
"Ｗ◇魔心四相：根据学会相关指法的数量增加出招几率，使用相关指法几率四连击",
"Ｗ◇特殊条件：自身不是少林派，根据四相指的数量，使用四相指法触发以下效果：",
"Ｗ◇学一指触发魔执我相：攻击必定封穴、灼烧、冰封、内伤。并几率附加火毒、寒毒、封穴陷阱（封穴解除时集气向后150～200）、残劲袭魄 ",
"Ｗ◇学二指触发魔执人相：根据敌方人数增幅攻击力（有保底）",
"Ｗ◇学三指触发众生魔相：大范围极意攻击且使敌方混乱。",
"Ｗ◇学四指触发无佛冥相：必定使敌方受到（敌方道德X4）的真伤（无视护盾）",
"Ｎ",
"Ｚ特别说明：",                                       --问题不断
}

--newkdef[269无相劫指法]=function()
ItemInfo[269]={
"Ｌ习得外功：无相劫指",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：240",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｄ组合特效：多罗叶指+大智无定指+无相劫指+拈花指",
"Ｗ◇除却四相：被攻击50%概率触发",
"Ｗ◇无我相：免疫本次攻击造成的内伤/封穴/冰封/灼烧",
"Ｗ◇无人相：集气条前进100",
"Ｗ◇无众生相：无视敌方武常",
"Ｗ◇无寿者相：恢复100点生命",
"Ｄ组合特效：多罗叶指+大智无定指+无相劫指+拈花指，主运天魔功/道德为零时主运血河神鉴",
"Ｗ◇魔心四相：根据学会相关指法的数量增加出招几率，使用相关指法几率四连击",
"Ｗ◇特殊条件：自身不是少林派，根据四相指的数量，使用四相指法触发以下效果：",
"Ｗ◇学一指触发魔执我相：攻击必定封穴、灼烧、冰封、内伤。并几率附加火毒、寒毒、封穴陷阱（封穴解除时集气向后150～200）、残劲袭魄 ",
"Ｗ◇学二指触发魔执人相：根据敌方人数增幅攻击力（有保底）",
"Ｗ◇学三指触发众生魔相：大范围极意攻击且使敌方混乱。",
"Ｗ◇学四指触发无佛冥相：必定使敌方受到（敌方道德X4）的真伤（无视护盾）",
"Ｎ",
"Ｚ特别说明：",                                       --问题不断
}

--newkdef[270参合指法]=function()
ItemInfo[270]={
"Ｌ习得外功：参合指",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1500",
"Ｗ内力消耗：350",
"Ｗ武功范围：▽ 8格",
"Ｎ",
"Ｄ组合特效：参合指+斗转星移",
"Ｗ◇对敌人附加参合状态，根据自身指法附加伤害",
"Ｗ◇慕·玄指为先：根据敌人所在的集齐位置削减敌人内力，根据指法增伤，为全场敌人附加“辰宿列张”状态，敌人行动后集气从-400开始，出手时候概率判定直接行动结束",
"Ｗ◇容·混气柔刚：根据参合指威力和敌人主运内功威力来削减敌人生命值",
"Ｗ◇参·海运洞显：根据敌方生命、内力、体力损失程度增加伤害，当敌人生命值低于30%附加“生命恢复停止”,内力低于30%附加“内力恢复停止”，体力低于30%附加“力竭”",
"Ｗ◇合·日月济世：以自身与敌人当前内力增加伤害，自身进入“幻梦状态”，被攻击必然触发幻梦星辰反击",
"Ｗ◇特殊人物：慕容龙城-必然触发",
"Ｎ",
"Ｚ特别说明：", 
"Ｗ◇参合状态：攻击时伤害降低10%~20%", 
"Ｗ◇参合状态：被攻击时受到伤害增加15%~30%",                                             --问题不断
}

--newkdef[271沧溟刀法]=function()
ItemInfo[271]={
"Ｌ习得外功：沧溟刀法",
"Ｎ",
"Ｗ武功威力：650",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：210",
"Ｗ武功范围：△ 7格，根据刀系增加",
"Ｎ",
"Ｄ组合特效：沧溟刀法+主运寒冰真气or易水寒",
"Ｗ◇叠刃行动前累积，每次累积一点，学有易水寒变为2点（覆盖寒冰效果）、学有玄冥掌额外加1点、杨冰羽额外加2点、雪羽宗人额外加1～2点，上限15点。",
"Ｗ◇攻击时每点叠刃增加200点伤害，叠刃超过10点以上，攻击后机率减少1/2～3/4（此效果若连击至第6下开始就不再计算）",
"Ｗ◇触发沧溟奥义时，每点叠刃改为增加400点伤害，必定附加等同于叠刃点的冰冻、冰冻扣血以及利刃寒锋效果",
"Ｗ◇叠刃的附加伤害，若敌方冰封值超过100时，随敌冰封程度增加大量伤害",
"Ｄ配套插件：加入雪羽宗+主运易水寒：",
"Ｗ◇对方身上的利刃寒锋将转为「真·利刃寒锋」，免疫特效解除，但上限为20点。杨冰羽使用沧溟刀、玄冥掌即可触发此效果",
"Ｎ",
"Ｚ特别说明：侠客邪线觉醒奥义",
"Ｗ◇攻击变为可移动，行动回复自身杀人数X实战/20的集气位置 ",
"Ｗ◇集气速度及集气上限随战场内杀人数增加",
"Ｗ◇击退敌人时降低全场敌方人头数X100的集气，如果爆发奥义，额外则附加实战/15的封穴，全场敌人怒气值减半",
"Ｗ◇沧溟刀法奥义·霜之哀伤：根据人数头杀全场集气，增加1000气攻，无误伤",
"Ｗ◇攻击30%几率触发，额外杀气，且必定造成流血（刀主有二次判定）",                                        --问题不断
"Ｎ",
"Ｄ组合特效：非阳内的刀或拳掌+玄冥神掌or沧溟刀法+主运易水寒+雪羽宗宗主",
"Ｗ◇（雪羽宗，且宗主限定，需要救活杨冰羽，见特殊剧情）",
"Ｗ◇杨冰羽-触发「易水寒·此去无返」等三种情形，以下四种攻击效果触发机率独自计算，可能同时出现",
"Ｗ◇进入战斗自身触发玄天寒，随后每10时序随机切换为四寒之一，概率触发以下攻击效果之一：",
"Ｗ◇玄天寒·瀑雪倾泻",
"Ｗ◇周围敌方进入“玄天寒”状态，掌刀系数降低被冰封值，怒气时序降低冰冻层数，且冰封不会时序解除，冰冻解除速度减半",
"Ｗ◇自身攻击触发“瀑雪倾泻”，自身冰封满值，对敌人强制冰封，冰封满则冰冻，冰冻满则冻结，对处于“玄天寒”状态的敌人附加自身三倍冰封值的强制伤害。根据连锁数上升伤害倍数，最多3倍。若对方刚好为玄天寒状态，根据敌方冰封程度附加真实伤害",
"Ｗ",
"Ｗ◇冥狱寒·万鬼哀嚎",
"Ｗ◇周围敌方进入“冥狱寒”状态，攻击值降低被冰封值，战意时序降低冰冻层数，且被冰封时会受到等值灼烧、内伤",
"Ｗ◇自身攻击触发“万鬼哀嚎”，攻击概率恐惧、混乱敌人，并根据敌我双方集气位置差值附加额外伤害，对处于“冥狱寒”状态的敌人额外伤害加倍，附加点燃。根据敌方与我方的集气位置差距，以及敌方冰封值增加伤害。若对方处于冥狱寒，则直接附加等同于集气位置差距值的真实伤害",
"Ｗ",
"Ｗ◇沧海寒·冰覆双极",
"Ｗ◇周围敌方进入“沧海寒”状态，防御力降低被冰封值，特效几率降低10%，且被冰封时会受到等值流血、外伤",
"Ｗ◇自身攻击触发“冰覆双极”，攻击时如敌方发动挪移，闪避，则强制冻结10时序，对处于“沧海寒”状态的敌人，攻击强制命中，并附加敌人最大生命值5%的额外伤害。触发冰覆双极时会给全场敌人附加「冰覆」特效，此特效会在敌方触发闪避、挪移时，附加冻结以及等同于敌方当前冰封值的真实伤害。之后敌方冰封值去除一半。若敌方为沧海寒状态，则攻击伤害根据敌方最大生命值的5%以及敌方冰封值而上升",
"Ｗ",
"Ｗ",
"Ｗ◇溟渊寒·幽魂恸哭",
"Ｗ◇周围敌方进入“溟渊寒”状态，轻功降低被冰封值，集气速度减半，移动力-3，且被冰封时会受到等值的中毒，封穴",
"Ｗ◇自身攻击触发“幽魂恸哭”，攻击概率虚弱、脆弱敌人，并增加（1+（敌我双方距离*10%））倍的伤害（越远伤害越高），对处于“溟渊寒”状态的敌人增加伤害加倍，附加剧毒。若敌方为溟渊寒，则新增以敌我距离的150倍，扣除生命的效果（距离越近扣除的越多）",
"Ｗ",
"Ｗ◇易水寒·此去无还",
"Ｗ◇受到致命伤害时，进入“此去无还”状态，整场战斗只能触发一次，抢跑",
"Ｗ◇四寒效果同时触发，中断对方攻击，回复全部气血，内力，体力，并进入暴怒状态，解除自身全部异常，自身防御力归零(被打就一定死)，攻击力翻倍，攻击破防+50%，附加内力最大值30%伤害，暴击伤害加倍，全特效增加20％成功机率",
"Ｗ*◇此状态触发会维持到战斗结束",
}

--newkdef[272茯苓花雕猪]=function()
ItemInfo[272]={
"Ｌ物品说明：这头猪很牛",                                   -- by 飘夜
}

--newkdef[273皇宫通行令]=function()
ItemInfo[273]={
"Ｌ物品说明：顾名思义",                                   -- by 飘夜
}

--newkdef[274一指禅]=function()
ItemInfo[274]={
"Ｌ习得外功：一指禅",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：105",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习拈花指一脉相承",                                      --问题不断
}

--newkdef[275化骨绵掌]=function()
ItemInfo[275]={
"Ｌ习得外功：化骨绵掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：-",
"Ｗ内力消耗：70",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇附带冰封、中毒(30)",                                         --问题不断
"Ｄ组合特效：同时学有灵蛇拳，使用化骨绵掌",
"Ｗ◇对应武功威力提升300点，使用任意武学攻击随即附加1~3层冰冻状态，每层减少1%集气，被攻击时冻结敌人5时序",
"Ｎ",
"Ｄ组合特效：同时学有铁指决or一阳指，使用化骨绵掌",
"Ｗ◇额外削减敌人流血值的生命",
"Ｗ◇内蓄刚劲·外现绵柔：增加敌人10点流血，敌人根据流血时序损血",
"Ｗ◇外柔内刚·迅猛爆发：攻击后敌人必满流血",
"Ｎ",
"Ｄ组合特效：寒冰绵掌+化骨绵掌",
"Ｗ◇寒冰化骨·赤毒：攻击时额外附加7点中毒值，根据不同的中毒值触发减少生命、内力、体力数值",
}

--newkdef[276火枪]=function()
ItemInfo[276]={
"Ｌ物品说明：",
"Ｎ",
"Ｗ武功威力：0",
"Ｗ武功气攻：-",
"Ｗ内力消耗：0",
"Ｗ武功范围：点 25格",
"Ｎ",
"Ｄ组合特效：学会火枪",
"Ｗ◇寸长寸强：使用奇门武功攻击伤害随距离增加而增长",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇鳌拜密道开启宝箱后洗",
"Ｗ◇装备武器火枪才有威力",                                         --飘夜
}

--newkdef[277多罗叶指]=function()
ItemInfo[277]={
"Ｌ习得外功：多罗叶指",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：150",
"Ｗ武功范围：▽ 6格",
"Ｎ",
"Ｄ组合特效：多罗叶指+大智无定指+无相劫指+拈花指",
"Ｗ◇除却四相：被攻击50%概率触发",
"Ｗ◇无我相：免疫本次攻击造成的内伤/封穴/冰封/灼烧",
"Ｗ◇无人相：集气条前进100",
"Ｗ◇无众生相：无视敌方武常",
"Ｗ◇无寿者相：恢复100点生命",
"Ｄ组合特效：多罗叶指+大智无定指+无相劫指+拈花指，主运天魔功/道德为零时主运血河神鉴",
"Ｗ◇魔心四相：根据学会相关指法的数量增加出招几率，使用相关指法几率四连击",
"Ｗ◇特殊条件：自身不是少林派，根据四相指的数量，使用四相指法触发以下效果：",
"Ｗ◇学一指触发魔执我相：攻击必定封穴、灼烧、冰封、内伤。并几率附加火毒、寒毒、封穴陷阱（封穴解除时集气向后150～200）、残劲袭魄 ",
"Ｗ◇学二指触发魔执人相：根据敌方人数增幅攻击力（有保底）",
"Ｗ◇学三指触发众生魔相：大范围极意攻击且使敌方混乱。",
"Ｗ◇学四指触发无佛冥相：必定使敌方受到（敌方道德X4）的真伤（无视护盾）",
"Ｎ",
"Ｄ组合特效：多罗叶指+罗汉伏魔功",
"Ｗ◇伤害降低一半，五连击，前五下根据敌人封穴削减内力、生命",
"Ｗ◇十指齐发：概率触发，伤害降低为五分之一，五连击",
"Ｗ◇震金断石：概率触发，附加当前内力二十分一的伤害，并概率附加重度内伤效果，最大20时序",
"Ｗ◇波罗花开：概率触发，攻击扣减封穴点数2倍的内力和生命，并附加散功、集气倒退状态10时序",
"Ｗ◇花开花落：概率触发，必封穴5点，无视敌方武常，下回合敌人无法移动",
"Ｗ◇特殊人物：达摩，鸠摩智-无条件触发",
"Ｎ",
"Ｚ特别说明：",                                       --问题不断
}

--newkdef[278越女剑法]=function()
ItemInfo[278]={
"Ｌ习得外功：越女剑法",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：7",
"Ｗ武功范围：■ 10+11X11",
"Ｎ",
"Ｄ组合特效：越女剑法+猿公剑法",
"Ｗ◇根据自身轻功增伤",
"Ｗ◇攻击时无视敌人防御，攻击必中破绽",
"Ｗ◇攻击以自身轻功为基础，额外增加连击1次，无视闪避，必全屏",
"Ｗ◇越女剑法·枝击白猿：攻击时根据自身剑法为基础扣除相应生命值，可空挥",
"Ｗ◇越女剑法·凤凰点头：攻击时敌人流血值强制附加100点，根据5倍流血值增加伤害，刺目一回合",
"Ｗ◇追形逐影：攻击时如果自身集气值高于敌人，则增加自身气攻，如果自身集气值低于敌人，则增加自身行动后回气",
"Ｗ◇特殊人物：阿青-自带",
"Ｎ",
"Ｚ特别说明：无",                                       --问题不断
}

--newkdef[279毛驴]=function()
ItemInfo[279]={
"Ｇ装备效果；血量越低，集气速度越快",
"Ｎ",
"Ｄ装备等级：无",                               -- by 飘夜
}

--newkdef[280玉女心经]=function()
ItemInfo[280]={
"Ｌ习得内功：玉女心经",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇连击时有（30+天书数×2）%的几率触发“夭矫空碧”特效，此次连击伤害、",
"Ｗ  杀气不减",
"Ｗ◇攻击的第一击有（天书数×2）%几率触发“进趋如风”特效，追加一次连击",
"Ｗ *主角使用时几率增加5%，且爆豆时在每回合的第一次出手必发动",
"Ｗ 【女性专属】气攻伤害增加20%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇集气速度增加3点",
"Ｗ◇被攻击时，降低50%本次攻击所造成的灼烧",
"Ｗ *同时学有玉女心经+先天功，每时序额外回复1点封穴",
"Ｎ",
"Ｄ组合效果：主运玉女心经+先天功",
"Ｗ◇每时序额外回复1点封穴",
"Ｗ◇开场、行动前、攻击、被攻击、全场敌人怒气降低10%，附加暴怒不能触发绝技、暴怒后集气减半的debuff（敌人行动后解除）",
"Ｗ◇自身怒气增加速度减半，被攻击时根据敌人怒气减伤，并根据敌人怒气反弹伤害",
"Ｗ◇自身免疫灼烧，自身怒气值越低恢复生命内力越快，根据自身冰封值减伤",
"Ｗ◇根据敌我怒气差，持续降低比自身怒气值高的敌人的集气速度",
"Ｗ◇特殊人物：林朝英-学会玉女",
"Ｎ",
"Ｄ组合效果：玉女心经 + 先天功",
"Ｗ◇目标暴怒速度减半  ",
"Ｗ◇自身怒气不增加，敌方目标怒气越高对自身的伤害越低 ",
"Ｗ◇自身免疫灼伤；被冰封时伤害减半，回血回内",
"Ｗ◇自身在场时，目标时序增加怒气，攻击时对自身造成200%怒气值的伤害",
"Ｗ◇林朝英学会玉女心经后即可触发效果",
"Ｎ",
"Ｄ组合效果：玉女心经+龟息功+金雁功",
"Ｗ◇玉女心经 重生状态：可复活一次",
"Ｗ◇玉女绝影：开局自带7次必闪避，消耗7次之后几率触发",
"Ｗ◇攻击附带吸血效果，根据自身攻击伤害的30%吸血，上限1000点",
"Ｗ◇特殊人物：林朝英、敌人版杨过小龙女自带",
}

--newkdef[281商会令牌]=function()
ItemInfo[281]={
"Ｌ物品说明：很值钱",                                   -- by 飘夜
}

--newkdef[282天罗地网]=function()
ItemInfo[282]={
"Ｌ习得轻功：天罗地网",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇移动格数+1",
"Ｗ◇攻击时35%几率无视敌人的闪避强制命中(葵花挪移除外)，且自身攻击范围+1，被击中的敌方下回合移动格数-1",
"Ｗ◇强制命中可针对敌方真葵花移行、凌波微步、神行百变等特效，无视我方被刺目等debuff ",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇若自身轻功大于敌方轻功值（敌方以原本轻功值1/2计算）时，根据差距增加伤害，攻击时必中",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇当被攻击的敌方触发挪移效果的机率下降30%，若挪移失败，附加麻痹状态。增加真实必中，可打中轻云蔽月、剑步迷影、速水无痕等绕过被打判定的特效",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇攻击时低机率使敌方陷入锁足状态。攻击锁足、缠足状态敌人附加内伤和冰封",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇古墓派：古墓派武功会以轻功值附加少幅气攻、空碧改为连击增伤",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇杨过：行动后机率触发回气100点",
"Ｗ◇小龙女：自身八格内的敌人被攻击必中",
"Ｗ◇李莫愁：触发赤练神掌时，自身八格内敌人机率被附加中毒",
"Ｗ◇黄衫女：攻击时为自己附加疾风状态，最高10层",
"Ｗ◇林朝英：除李莫愁效果外，以上全包",
}

--newkdef[283五轮大法]=function()
ItemInfo[283]={
"Ｌ习得外功：五轮大法",
"Ｎ",
"Ｗ武功威力：650",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：180",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无",                                    --飘夜
}

--newkdef[284瘦黄马]=function()
ItemInfo[284]={
"Ｇ装备效果；血量越低，集气速度越快",
"Ｎ",
"Ｄ装备等级：无",                               -- by 飘夜
}

--newkdef[285血河神鉴]=function()
ItemInfo[285]={
"Ｌ习得内功：血河神鉴",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇高优先级提升10%伤害",
"Ｗ◇攻击时必定造成流血",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击时，恢复造成伤害10%的血量（单次攻击上限100点）",
"Ｎ",
"Ｄ组合效果：天魔功+血河神鉴",
"Ｗ◇进场后全场敌人附加血河印，敌人攻击时误伤（非击中）攻击范围额外增加周身5X5，攻击时根据自身怒气概率进入精神错乱状态，并随机选取一个额外友军目标误伤，暴怒时必触发",
"Ｗ◇当血河印持有者误伤友军时，恢复幽冥血海持有者的生命",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习天魔功一脉相承",
}

--newkdef[286九阴真经上卷]=function()
ItemInfo[286]={
"Ｌ物品说明：上卷，下卷合起来有用。这是上卷",                                   -- by 飘夜
}

--newkdef[287九阴真经下卷]=function()
ItemInfo[287]={
"Ｌ物品说明：上卷，下卷合起来有用。这是下卷",                                   -- by 飘夜
}

--newkdef[288断裂的倚天剑]=function()
ItemInfo[288]={
"Ｌ物品说明：断剑，不能用了，要用天外玄铁修补",                                   -- by 飘夜
}

--newkdef[289断裂的屠龙刀]=function()
ItemInfo[289]={
"Ｌ物品说明：断刀，不能用了，要用天外玄铁修补",                                   -- by 飘夜
}

--newkdef[290白蟒鞭法]=function()
ItemInfo[290]={
"Ｌ习得外功：白蟒鞭法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：？？",
"Ｗ内力消耗：70",
"Ｗ武功范围：田 5格",
"Ｎ",
"Ｄ组合特效：太极拳or混元掌or白蟒鞭法+混元功or混沌气决+纯阳无极，使用太极拳or混元掌or白蟒鞭法攻击",
"Ｗ◇闪电五连鞭：必中，附带30点真伤，必定五连，对自己附加10时序的集气紊乱（羞耻的文字特效，酷炫的闪电特效）",
"Ｗ◇武当2级以上弟子不会附加集气紊乱",
"Ｎ",
"Ｄ组合特效：太极拳+混元掌+白蟒鞭法+混元功or混沌气决+纯阳无极，主运混元功or混沌气决",
"Ｗ◇接：被打第一下时触发，伤害减少20％",
"Ｗ◇化：被打第二下时触发，为自己储存等同于杀气1/2的伤害",
"Ｗ◇发：被打第三下时触发，先手反击，50％几率为盲目攻击，接化发重新计算 ",
"Ｎ",
"Ｄ组合特效：白蟒鞭法+主运九阴真经",
"Ｗ◇根据敌我内力差增加伤害",
"Ｗ◇白蟒鞭法·灵蛇出洞：附加内伤、流血、封穴25点，减少体力5点",
"Ｗ◇白蟒鞭法·婉若游龙：根据自身特系扣除生命，现有内力增伤，增加怒气10点",
"Ｗ◇白蟒鞭法·风吹柳絮：根据敌方特系扣除内力，附加麻痹状态，如果敌人内伤点数大于50点附加锁足状态",
"Ｗ◇白蟒鞭法·如似鬼魅：攻击后20时序内处于闪避状态",
"Ｗ◇白蟒鞭法·灵动之极：每时序扣除75点生命，120点内力，持续20时序",
"Ｗ◇白蟒鞭法可移动范围增加到7格",
"Ｗ◇特殊人物：黄裳-自带特效",
"Ｎ",
"Ｚ特别说明：",                                        --问题不断
}

--newkdef[291大力金刚指]=function()
ItemInfo[291]={
"Ｌ习得外功：大力金刚指",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：700",
"Ｗ内力消耗：245",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｄ组合特效：大力金刚指+金刚不坏体",
"Ｗ◇基础：攻击时附加等同于金刚不坏体武功威力的普通伤害",
"Ｗ◇金刚般若：依照武常、江湖地位，攻击时计算系数伤害时，大幅提升我方拳掌/指法系数，并于攻击时使敌方拳掌/指法系数计算值大幅降低；被攻击时，系数伤害会扣减防御力再行结算",
"Ｗ◇照見諸法：每次行动前机率蓄力。在有蓄力的情况下攻击，根据自身所学武功数增幅伤害。若武功学满15个，则额外有高机率免疫反击反弹",
"Ｗ◇怒相行深：攻击时机率、受击时必定增加怒气，暴怒时触发「怒目金刚」特效，全场敌人机率附加恐惧状态。当自身怒气值大于15时，被攻击者如有恐惧状态则伤害大幅提升",
"Ｗ◇自在觀空：该场战斗每一次触发「金刚不坏」或「金钟罩护体」特效（金刚不坏体的自带效果，非少林门派效果）时，机率清除部分debuff与内伤，并提升自身战意",
"Ｎ",
"Ｚ特别说明：",                                         --问题不断
"Ｗ◇攻击自带30%几率冻结10时序",
}

--newkdef[292呼延枪法]=function()
ItemInfo[292]={
"Ｌ习得外功：呼延枪法",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：-",
"Ｗ内力消耗：14",
"Ｗ武功范围：米 4格",
"Ｎ",
"Ｄ组合特效：呼延枪法+呼延鞭法",
"Ｗ◇寸长寸强：使用奇门武功攻击伤害随距离增加而增长",
"Ｎ",
"Ｄ组合特效：杨家/中平/呼延/岳家枪法（其中之一）+特系数350以上，完成夜雨楼击杀豪侠的任务（无论是不是夜雨楼杀手），南子传授",
"Ｗ◇燎原百击(以杨家枪、呼延枪、中平枪或岳家枪法攻击",
"Ｗ◇二十针：",
"Ｗ◇攻击敌方时，根据敌方灼烧值附加封穴，并在敌方体内埋下「燎原枪焰」",
"Ｗ◇燎原枪焰：当身有燎原枪焰的敌人封穴值为0时，枪焰爆发，附加集气紊乱、点燃并根据当前灼烧值靠除血量",
"Ｗ◇当敌方封穴值大于等于灼烧值时：直接根据敌方封穴值扣减集气，并降低气防。满怒气时必定破防",
"Ｗ◇当敌方灼烧值大于等于封穴值时：根据灼烧值附加内伤，机率附加重度内伤",
"Ｗ◇三十击:",
"Ｗ◇无定击：第一击时触发，自身八格内敌人遭受一定程度的真实伤害，并提升自身战意",
"Ｗ◇雨暴风狂：强行降低敌方战意，并依据敌我战意差计算机率，使敌方进入恐惧、虚弱状态",
"Ｗ◇迭浪千重：根据自身内力和连击数增加伤害。战意爆发时触发破甲效果",
"Ｗ◇威凌天下：自身怒气满时触发，第一击时为全屏攻击，并为自身加一层九阳气罩",
"Ｗ◇五十式:",
"Ｗ◇斜挑式：此次攻击必定命中破绽",
"Ｗ◇横扫式：此次攻击变为极意攻击，并必定暴击",
"Ｗ◇格勾式：此次攻击特系数以6666计算",
"Ｗ◇无枪式：蓄力后攻击时机率触发必中，并发挥空挥效果，根据自身灼烧对全场敌方扣除血量、体力",
"Ｗ◇主运极阴无相并极阴无相到极的特殊效果：燎原冷焰",
"Ｗ◇比较敌方冰封值和灼烧值，以高者为准，使二者相等",
"Ｗ◇敌方处于冰冻状态时上点燃、敌方处于点燃状态时上冰冻",
"Ｎ",
"Ｄ组合特效：呼延枪法+主运天魔功",
"Ｗ◇攻击必满冰封、内伤",
"Ｗ◇夺命枪法·相思：自身攻击力根据气功提高伤害",
"Ｗ◇夺命枪法·断肠：根据自身60%气功附加真伤",
"Ｗ◇夺命枪法·盲龙：敌人集气紊乱10时序",
"Ｗ◇夺命枪法·无双：根据自身体力及敌内伤总和扣除内力，随体力受损程度减少生命，体力恢复降低，损耗加倍，体力值低于50时概率进入麻痹状态1回合",
"Ｗ◇夺命枪法·白龙：攻击后敌全体集气倒退20时序",
"Ｗ◇夺命枪法·望穿：攻击后敌全体全基础异常+6，有基础异常生命-15，内力-30，体力-1，生命<40%，陷入集气波动40时序",
"Ｗ◇夺命枪法·鲲鹏：攻击后敌全体真伤300-500",
"Ｗ◇特殊人物：南子使用呼延枪法攻击时即可触发，无需内功",
"Ｎ",
"Ｚ特别说明：无",                                         --问题不断
}

--newkdef[293楞伽经]=function()
ItemInfo[293]={
"Ｌ物品说明：梵文版中含有九阳神功",                                   -- by 飘夜
}

--newkdef[294瑜伽密乘]=function()
ItemInfo[294]={
"Ｌ习得内功：瑜伽密乘",
"Ｎ",
"Ｗ◇该效果开启后，每次使用五系外功攻击，就可增加瑜珈点数，每100点瑜珈点数，就可增加1点体质，最高增加8点体质。可开启第二运功。",
"Ｎ",
"Ｄ觉醒方法：当瑜珈点数达到800点以上，会变为「瑜珈密乘：无上」",
"Ｎ",
"Ｚ特别说明：洗髓证果要在瑜伽大成前修炼，最好先练洗髓在练瑜伽", 
}

--newkdef[295太极神功]=function()
ItemInfo[295]={
"Ｌ习得内功：太极神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇被攻击时，有60%几率获得“太极之形”（可累积，上限10个）",
"Ｗ◇每个“太极之形”可提高自身集气1点",
"Ｗ◇主动攻击时，可释放累积的“太极之形”，增加连击数",
"Ｗ （每个5太极之形增加一次连击）",
"Ｗ◇被攻击储存蓄力值，使用太极拳/剑跟据蓄力值增加效果",
"Ｗ◇太极拳/剑蓄力值300～600，攻击范围+2",
"Ｗ◇太极拳/剑蓄力值超过600，攻击范围变为可移动面攻，且必定连击",
"Ｗ◇根据蓄力值增加防御跟减伤",
"Ｗ◇太极拳太极剑法威力+200",
"Ｄ太极特效：",
"Ｚ◇<转阴阳>",
"Ｗ◇被攻击时30%概率反弹自身所有异常",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇触发太极奥义时，必定触发“太极真义·四两拨千斤”",
"Ｗ◇触发太极奥义时，降低10%所承受伤害",
"Ｗ◇行动后自动执行防御防御指令",
"Ｄ太极特效：",
"Ｚ◇<开太极>",
"Ｗ◇主运太极神功，使用太极拳法或太极剑法",
"Ｗ◇蓄力值超过500且暴怒触发",
"Ｗ◇根据当前生命值跟内力值追加大范围伤害，生命比例越低、内力比例越高伤害越高",
"Ｎ",
"Ｄ组合效果：太极神功+先天功+凌波微步",
"Ｗ◇行动结束后可在移动6格",
"Ｗ◇无我无相·虚无缥缈：被攻击时可触发挪移效果（被天罗，拳奇穴，夜雨楼针对）",
"Ｗ◇特殊人物：张三丰、王重阳、逍遥三老、李小妹、逍遥子自带",
"Ｎ",
"Ｄ组合效果：主运太极神功+两门道门内功",
"Ｗ纯阳、北冥、小无、不老、八荒、混沌气决、先天、金关、阴阳无极、混元功、长生诀、小周天、大周天",
"Ｗ◇初始自带：9层太极护盾，被直接伤害攻击时，减伤90%，并根据自身道德和战意再次减伤，25时序恢复一层",
"Ｗ◇自身生命值大于半血时，持续清除中毒、内伤，当自身太极护盾消失进入时以静制动状态3时序并时序回血",
"Ｗ◇固定减伤40%，被攻击断连击，额外根据“太极蓄力”层数和自身气防御增加减伤",
"Ｗ◇攻击必三连击，根据气攻、“太极劲”增加伤害，暴怒时增伤翻倍",
"Ｗ◇阴阳无极：攻击时增加150层“太极蓄力”",
"Ｗ◇后发制人：被攻击后吸收杀气并增加“太极劲”，根据“太极劲”层数增加自身抗性，被攻击后减少敌人怒气，增加自身怒气",
"Ｗ◇蓄势待发：攻击引爆“太极劲”，敌方全体被杀气、损血",
"Ｗ◇无极阴阳：被攻击反弹敌人",
"Ｗ◇白鹤亮翅：被攻击后反杀敌人集气500",
"Ｗ◇如封似闭：被封穴后增加自身减伤",
"Ｗ◇太极圆转：行动后增加“太极劲”层数，并根据自身集气位置附加减伤护盾，自身集气位置越低护盾越强，被攻击命中后护盾移除",
"Ｗ◇厚积薄发：暴怒攻击时必杀气，根据怒气值增加伤害和气攻，附加最后一次受击时储存的伤害",
"Ｗ◇以静制动：根据自身集气位置对自身提供增益效果，自身集气位置低于0时，随集气位置降低加大概率反冲集气；自身集气位置高于500时，随集气位置提高加大概率无视集气紊乱和停止效果",
"Ｗ",
"Ｗ◇天赋万法自然-主运太极即可享有组合，挨打可以累计太极劲，累计满即可抢跑",
"Ｗ◇特殊人物：张无忌-主运太极，张三丰-自带",
}

--newkdef[296梯云纵横]=function()
ItemInfo[296]={
"Ｌ习得轻功：梯云纵横",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇移动格数+1",
"Ｗ◇攻击伤害不随距离递减",
"Ｗ◇被攻击时，50%几率降低50%的杀气",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇触发减杀气时，根据是否破防决定以下两种效果：",
"Ｗ◇煌煌道威 虚怀若云：无破防时触发，自身异常状态皆有机率清零",
"Ｗ◇煌煌道威 封魔玄坤：被破防时触发，我方所有成员下一回合攻击必极意，机率锁足",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇杀气减少70％，并根据敌人轻功将杀气储存。当被储存的杀气到一定量以上时，开启「登云」特效",
"Ｗ◇登云：20时序内集气速度1.5倍，行动后可以再次移动。在登云发动期间，行动后清除所有异常状态，时序恢复集气速度的生命值",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇提升减杀气机率、登云开启条件下调",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇武当派：行动前高机率使太极蓄力值增加当前额的20%",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇张三丰：提升以柔克刚的回血量、无视门派要求享受门派效果且加强",
}

--newkdef[297瞬息千里]=function()
ItemInfo[297]={
"Ｌ习得轻功：瞬息千里",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇无视限制移动，移动格数+1",
"Ｗ◇暴怒时集气速度提升至3倍且免疫封穴",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇内伤对于集气速度的负面影响转为正面",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇当自身集气位置低于零时，依照自身内伤计算机率打断敌方攻击并立刻行动。生命低于500机率上升",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇时序减少1封穴，爆怒时清除所有封穴",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇白驼山：减轻内伤带来的攻防削弱，并无视内伤对移动能力的影响",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇欧阳锋：内伤增加集气速度的幅度增加",
"Ｗ◇欧阳克：时序机率增加怒气",
}

--newkdef[298阴风刀]=function()
ItemInfo[298]={
"Ｌ习得外功：阴风刀",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：140",
"Ｗ武功范围：《 7格",
"Ｎ",
"Ｄ组合特效：阴风刀+沧溟刀",
"Ｗ◇利刃寒锋：攻击50%给敌人附加冻结状态（冻结状态下，无法集气，亦无法时序回复状态）",
"Ｎ",
"Ｄ组合特效：阴风刀+圣火神功",
"Ｗ◇攻击必冰封，每次增加10点流血值，攻击根据自身拳、刀系，敌方冰封值增加伤害",
"Ｗ◇始解袖白雪：暴怒时前两次攻击额外翻倍增伤",
"Ｗ◇初之舞·月白：根据敌方冰封值附加额外伤害，时序停止5-10时序",
"Ｗ◇次之舞·白涟：根据敌方冰封值附加内伤值，恢复自身生命、内力",
"Ｗ◇叁之舞·白刃：根据敌我内力值之差增加伤害",
"Ｗ◇万解·白霞罚：伤害增加2.5倍，必连击，全屏攻击，无视敌方50%防御力",
"Ｗ◇特殊人物：摩尼-使用阴风刀",
"Ｎ",
"Ｚ特别说明：无"
}

ItemInfo[299]={
"Ｌ习得特技：五岳剑诀",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇被攻击时如未触发真气护体，则发动“以剑御气”",
"Ｗ  降低50%气攻",
"Ｗ◇五岳剑法威力+200",
"Ｗ◇使用五岳剑法，必出“气贯五岳”，追加气攻提高至1500，且无视绝对气防",
"Ｎ",
"Ｗ◇五岳剑法分别获得如下的强化效果：",
"Ｗ  *太岳：连击时变为三连击",
"Ｗ  *云雾：对于血量低于一半的敌人伤害加倍",
"Ｗ  *万花：杀伤范围+1格",
"Ｗ  *泰山：攻击后20时序内有30%几率闪避",
"Ｗ  *万岳：对敌方造成伤害同时扣除对其伤害量的内力",

"Ｎ",
"Ｄ组合效果：五岳神剑+五岳剑诀",
"Ｗ◇面板上有五个五岳进阶内功主运对应门派内功，使用对应门派剑法攻击触发或五岳真传盟主使用五岳神剑对应的招式攻击：",
"Ｗ",
"Ｌ◇五岳神剑-北（万花剑法）：对冰冻状态的敌人伤害增加，必迟缓",
"Ｗ◇惊涛拍岸：连击数小于三时，变为三到五连击。并对敌人附加冰冻状态。",
"Ｗ◇千里冰封：对全屏附加冰封。并根据敌方冰封程度扣除内力",
"Ｗ◇润物无声：扣除敌人25点体力，并附加「虚弱（降低攻击伤害）」、「脆弱（减伤效果无效）」、「迟缓」",
"Ｗ◇阴寒侵袭：扣除敌人我方攻击伤害两倍的内力。并附加「寒读侵脉」。",
"Ｌ◇五岳神剑-东（衡山剑法）：对中毒状态的敌人伤害增加，必封穴 ",
"Ｗ◇巨木槌击：以敌方内力缺少值附加伤害，并止杀敌方一回合",
"Ｗ◇茂木成林：对自己附加「徐如林」状态，回复集气",
"Ｗ◇藤蔓纠缠：附加剧毒状态最高50时序、基础蛊毒1回合（下回合回气降低、毒性爆发会杀更多血）",
"Ｗ◇青霉蔓延：对全场敌人附加大量中毒，且一定时序内中毒无法以任何方法解除。",
"Ｌ◇五岳神剑-南（泰山剑法）：对灼烧状态的敌人伤害增加，必灼烧",
"Ｗ◇烈火焚城：对全场附加灼烧，并根据当前灼烧值扣除生命",
"Ｗ◇松明抚斩：以自身轻功、敌方内力现值来增加伤害",
"Ｗ◇火毒攻心：对敌方附加火毒攻心。若敌方当前灼烧值大于40，机率附加点燃",
"Ｗ◇怒火中烧：对敌方埋下陷阱，敌方因任何原因怒气爆发时，附加50点内伤、30点灼烧以及25时序集气紊乱状态。",
"Ｗ",
"Ｌ◇五岳神剑-中（嵩山剑法）：对内伤状态的敌人伤害增加，必内伤 ",
"Ｗ◇峰峦如聚：为自己附加如山特效。下一次被攻击时，第一击大量减少伤害。",
"Ｗ◇乱石穿空：对全场附加内伤，并减少等同于内伤值的集气。",
"Ｗ◇沙瀑大葬：对全场附加迟缓，并减少等同于内伤值的生命。",
"Ｗ◇流沙囚牢：对全场附加锁足以及「残劲破体（攻击加力会对攻击者自己附加内伤）」状态。",
"Ｌ◇五岳神剑-西（华山剑法）：对流血状态的敌人伤害增加，必连击、必流血",
"Ｗ◇金石可镂：根据敌我攻击力差增幅伤害。",
"Ｗ◇电光连环：全屏攻击，并根据敌人数量增加伤害（群战收割机）。",
"Ｗ◇经脉寸断：附加「撕裂」状态。",
"Ｗ◇金光夺目：对全场附加盲目状态。",
"Ｚ特别说明：",
"Ｗ◇身为五岳门人，身上练有五岳心法＋五岳剑法（共十个武功）。",
"Ｗ◇选择修炼「五岳剑诀」时，选择将心法以及剑法都一脉，即可升阶(十个武功会洗剩两个)五岳派真传盟主。",
"Ｗ◇若本身天赋内功为五岳心法其一，会洗为五岳剑诀",
"Ｗ◇若本身天赋外功1为五岳剑法其一，会洗为五岳神剑",
"Ｗ◇升阶时增加御剑值250点。",
"Ｗ◇被攻击必然发动以剑御气，使用五岳神剑攻击发动气贯五岳时，机率附加真实伤害",
"Ｗ◇五岳进阶内功（如紫霞）皆直接视为有主运，不用学会",
"Ｗ◇独立计算触发「气贯五岳」、「以剑御气」的机率。",
}

ItemInfo[300]={
"Ｇ装备效果；50%机率触发“降龙四叠浪”，增加降龙三叠浪机率。",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：增加降龙三叠浪机率5%",
"Ｗ◇LV.2：增加降龙三叠浪机率10%",
"Ｗ◇LV.3：增加降龙三叠浪机率15%",
"Ｗ◇LV.4：增加降龙三叠浪机率20%",
"Ｗ◇LV.5：增加降龙三叠浪机率25%",
"Ｗ◇LV.6（MAX）：增加降龙三叠浪机率30%",
"Ｄ装备特效：",
"Ｚ特别说明："
}

ItemInfo[308]={
"Ｌ习得内功：鲸息功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇时序增加怒气值2点",
"Ｗ◇每3时序回1内伤",
"Ｗ◇每时序回1点中毒",
"Ｗ◇30%概率造成目标集气紊乱",
"Ｗ◇时序回复3点生命/6点内力",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇根据蓄力值增加气防值",
"Ｗ◇被攻击跟据伤害值蓄力，蓄力值大于1000自身攻击必暴击",
"Ｗ◇根据蓄力值提升气攻",
"Ｗ◇免疫冰封",
"Ｗ◇使用碧海惊涛掌攻击概率触发六大奇劲之一：",
    "Ｗ陷空力：忽视绝对气防+破防50%",	
	"Ｗ滔天炁：触发大范围伤害",	
	"Ｗ生灭道：攻击后触发霸体一回合",
	"Ｗ漩涡劲：增加一次连击",		
	"Ｗ阴阳流：必冰封必灼烧",	
	"Ｗ滴水劲：附加气攻值5%伤害",
"Ｎ",
"Ｄ组合特效：金刚狮子吼+鲸息功 ",
"Ｗ◇1.攻击时，内力大于2000：敌全体30点内伤，陷入精神错乱10时序",
"Ｗ◇2.攻击时，内力大于4000：敌全体封穴10点，可突破封穴上限",
"Ｗ◇3.攻击时，内力大于6000：敌全体集气倒退10时序",
"Ｗ◇4.攻击时，内力大于8000：敌全体集气静止10时序",
"Ｗ◇5.触发特效时强制全场杀气50点",
"Ｗ◇特殊人物：方证-自带，无条件2、4条，谢逊-自带，无条件1、3条",
"Ｎ",
"Ｄ组合特效：混元功or混沌气决+蛤蟆功or鲸息功 ",
"Ｗ◇行动后回复100~150点生命值200~300点内力值和4~6点体力值，随机获得一种药品BUFF,每回合结束怒气+10",
"Ｗ◇天赋内功为蛤蟆功/鲸息功时10%概率爆怒一次",
"Ｎ",
"Ｄ组合特效：龟息功+鲸息功",
"Ｗ◇被攻击时降低基础伤害直至100点，并恢复生命内力500，体力5点",
"Ｗ◇如果触发复活进入鲸龟状态，提升自身怒气，行动前无敌，清除所有状态，6时序后立即出手，行动后恒定减伤30%",
"Ｎ",
"Ｄ组合特效：主运鲸息功+九阴神功",
"Ｗ◇1、周流八劲",
"Ｗ  1）泽：攻击次数为4次，小于4次的按4次计算",
"Ｗ  2）火：以自身现有内力增加攻击，满灼烧，附加阳气侵蚀20时序",
"Ｗ  3）水：以敌人现有内力增加攻击，满冰封，附加阴气污染20时序",
"Ｗ  4）雷：1回合内废除敌人封穴免疫及抗性，敌人该状态下行动后有概率直接满封穴，并根据自身封穴值概率降低集气位置，流血+25，随流血减少生命，30时序内根据道德高低扣血",
"Ｗ",
"Ｗ  5）山：被攻击后恢复生命1500点，内力3000点，体力8点",
"Ｗ  6）风：被攻击后敌人分别进入昏迷、麻痹、混乱、同归、恐惧状态",
"Ｗ  7）地：被攻击时伤害降为10点",
"Ｗ  8）天：被攻击时强制断连击、断左右互搏",
"Ｗ◇2、根据自身现有内力值增加集气速度，内力越高集气越快",
"Ｗ◇3、每时序清除基础负面状态8点，时序恢复生命16点，内力30点，体力2点",
"Ｗ◇4、降低反弹几率",
"Ｗ◇5、攻击时无视敌人40%防御",
"Ｗ◇6、可将自身内力最大值的10%转化为真实伤害",
"Ｗ◇7、碧海惊涛·海流六奇:学会碧海惊涛掌后被攻击时必反击",
"Ｗ◇特殊人物：梁萧自带，逍遥子-不自带",
}

ItemInfo[309]={
"Ｌ习得外功：无",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：李寻欢专属"
}

ItemInfo[310]={
"Ｌ习得外功：碧海惊涛掌",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1400",
"Ｗ内力消耗：140",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：碧海惊涛掌+鲸息功",
"Ｗ◇碧海惊涛掌·大海无量-以敌人轻功为基础增加伤害并附加10层迟缓值，攻击后自身恢复体力3点",	
"Ｗ◇碧海惊涛掌四式：",	
"Ｗ◇   波澜壮阔-附加冰封、灼烧各20点",
"Ｗ◇   惊涛拍岸-附加内伤20点，无法行动一回",		
"Ｗ◇   海动波涛-附加封穴20点，刺目一回合",	
"Ｗ◇   千漩百转-附加流血20点，昏迷一回合",
"Ｗ◇碧海惊涛掌·百川归海-攻击以敌我内力总和增加伤害，二次攻击判定为敌人身上的基础负面状态增加伤害，根据敌人轻功增加连击次数，无法攻击一回合",
"Ｗ◇特殊人物：梁萧使用碧海惊涛掌",
"Ｚ特别说明：无"
}

--newkdef[311太虚剑意]=function()
ItemInfo[311]={
"Ｌ习得内功：太虚剑意",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回1内伤",
"Ｗ◇每时序回2点气血",
"Ｗ◇ “坐忘无我 韬光养晦”：被攻击时，受到气攻大于1500发动，吸收气攻值为自身的气防",
"Ｗ◇ “三环套月”：使用剑法时太虚剑意加力50%机率三连击",
"Ｗ◇ “万剑归宗”：使用剑法时太虚剑意加力高概率造成封穴，追加气攻值1500点",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇每5时序回1内伤",
"Ｗ◇每时序回内力+4点",
"Ｗ◇ “三环套月”：使用剑法时太虚剑意加力20%机率三连击",
"Ｗ◇ “万剑归宗”：使用剑法时太虚剑意加力高概率封穴，追加气攻值600点",
}

--newkdef[312神秘护符]=function()
ItemInfo[312]={

"Ｚ特别说明：神秘力量的护符"
}

--newkdef[313斩流剑术]=function()
ItemInfo[313]={
"Ｌ习得外功：斩流剑术",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1600",
"Ｗ内力消耗：140",
"Ｗ武功范围：线型 8格",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：无"
}

--newkdef[314千年冰蚕]=function()
ItemInfo[314]={
"Ｌ物品说明：千年冰蚕，炼制地灵丹的药材之一",
"Ｎ",
"Ｄ使用效果：+100抗毒",
                                    
}

--newkdef[315神木王鼎]=function()
ItemInfo[315]={
"Ｌ物品说明：星宿派至宝，炼制地灵丹的鼎炉",
"Ｎ",
"Ｄ使用效果：无",
                                    -- by 飘夜
}

--newkdef[316地灵丹]=function()
ItemInfo[316]={
"Ｌ物品说明：增加武常50点",  
}

--newkdef[317不老长春功]=function()
ItemInfo[317]={
"Ｌ习得内功：不老长春功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇血量百分比高于内力百分比时",
"Ｗ◇时序回复百分之一内力",
"Ｗ◇血量百分比低于内力百分比时",
"Ｗ◇时序回复百分之一生命",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇时序回复(5+天书数量)的生命值",
"Ｗ◇时序回复(5+天书数量)的内力值",
"Ｎ",
"Ｄ组合特效：怒涛海潮功+不老长春功+花间游",
"Ｗ◇时序恢复体力3点",
"Ｗ◇无视除空挥以外所有攻击",
"Ｗ◇天魔教魔将主运天魔功享受此效果",
"Ｎ",
"Ｄ组合效果：主运不老长春功+北冥神功",
"Ｗ◇一定时序内自身封穴、流血、冰封、灼烧、内伤、中毒状态清0",
"Ｗ◇每时序恢复10点冰封、灼烧",
"Ｗ◇额外增加集气10点，攻击根据自身气防增伤、杀内500点",
"Ｗ◇攻击结束后二选一恢复自身消耗的内力值或生命值 ",
"Ｗ◇不老长春·天长地久：免疫一般杀气，伤害减50%，被攻击后伤害几率降低为30点",
"Ｗ◇不老长春·气破万千：攻击时几率敌人止杀1回合，为敌人附加10时序回魂仙梦",
"Ｗ◇不老长春·气冲阴阳：攻击几率冰封、灼烧、无明业火、利刃寒锋15时序，根据自身内力削减敌人生命内力",
"Ｗ◇特殊人物：童姥-学会不老长春功，段思平-自带",
}

--newkdef[318阳春白雪曲]=function()
ItemInfo[318]={
"Ｌ习得外功：阳春白雪曲",
"Ｎ",
"Ｗ武功威力：650",
"Ｗ武功气攻：1400",
"Ｗ内力消耗：140",
"Ｗ武功范围：面 4格",
"Ｎ",
"Ｄ组合特效：",


"Ｚ特别说明：无",                                     
}

--newkdef[319一苇渡江]=function()
ItemInfo[319]={
"Ｌ习得轻功：一苇渡江",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇移动格数+1",
"Ｗ◇主运：挨打40%几率增加轻功",
"Ｗ◇被动：集气速度不受异常状态影响",
"Ｗ◇受到封穴减少50%，回合结束后机率减少5~10的封穴",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇免疫迟缓等使集气速度下降的陷阱状态",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇冻结、回魂仙梦等重大影响集气的特效，将转化为封穴值",
"Ｗ◇封穴值不为零时低机率触发闪避（满封穴有25%机率）",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇少林寺：被打出破绽时，减少气攻并获得加速效果。(与瑜珈冲突)",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇扫地：时序机率完全清除封穴",
"Ｗ◇达摩：攻击爆怒状态敌人时，自身增加20点怒气",
}

--newkdef[320狼牙]=function()
ItemInfo[320]={
"Ｇ装备效果；攻击时50%几率造成流血",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：攻击时50%几率造成流血",
"Ｗ◇LV.2：攻击时60%几率造成流血",
"Ｗ◇LV.3：攻击时70%几率造成流血",
"Ｗ◇LV.4：攻击时80%几率造成流血",
"Ｗ◇LV.5：攻击时90%几率造成流血",
"Ｗ◇LV.6（MAX）：攻击时必造成流血，50%机率发动“天狼啸月”",
"Ｄ装备特效：",
 "Ｗ◇“天狼啸月”：造成敌全体集气-100",
}

--newkdef[321井月八法]=function()
ItemInfo[321]={
"Ｌ习得外功：井月八法",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：140",
"Ｗ武功范围：井字 6格",
"Ｎ",
"Ｄ组合特效：井月八法+长生诀",
"Ｗ◇根据自身耍刀系数增伤",
"Ｗ◇不攻：攻击必定灼烧，脆弱状态",
"Ｗ◇击奇：攻击必定冰封，沉睡状态",
"Ｗ◇战定：增加内伤15点，麻痹状态",
"Ｗ◇用谋：增加中毒15点，集气紊乱10-15时序",
"Ｗ◇速战：增加内伤15-30点，杀气200-400点",
"Ｗ◇棋弈：处于封穴状态，封穴50点，扣除敌人20%现有生命值",
"Ｗ◇方圆：处于昏迷状态，敌人阴内冰冻状态增加20-30点，阳内敌人迟缓状态增加1-3层，调和敌人增加流血值20点",
"Ｗ◇兵诈：处于恐惧状态，根据自身刀系增加敌人流血值",
"Ｗ◇胜而后求战·败而后求胜：第一次攻击时，根据敌我内力差全场杀血杀气",
"Ｗ◇特殊人物：寇仲-使用井月八法",
"Ｎ",
"Ｚ特别说明：无",                                        
"Ｗ◇暴击率提升5%",
"Ｗ◇根据学会的刀法提升暴击伤害，一个刀法提升30%", 

}

--newkdef[322擒龙手]=function()
ItemInfo[322]={
"Ｌ习得外功：擒龙手",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：140",
"Ｗ武功范围：米字 5格",
"Ｎ",
"Ｚ组合特效：",
"Ｗ◇必连击",
"Ｗ◇虎鹤双形：擒龙手+虎爪绝户手。",
"Ｗ◇攻击时概率触发“虎啸”、“龙吟”。", 
"Ｗ◇虎啸：周身六格内目标概率混乱", 
"Ｗ◇龙吟：被击的目标击集气位置倒退300。",
"Ｎ",
"Ｄ组合特效：擒龙手+擒龙功",
"Ｗ◇增伤600",
"Ｗ◇攻击时触发内伤、冰封、封穴各10点",
"Ｗ◇擒龙诀·抚琴：移动-4，伤害降低10%1回合",
"Ｗ◇擒龙诀·鼓瑟：无法集气10时序",
"Ｗ◇擒龙诀·批亢：集气倒退10时序",
"Ｗ◇擒龙诀·捣虚：集气停止10时序",
"Ｗ◇攻击时以上效果必出一种",
"Ｗ◇擒龙秘技·捉风捕月：敌人无法移动",
"Ｗ◇擒龙秘技·抟空捕影：敌人无法攻击",
"Ｗ◇擒龙秘技·捕影拿风：随体力受损程度减少生命，体力恢复降低，损耗加倍，体力值低于50时概率进入麻痹状态",
"Ｗ◇擒龙奥义·天锁苍龙：攻击时把敌全体集合在一格内进行攻击",                                       --问题不断
}

--newkdef[23伏魔禅杖]=function()
ItemInfo[323]={
"Ｇ装备效果；伏魔杖法威力+200，增加世尊降魔触发机率(装备等级*2)",
"Ｎ",
"Ｄ装备等级：无",                               -- by 飘夜
}

--newkdef[324般若掌]=function()
ItemInfo[324]={
"Ｌ习得外功：般若掌",
"Ｎ",
"Ｗ武功威力：650",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：140",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：大力金刚掌+般若掌+易筋经",
"Ｗ◇学会易筋经，大力金刚掌必暴击,般若掌攻击范围变成点，威力双倍。",
"Ｗ◇主运易筋经：使用任意拳掌，破防目标30%，几率附加【业力引爆】效果 ",
"Ｎ",
"Ｄ组合特效：般若掌+金刚狮子吼",
"Ｗ◇根据般若掌威力额外附加伤害，攻击附带自身威力的增伤",
"Ｗ◇攻击随着连击次数叠加伤害，连击次数越高，伤害气功越高，当攻击次数达到九及以上时，此次攻击必定命中，达到第十下时，触发万佛朝宗",
"Ｗ◇境智俱寂·心虑安然：触发集中状态时，为自己附加2层般若集中。行动前，敌人集气速度降低，自身集气概率跳气（跟我方轻功有关）。般若集中状态下攻击，概率根据般若掌威力连续削减范围内",
"Ｗ（范围跟拳掌系数有关）敌人的集气和生命值，学会易筋经时，为敌人施加业力引爆，业障缠身",
"Ｗ◇无相般若·忘怀绝相：触发防御状态时，为自己附加2层般若防御。行动前，时序积攒伤害（积攒速度跟防御有关），并引爆，对范围内敌人造成生命损失（范围跟防御有关）。般若防御状态下攻击",
"Ｗ系数判定必然高于敌人，概率为自己套上坚甲效果，学会易筋经时，为敌人上20时序逆杀",
"Ｗ◇慑伏外道·阿伐岂耶：触发蓄力状态时，被攻击时概率打断敌人，反弹金刚力层数*6的伤害，提高自身金刚力层数的集气值。般若蓄力状态下攻击，概率封印敌人，当前生命值过半时",
"Ｗ则概率将消耗自身最大生命值5%，造成范围爆炸，范围内敌人损失该部分生命，学会罗汉伏魔功时，概率为敌人叠加一层“罗汉血”debuff。",
"Ｗ（罗汉血：上限9层，敌人根据层数降低攻击次数，暴击伤害，当叠加到9层时，敌人止杀一回合，并损失900的生命值，移除该buff）",
"Ｗ◇十八种观·令诸法空：触发等待状态时，为自己附加2层般若等待，恢复损失生命值、内力的50%。般若等待状态下被攻击，概率使用般若掌法反击，概率进入霸体状态，并清除低级异常",
"Ｗ◇生死虚妄·诸法无体：触发休息状态时，为自己附加2层般若休息，并套上金刚护盾，对攻击者造成金刚护盾的反伤伤害，主运易筋经时，被攻击增加3~5层“金刚力”。般若休息状态下攻击",
"Ｗ本次攻击必暴击，并为自己积攒3~5层“金刚力”。（金刚力：攻击附带该buff的层数的真伤，最高100层，金刚力持有者攻击罗汉血持有者时，附加真伤为金刚力层数X罗汉血层数）",
"Ｗ◇攻击时学会易筋经时为敌人附加封穴；学会罗汉伏魔功时为敌人附加内伤；学会金刚不坏时为敌人附加流血；学会金刚狮子吼时，削减武功威力的内力",
"Ｗ◇根据自身所学佛法秘籍数量增加行动后进入等待和行动前进入集中的概率",
"Ｄ◇100层金刚力时，攻击概率触发大招，怒气爆发必触发大招",
"Ｗ◇六道尽灭：清除敌人所有怒气值，怒气值削减生命，同时降低敌人解封穴速度，持续流失生命值。敌人基础debuff全满， 30时序内无法解除，自身进入30时序“金刚萨埵”状态",
"Ｗ该状态下敌人全体怒气倒流，持续清除低级异常，攻击变锁定，攻击力翻倍，概率破防，金刚力归0",                       --问题不断
}

--newkdef[325猿公剑法]=function()
ItemInfo[325]={
"Ｌ习得外功：猿公剑法",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：35",
"Ｗ武功范围：线 8格",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：",                                       --飘夜
"Ｗ◇必连击",
}

--newkdef[326白猿]=function()
ItemInfo[326]={
"Ｇ装备效果；猿公剑法/越女剑法威力+200",
"Ｎ",
"Ｄ装备等级：无",                               -- by 飘夜
}

--newkdef[327天魔功]=function()
ItemInfo[327]={
"Ｌ习得外功：天魔功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇吸血20%",
"Ｗ◇攻击必暴击",
"Ｗ◇无视目标30%防御",
"Ｗ◇“天魔大法”：暴怒时30%几率入魔",
"Ｗ◇“天魔大法”：免疫封穴杀气，额外吸血20%，必连击概率三连击",
"Ｗ◇“天魔大法”：暴怒结束入魔结束",
"Ｗ◇“天魔金身”：受攻击时如自身生命值低于一半，免疫攻击10时序，CD50时序",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇行动后增加10点怒气值",
"Ｗ◇无视目标10%防御",
"Ｎ",
"Ｄ组合效果：天魔策+大周天",
"Ｗ◇免疫大部分怒气值减少",
"Ｗ◇怒气爆发时，首次攻击敌我均无法回复生命，攻击压制敌人生命上限",
"Ｎ",
"Ｄ组合效果：天魔功+吸星大法",
"Ｗ◇暴怒可以额外持续一回合",
"Ｎ",
"Ｄ组合效果：天魔功+血河神鉴",
"Ｗ◇进场后全场敌人附加血河印，敌人攻击时误伤（非击中）攻击范围额外增加周身5X5，攻击时根据自身怒气概率进入精神错乱状态，并随机选取一个额外友军目标误伤，暴怒时必触发",
"Ｗ◇当血河印持有者误伤友军时，恢复幽冥血海持有者的生命",
"Ｎ",
"Ｄ组合效果：主运天魔功+易筋神功+忘情天书",
"Ｗ◇主运增加700血量上限，免疫业力引爆效果，攻击随自身资质、内力、道德增加伤害，自身内力越高、道德越低、资质越靠近50增伤越多，攻击命中敌人后，附加无法复活状态",
"Ｗ◇开场有一半机率触发「魔佛诗号」：",
"Ｗ◇自身增加200集气，并使敌方全体陷入集气紊乱10时序",
"Ｗ◇声声句句鬼如来：战斗出场发动时给予全场我方「鬼如来」特效（我方立刻进入怒气爆发状态，并入魔）",
"Ｗ◇天魔气场：周身八格内的敌人，被附加虚弱状态，若敌人在自身八格内怒气爆发，集气速度进入波动状态",
"Ｗ◇魔之战息：每次行动后，增加己身怒气。若行动后怒气爆发，增加自身回气并下回合提升一定伤害",
"Ｗ◇魔问伪佛：道德越低，攻防效果越强，面对少林派再额外加强，并在攻击时对少林寺门人附加度化效果，敌人行动6回合后转化为我方",
"Ｗ◇邪心魔佛·天魔金身：触发天魔金身时,几率延长有效时间，被攻击几率增加自身集气。天魔金身解除时几率爆怒，并对全场附加恐惧状态",
"Ｗ◇天魔啸：行动前机率使全场敌方降怒气20点",
"Ｗ◇佛魔化身：被攻击时血量低于1000时，第一次必定触发，之后低几率触发",
"Ｗ◇  （可召唤出一个复制体，可以复制主角除「出生自带以外」的所有天赋和练组合者的特质。此复制体不可控，当练组合者死亡时，复制体会代替死亡）",
"Ｗ",
"Ｗ◇天魔金身强化：天魔组合所发动的天魔金身，有效时序延长至「30～50时序」，且天魔金身发动期间，免疫「一切」扣血效果，天魔组合的天魔金身冷却时间减半，机率清空天魔金身的冷却期；天魔功行动后若暴怒，则必然清空天魔金身的冷却。（非组合所发动的金身，免疫伤害的效果不变（吃空挥），持续时间增加），天魔金身需要自身内力值高于敌方所使用的武功耗内值之30倍以上才有效",
"Ｗ",
"Ｗ",
"Ｗ◇使用任意指系武学攻击",
"Ｗ◇若敌方身上有金刚盾，则大幅度提升破盾机率，并依据敌方金刚护盾数值增加伤害",
"Ｗ◇破甲尖锋七旋指：以指系数加成伤害后再增加7%~49%，爆怒时额外再增加7%~49%，且低机率清零敌方护盾（九阳、太极等），减少敌方10～70％的防御力，并且敌方套装所附带的天赋特效无法发动",
"Ｗ",
"Ｗ◇使用任意刀系武学攻击",
"Ｗ◇如是我斩：当我方道德低于敌方时，根据道德差距附加气攻；当道德差距大于30时，使用刀法攻击必然破气防且无视敌方50%的防御力；攻击力上升，并依照敌我道德差和自身战意附加真实伤害与撕裂状态",
"Ｗ",
"Ｗ◇(以上道德差距的要求，若敌方为少林寺时不在此限，必然发动)",
"Ｗ◇天赋魔道天行-主运天魔即可享有组合",
}

--newkdef[328庄子]=function()
ItemInfo[328]={
"Ｌ习得内功：大周天功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每5时序回复1点内伤",
"Ｗ◇大宗师概率50%概率",
"Ｗ◇“养生主概率50%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇封穴减少50%",
"Ｗ◇“大宗师”：攻击30%概率触发，无视对方80%的武常。",
"Ｗ◇“养生主”：被攻击30%触发50时序内，时序回复气血2/内力4，",
"Ｗ           免疫封穴，时序免疫所有攻击内伤",
"Ｎ",
"Ｄ组合效果：罗汉伏魔功+大周天or小周天",
"Ｗ◇被攻击减伤400点，增加6点集气，行动后恢复",
"Ｗ◇罗汉小周天调息：攻击时触发，自身恢复200点生命、400点内力、4点体力、4点内伤、4点中毒 ",
"Ｗ◇特殊人物：达摩-自带",
"Ｎ",
"Ｄ组合效果：天魔功+大周天",
"Ｗ◇免疫大部分怒气值减少",
"Ｗ◇怒气爆发时，首次攻击敌我均无法回复生命，攻击压制敌人生命上限",
"Ｎ",
"Ｄ组合效果：龟息功+大周天",
"Ｗ◇在战斗中，被攻击几率增加防御值，增加20%免疫反击几率",
"Ｗ◇护身甲盾·坚不可摧：被攻击第一下，如果受到的伤害大于自身生命50%，则减伤一半，每降低1%生命，减伤增加1%",
"Ｗ◇蓄势待发·以守为攻：攻击几率根据敌方攻击力、我方防御力之和的10%附加伤害",
"Ｗ◇殊死一搏：被攻击减少5点封穴值，几率根据我方防御力与敌方攻击力之和的部分削减敌人生命值与内力、反弹敌方5点封穴值",
"Ｗ◇特殊人物：张三丰-无条件触发",
"Ｎ",
"Ｄ组合特效：主运大周天+吸星大法",
"Ｗ◇三垣效果必触发，其他攻防效果依然有机率判定",
"Ｗ◇万星周环聚天珩：",
"Ｗ◇ 自身10X10的范围内，敌方有流血则会时序减少5点血量，组合者时序增加血量",
"Ｗ◇双主星（恒常发动）：",
"Ｗ◇ 太阴星力：攻击机率附加冰冻，满怒气必然附加冰冻，低机率冻结；自身完全免疫冰封，自己时序清除冰冻、冻结，队友加入清除冰封、冰冻",
"Ｗ◇ 太阳星力：攻击必灼烧，机率附加火毒攻心；满怒气必然附加火毒，低机率点燃敌方；自身免疫灼烧，时序清除点燃；队友加速清除灼烧",
"Ｗ◇三垣星力（切换发动）：",
"Ｗ◇战斗进场后触发，开场为天市垣。接下来依照天市>太微>紫薇>天市的顺序触发，每30时序切换",
"Ｗ◇ 天市垣：敌方全场进入集气波动状态，被攻击时小幅减伤并机率打断连击。切换成太微垣时，全场敌人依内力缺失程度扣除生命",
"Ｗ◇ 太微垣：自身集气速度上升，战意增幅上升，攻防时依据同系武功的威力总和进行攻防加成。切换成紫薇垣时，回血回内并清除负面状态",
"Ｗ◇ 紫薇垣：全场敌方集气速度减半。被攻击时视为误伤。攻击必定极意并附加内伤、散功状态。切换到天市垣时，全场敌方集气位置强制为-400",
"Ｗ◇特殊人物：任我行-学会吸星",
}

--newkdef[329奔雷手]=function()
ItemInfo[329]={
"Ｌ习得外功：奔雷手",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：105",
"Ｗ武功范围：米字 5格",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：",                                       --飘夜
}


--newkdef[330追魂夺命剑谱]=function()
ItemInfo[330]={
"Ｌ习得外功：追魂夺命剑法",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：70",
"Ｗ武功范围：线 8格",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：",                                       --飘夜
}

--newkdef[331庖丁解牛刀]=function()
ItemInfo[331]={
"Ｌ习得外功：庖丁解牛刀",
"Ｎ",
"Ｗ武功威力：750",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：140",
"Ｗ武功范围：《 7格",
"Ｎ",
"Ｄ组合特效：庖丁解牛刀+大周天功",
"Ｗ◇根据自身真实刀法增伤",
"Ｗ◇以下皆独立计算几率触发",
"Ｗ◇高几率造成流血",
"Ｗ◇族庖月更刀：附加800气攻，对敌附加虚弱状态",
"Ｗ◇良庖月更刀：我方所有成员，一定时序内获得「神兵」状态，伤害及气攻大幅上升。练组合者若是满怒气则可再附加兵器攻击力的伤害（不计入血淬加成）",
"Ｗ◇无厚入有间：攻击者的装备攻击力若大于被攻击者装备防御力，则附加流血、撕裂，并扣除敌我装备攻防相减后的数值（有上限）",
"Ｗ◇游刃似有馀：攻击后回气，若触发时满怒气则附加10时序的集气速度上升",
"Ｗ◇解牛数千回：必然追加一次连击，并额外上升十点战意",
"Ｗ◇刀刃若新发：被攻击者有流血时触发，为自己附加血淬特效",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇良庖岁更刀：敌人生命值低于50%时，额外附加最大生命值5%的伤害",
"Ｗ◇良庖岁更刀：敌人生命值低于30%时，额外附加敌人当前生命值的伤害",                                       --问题不断
}

--newkdef[332袈裟伏魔功]=function()
ItemInfo[332]={
"Ｌ习得外功：袈裟伏魔功",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：140",
"Ｗ武功范围：面 3格",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：",                                       --飘夜
}


--newkdef[333迷踪连环腿]=function()
ItemInfo[333]={
"Ｌ习得外功：黯影迷踪",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇每回合结束后，低机率为自己附加「隐蔽状态」（不与明教「遁入暗影」效果叠加）（隐蔽：时序内隐蔽，出后解除）",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇隐蔽延长，隐蔽期间集气速度上升，隐蔽状态下出手伤害提升",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇隐蔽状态下如果集气位置超过750，机率立即出手，隐蔽状态下出手攻击有机率触发以下效果：",
"Ｗ◇必中，敌方如果有隐蔽状态则根据敌方隐蔽数值附加真实伤害且清除隐蔽",
"Ｗ◇为敌方附加负面状态",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇出手解除隐蔽或时序解除隐蔽后机率附加怒气",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇明教：当战场上有明教弟子使用自爆指令后，其他明教弟子机率暴怒",
}




--newkdef[334无极玄功拳]=function()
ItemInfo[334]={
"Ｌ习得外功：无极玄功拳",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：70",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                       --飘夜
}




--newkdef[335白龙剑]=function()
ItemInfo[335]={
"Ｇ装备效果；剑法攻击范围+1",
"Ｎ",
"Ｄ装备等级：无",                               -- by 飘夜
}




--newkdef[336武穆遗书]=function()
ItemInfo[336]={
"Ｌ习得特技：武穆遗书",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇根据（实战数值/2）增加战场攻击力",
"Ｗ◇根据（实战数值/2）增加战场防御力",
"Ｎ",
"Ｄ被动效果：",
"Ｗ我方全体攻击增加（实战数值/25）%",
"Ｎ",
"Ｄ组合特效：武穆遗书+长生诀or神照经",
"Ｗ◇野生逮虾户：提高自身集气上限为100，行动后回气200，回气上限提高至700",
"Ｎ",
"Ｄ组合特效：武穆遗书+怒涛海潮功",
"Ｗ◇兵势攻奇：攻击时根据敌人当前集气位置追加额外伤害，当敌人当前集气位置低于-100时，追加麻痹不起、感电状态",
"Ｗ◇军形练体：被攻击时根据自身体质概率免疫基础杀气、减少敌人伤害增加、增加自身负面抗性",
"Ｗ◇马不停蹄：行动后根据自身移动格数提升自身集气位置，如果自身移动步数至少9格时，则概率进入再次行动（随移动格数增大概率）",
"Ｗ◇特殊人物：岳云-学会武穆遗书",
"Ｎ",
"Ｄ组合特效：忘情天书+武穆遗书+逍遥游",
"Ｗ◇被攻击时触发自身格挡状态，根据第1天赋外功进行反击",
"Ｗ◇被攻击时可触发暗器反击，根据自身拳、剑、特三系效果增加伤害",
"Ｗ◇沛然有雨·清风徐来：休息时恢复生命、内力，减少内伤，中毒",
"Ｗ◇特殊人物：乔峰、洪七公、南子、陆刃自带",
}




--newkdef[337岳王散手]=function()
ItemInfo[337]={
"Ｌ习得外功：岳王散手",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：140",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：岳王散手+武穆遗书",
"Ｗ◇增伤600，",
"Ｗ◇根据自身指系增加集气速度，最高可提升20点",
"Ｗ◇根据自身指系增加岳王散手攻击范围",
"Ｗ◇岳王散手攻击移动为10格",
"Ｗ◇散手诀：共6式，攻击时必触发1式，根据不同招式增加6点负面状态值",
"Ｗ◇岳王散手·云雾手：被攻击的敌人处于无明业火状态，敌全体刺目效果",
"Ｗ◇岳王散手·托塔手：被攻击的敌人处于迟缓状态，敌全体冻结15时序",
"Ｗ◇岳王散手·偷桃手：被攻击的敌人处于混乱状态，敌全体无法进行攻击",
"Ｗ◇岳王散手·气盈力充：攻击时恢复自身生命150点，内力300点，体力、内伤、中毒各3点",
"Ｎ",
"Ｄ配套插件：岳家枪法",
"Ｗ◇醉卧沙场君莫笑·古来征战几人回：几率触发攻击随怒气附加10~20点真实伤害，暴怒时增加2次",
"Ｗ◇壮志难酬·怒发冲冠：几率触发攻击增加5点怒气",
"Ｎ",
"Ｚ特别说明：",                      
"Ｗ◇习得岳王散手后，再学习岳家枪法的需求降低40点",                                      --问题不断
}

--newkdef[386岳家枪法]=function()
ItemInfo[386]={
"Ｌ习得外功：岳家枪法",
"Ｎ",
"Ｗ武功威力：750",
"Ｗ武功气攻：1500",
"Ｗ内力消耗：140",
"Ｗ武功范围：米字 6格",
"Ｎ",
"Ｄ组合特效：岳家枪法+武穆遗书",
"Ｗ◇根据自身最大生命值/15增伤",
"Ｗ◇攻击必定无视闪避，必破防10%",
"Ｗ◇岳家枪法：攻击时必触发一种基础负面状态（除中毒），根据此状态3倍数值减少生命",
"Ｗ◇岳家枪绝·大漠孤烟：攻击时触发红莲劫焰，掉血350点，附加除中毒外的基础负面状态各20点",
"Ｗ◇岳家枪绝·长河落日：根据自身特系、内力为基础触发伤害，特系值扣除内力，昏迷1回合",
"Ｎ",
"Ｄ配套插件：岳家掌法",
"Ｗ◇醉卧沙场君莫笑·古来征战几人回：几率触发攻击随怒气附加10~20点真实伤害，暴怒时增加2次",
"Ｗ◇壮志难酬·怒发冲冠：几率触发攻击增加5点怒气",
"Ｎ",
"Ｄ组合特效：杨家/中平/呼延/岳家枪法（其中之一）+特系数350以上，完成夜雨楼击杀豪侠的任务（无论是不是夜雨楼杀手），南子传授",
"Ｗ◇燎原百击(以杨家枪、呼延枪、中平枪或岳家枪法攻击",
"Ｗ◇二十针：",
"Ｗ◇攻击敌方时，根据敌方灼烧值附加封穴，并在敌方体内埋下「燎原枪焰」",
"Ｗ◇燎原枪焰：当身有燎原枪焰的敌人封穴值为0时，枪焰爆发，附加集气紊乱、点燃并根据当前灼烧值靠除血量",
"Ｗ◇当敌方封穴值大于等于灼烧值时：直接根据敌方封穴值扣减集气，并降低气防。满怒气时必定破防",
"Ｗ◇当敌方灼烧值大于等于封穴值时：根据灼烧值附加内伤，机率附加重度内伤",
"Ｗ◇三十击:",
"Ｗ◇无定击：第一击时触发，自身八格内敌人遭受一定程度的真实伤害，并提升自身战意",
"Ｗ◇雨暴风狂：强行降低敌方战意，并依据敌我战意差计算机率，使敌方进入恐惧、虚弱状态",
"Ｗ◇迭浪千重：根据自身内力和连击数增加伤害。战意爆发时触发破甲效果",
"Ｗ◇威凌天下：自身怒气满时触发，第一击时为全屏攻击，并为自身加一层九阳气罩",
"Ｗ◇五十式:",
"Ｗ◇斜挑式：此次攻击必定命中破绽",
"Ｗ◇横扫式：此次攻击变为极意攻击，并必定暴击",
"Ｗ◇格勾式：此次攻击特系数以6666计算",
"Ｗ◇无枪式：蓄力后攻击时机率触发必中，并发挥空挥效果，根据自身灼烧对全场敌方扣除血量、体力",
"Ｗ◇主运极阴无相并极阴无相到极的特殊效果：燎原冷焰",
"Ｗ◇比较敌方冰封值和灼烧值，以高者为准，使二者相等",
"Ｗ◇敌方处于冰冻状态时上点燃、敌方处于点燃状态时上冰冻",
"Ｎ",
"Ｚ特别说明：",                      
"Ｗ◇习得岳家枪法后，再学习岳王散手的需求降低40点",                                      --问题不断
"Ｎ",
"Ｄ组合特效：岳家枪法+龙啸九天",
"Ｗ◇攻击非连击时可增加1次攻击次数",
"Ｗ◇霸王枪诀·力拔山河：战意爆发触发，敌人左右、连击无效（华山林朝英奖励除外）",
"Ｗ◇霸王枪诀·天下无双：攻击时敌全体非调和内力会触发举火燎原、霸王破甲、冰心状态各10时序，附加10点封穴值",
"Ｗ◇霸王枪诀·力拔山河：攻击时敌全体集气速度-15点",
"Ｗ◇霸王枪诀·破釜沉舟：攻击时附加1200气功，9*9攻击范围，恢复25%最大生命、内力值，50点体力，清除高级异常，附加一些列debuff",
"Ｗ◇特殊人物：梵洛音使用岳家枪法攻击时即可触发，无需内功",
}

--newkdef[338冰蚕毒掌]=function()
ItemInfo[338]={
"Ｌ习得外功：冰蚕毒掌",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：105",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇毒布武林：同时修炼五毒神掌/五毒神功/冰蚕毒掌",
"Ｗ◇毒布武林：五毒神掌/五毒神功/冰蚕毒掌威力提升300点",
"Ｗ◇毒布武林：行动前使全场敌人中毒,随着用施毒能力增加而增加，并几率叠加随机负面状态，扣减敌方中毒值的血量",
}

--newkdef[339青驴]=function()
ItemInfo[339]={
"Ｇ装备效果；集气速度增加5点，体力消耗减2点",
	}	                            -- by 飘夜


--newkdef[340寒袖拂穴]=function()
ItemInfo[340]={
"Ｌ习得外功：寒袖拂穴",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：105",
"Ｗ武功范围：面攻 4格",
"Ｎ",
"Ｄ组合特效：寒袖拂穴+小无相功",
"Ｗ◇根据敌人3倍内伤、冰封值，内力值/25增加伤害",
"Ｗ◇1.根据自身指系几率扣除相应生命值",
"Ｗ◇2.攻击时附加冰封值25点，锁足一回合，敌人冰封值超过50点时进入昏迷状态",
"Ｗ◇3.攻击时附加封穴值10点，敌人封穴值超过50点时进入创伤状态50时序",
"Ｗ◇4.攻击时附加内伤值15点，敌人内伤值超过50点时无法攻击一回合",
"Ｗ◇特殊人物：逍遥子、李秋水-自带2、3、4条",
"Ｎ",
"Ｚ特别说明：",     
"Ｗ◇必定封穴",                                  --问题不断
}

--newkdef[341白虹掌力]=function()
ItemInfo[341]={
"Ｌ习得外功：白虹掌力",
"Ｎ",
"Ｗ武功威力：550",
"Ｗ武功气攻：1100",
"Ｗ内力消耗：105",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：",

"Ｚ特别说明：",                                       --飘夜
}

--newkdef[342长生诀]=function()
ItemInfo[342]={
"Ｌ习得内功：长生诀",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇免疫内伤",
"Ｗ◇减少30%受到的气攻",
"Ｗ◇重生回复满血并立即行动",
"Ｗ◇时序回点3点气血",
"Ｗ◇顾道长生：被攻击时25%概率触发，5时序内每时序恢复最大生命内力1%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇重生回复(50~65)%的气血",
"Ｗ◇阴阳相生：攻击造成灼烧时必定造成冰封，造成冰封时必定造成灼烧",
"Ｎ",
"Ｄ组合特效：武穆遗书+长生诀or神照经",
"Ｗ◇野生逮虾户：提高自身集气上限为100，行动后回气200，回气上限提高至700",
"Ｎ",
"Ｄ组合特效：主运长生诀+纯阳无极+碧海潮生+八荒六合功",
"Ｗ◇主运增加1000最大血量，被攻击时根据自身当前生命值减伤，最少减少特效伤害30%",
"Ｗ◇长生真气：开场自带7层长生真气。真气会让所有加血效果翻倍，降低最终伤害以及所有杀气效果衰减30％",
"Ｗ◇长生真气被打时会削减一层。每过25时序回复一层，如果触发回血效果时，回血量+当前血量超过最大生命值，则加速长生真气的回复",
"Ｗ◇长生蓄力：被打时根据伤害增加蓄力值，且身上若有太极、蛤蟆、鲸息等蓄力，会复制等值的量增加长生蓄力值，长生蓄力值最高3000",
"Ｗ◇长生蓄力可以增幅攻击伤害，攻击时若超过1000蓄力，则超过部分会降低敌方防御力；超过1500的部分，则机率扣除敌方与超过部分等值的血量",
"Ｗ◇长生·天人：有以下三种效果：",
"Ｗ◇若触发蓄力指令，则高机率为自己附加「神兵」状态。低机率为附加「战神状态」",
"Ｗ◇战神：攻击力大幅提升，攻击必定击中破绽，无法被杀气，攻击时会依据敌方身上的基础异常，附加对应的强大debuff状态（例如灼烧 → 点燃）",
"Ｗ◇若触发防御指令，则高机率为自己附加坚甲，低机率会自己附加霸体",
"Ｗ◇若触发休息指令，则高机率为自己回复100点血、200点内与10点体力，并附加天香续命、五宝花蜜酒等buff状态。低机率附加300回气。若自身血量低于15％，低机率回满血",
"Ｗ◇以上效果可以用装备、武功自动触发的蓄力、防御、休息指令带出",
"Ｗ◇长生·合道：战斗后有低机率增加资质。装备附加的三围、五系加成翻倍。生命大于50％时，全局机率判定+10％",
"Ｗ◇长生·重生：解除复活次数限制，可以多次复活。随复活次数提升，复活机率逐渐下降（保底15％），回复的血内体也下降，但会获得越来越强的攻、防、速加成",
"Ｗ◇重生第二次开始，复活时打断对手连击。重生第三次开始，解除集气上限；重生第五次开始，一旦暴怒就不会退出",
"Ｗ◇特殊人物：寇仲、徐子陵-主运长生诀享受「長生·天人」特效以及「長生蓄力」特效，覺醒之後自帶所有長生訣組合特效且無需主运",
"Ｗ◇天赋顾道长生-主运长生诀即可享有组合效果，内力上限增加2000点",
}

ItemInfo[346]={
"Ｌ四大山皮肤",
"Ｎ",
"Ｌ至尊江湖，至尊江湖，绿色国产单机武侠，至尊江湖倒闭了。",
"Ｌ王八蛋老板四大山,吃喝嫖赌欠下了3.5个亿，带着他的小姨子跑了。",
"Ｌ我们没有没有办法，拿着皮肤抵工资。",
"Ｌ原价都是三百多、二百多、一百多的皮肤，通通二十块，通通二十块！",
                                     --飘夜
}

ItemInfo[349]={
"Ｇ装备效果；进战集气增加900，必流血，破防5%",
"Ｎ",
"Ｄ装备等级：",
"Ｗ◇LV.1：破防5%",
"Ｗ◇LV.2：破防10%",
"Ｗ◇LV.3：破防15%",
"Ｗ◇LV.4：破防25%",
"Ｗ◇LV.5：破防25%",
"Ｗ◇LV.6（MAX）：破防30%，必破气防"                            
}

--newkdef[350玉女素心剑法]=function()
ItemInfo[350]={
"Ｌ习得外功：玉女素心剑法",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：400",
"Ｗ武功范围：《 8格",
"Ｎ",
"Ｄ组合特效：玉女素心剑法+主运玉女心经",
"Ｗ◇双剑合璧：防守时触发<双剑合壁.守>，免疫破绽，免疫被杀气到-100以下",
"Ｗ◇战场上只要有触发攻击，该攻击回合的御剑系数为「原始御剑系数X攻击次数」",
"Ｗ◇被剑法攻击时必然格档，用其他武功则机率格档（古墓派：减少等同于御剑系数的攻击）",
"Ｗ◇攻击时独立20%几率，无视任何条件触发左右互搏；触发左右互搏时使用玉女素心剑伤害增加、气攻翻倍，触发左右互搏真谛追击第二次互搏时，可触发「纤手翩剑脱红尘」特效，",
"Ｗ◇战场上所有御剑系数低于攻击者的敌人，都会被附加虚弱状态、机率减少等同于御剑系数差距的血量（上限500），并根据御剑系数较低的人数，强杀全场敌人的集气，并增加自己下回合的回气量",
"Ｗ◇攻击无误伤，必中破绽，免疫打断左右特效",
"Ｎ",
"Ｄ配套插件：先天功",
"Ｗ◇使用玉女素心剑法攻击可同时触发玉女剑法组合与全真剑法组合",
"Ｗ◇攻击附加自己2倍御剑值的伤害，附加1~1.5倍的气攻",
"Ｗ◇如果攻击触发左右互搏，则再次附加2倍御剑值的伤害及同归剑法，伤害翻倍",
"Ｗ◇特殊人物：林朝英-使用玉女素心剑",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇增加连击率",                                         --问题不断
}


ItemInfo[351]={
"Ｌ习得内功：擒龙功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇免疫反弹 反击，斗转",
"Ｗ◇增加丐世无双触发概率10%",
"Ｗ◇降龙打狗招式概率增加5%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇时序回复流血2点",
"Ｗ◇丐世无双学会其中一种另一种要求再降低20",
"Ｗ◇降龙极意概率高于等于40增加概率10",
"Ｗ◇降龙极意概率低于40增加概率20",
"Ｗ◇增加打狗极意20%",
"Ｗ◇吸收20%受到的伤害，降低25%受到的杀气。",
"Ｗ◇完全免疫反击、斗转",
"Ｗ◇完全免疫「单内功」或「单天赋」所带来的伤害转移（例如斗转主运、甩锅天赋等）",
"Ｗ◇有40%固定机率免疫「内功组合」带来的伤害反弹（例如太极纯阳反弹）",
"Ｎ",
"Ｄ组合特效：主运擒龙功+罗汉伏魔功",
"Ｗ◇飞龙：集气位置不会低于250，暴怒时集气速度2倍，战意爆发时集气速度2倍",
"Ｗ◇潜龙：行动后几率自动防御，防御状态下集气位置不会低于500，行动后下回合增加本次连击次数的倍数伤害",
"Ｗ◇亢龙：攻击时根据自身暴击几率追加额外伤害",
"Ｗ◇双龙：几率连击次数翻倍，如果连击被打断，伤害计算到下次攻击",
"Ｗ◇擒龙战技·狂龙怒息：自身气攻越高，伤害越高",
"Ｗ◇擒龙奥义·困龙升天：攻击时几率附加负面状态给敌人",
"Ｗ◇触发休息时，生命值半血以上自动蓄力，半血以下自动防御",
"Ｗ◇特殊人物：洪七公-主运擒龙功，乔峰-学会擒龙功",
}

ItemInfo[352]={
"Ｌ习得外功：呼延鞭法",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：15",
"Ｗ武功范围：田 4格",
"Ｎ",
"Ｄ组合特效：呼延枪法+呼延鞭法",
"Ｗ◇寸长寸强：使用奇门武功攻击伤害随距离增加而增长",
}

ItemInfo[353]={
"Ｌ习得外功：震天铁掌",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：390",
"Ｗ武功范围：米 4格",
}

ItemInfo[354]={
"Ｌ习得内功：枯荣禅功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇免疫流血",
"Ｗ◇指法出招式概率+20%",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇时序回复内力3点",
"Ｗ◇亦枯亦荣：每回合消耗内力最大值的5%回复生命值",
"Ｗ◇一阳指威力增加200，六脉神剑“剑气碧烟横”出招增加10%",
"Ｗ◇指法出招式概率+10%",
"Ｎ",
"Ｄ组合特效：枯荣禅功+冰火阴阳诀or天南易阳决",
"Ｗ◇附加内力最大值5%的伤害",
"Ｗ◇枯禅真诀·气护心脉：概率消耗600内力减伤60%+600固定减伤，大理门人进入转龙呼吸状态",
"Ｗ◇枯禅真诀·气锁周天：概率点燃敌人并附加封穴",
"Ｗ◇特殊人物：段思平-自带，枯荣-学会枯荣禅功",
"Ｎ",
"Ｄ组合特效：枯荣禅功+罗汉伏魔功+龙行虎步",
"Ｗ◇秘传·混元一气：被攻击者时序增加6点封穴值，减少1点体力，持续20时序",
"Ｗ◇秘传·双龙出海：被攻击者时序增加15点内伤值，根据现有内力值的0.6%时序降低生命，持续20时序",
"Ｗ◇秘传·气法自然：攻击后消耗自身现有内力的1%恢复自身生命值，持续15时序",
"Ｗ◇特殊人物：段思平、剑太一 自带",
}

ItemInfo[355]={
"Ｌ习得内功：少林心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇被攻击减伤200",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习易筋经一脉相承",
}

ItemInfo[356]={
"Ｌ习得内功：武当心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇被攻击减伤25%",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习太极神功一脉相承",
}

ItemInfo[357]={
"Ｌ习得内功：全真心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击后恢复100点生命内力、3点体力",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习先天功一脉相承",
}


ItemInfo[358]={
"Ｌ习得内功：古墓心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇战场轻功增加150点",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习玉女心经一脉相承",
}

ItemInfo[359]={
"Ｌ习得内功：华山心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习紫霞神功一脉相承",
}

ItemInfo[360]={
"Ｌ习得内功：嵩山心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习寒冰真气一脉相承",
}

ItemInfo[361]={
"Ｌ习得内功：血刀心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习血河神鉴一脉相承", 
}

ItemInfo[362]={
"Ｌ习得内功：莲花功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习擒龙功一脉相承",
}

ItemInfo[363]={
"Ｌ习得内功：地火功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习圣火神功一脉相承",
}

ItemInfo[364]={
"Ｌ习得内功：峨眉心法",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｎ",
}

ItemInfo[365]={
"Ｌ习得内功：小星罗功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇5时序回复内伤1",
"Ｎ",
"Ｄ被动效果：",
"Ｎ",
"Ｄ组合特效：小周天功+小星罗功",
"Ｗ◇群星之力·星曜：根据在场全部人数减低自己所受的伤害，每多一人，多减少5％的伤害，16人为上限",
"Ｗ◇群星之力·天河：根据在场敌人人数，行动前回复己方血、内、体，每多一人，多回复上限2％",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习吸星大法一脉相承",
}

ItemInfo[366]={
"Ｌ习得内功：寒冰真气",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇拳法武功出招+20%",
"Ｗ◇对冰封值超过80的人概率冻结",
"Ｗ◇5时序回内伤1点",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇拳法武功出招+10%",
"Ｗ◇攻击必冰封",
"Ｗ◇免疫冰封",
"Ｗ◇万岳朝宗攻击力上升100点，使用万岳朝宗机率触发「中岳如座」",
"Ｗ◇ 30%概额外减伤100-180点。",
"Ｎ",
"Ｄ组合特效：寒冰真气or易水寒+紫霞神功",
"Ｗ◇寒冰真气·如履薄冰：攻击概率降低敌人集气",
"Ｗ◇寒冰真气·冰散瓦解：攻击概率使敌人集气波动",
"Ｗ◇寒冰真气·霜冻长河：攻击概率冻结敌人",
"Ｗ◇攻击附加8点冰封，根据自身内力和敌人冰封程度增伤",
"Ｗ◇特殊人物：左冷禅-自带",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习五岳剑诀一脉相承，限定五岳派",
}

ItemInfo[367]={
"Ｌ习得内功：五毒神功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇五毒神掌威力提升350点，战斗中基础威力随机提升1-3倍",
"Ｗ◇五毒神掌变为赤练神掌，追加70点伤害，引爆目标身上毒素",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击强制上毒20点",
"Ｗ◇攻击时根据目标中毒值追加伤害",
"Ｎ",
"Ｄ组合特效：化功大法+五毒神功",
"Ｗ◇化功秘录·万毒缠身：攻击时根据敌人中毒程度抽取生命，根据自身中毒程度抽取内力，触发化功大法吸内特效时引发毒爆",
"Ｗ◇免疫毒性爆发伤害",
"Ｗ◇特殊人物：丁春秋-学会化功大法，逍遥子-无条件触发",
}
--223
ItemInfo[368]={
"Ｌ习得轻功：金雁功",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇无视限制移动，移动格数+1",
"Ｗ◇连击、暴击率增加20%，连击、暴击伤害增加20%",
"Ｗ◇气攻、气防增加777",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇增加可移动范围，行动后根据移动步数回气（与其他回气效果可叠加），突破回气限制",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇额外条件：取得射雕天书",
"Ｗ◇移动前记录当前位置，当被攻击时移动回上一回合移动前的位置",
"Ｗ◇移动后机率回复少量血内体或消耗500内力、10点体力清除debuff",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇移动后根据移动步数增加暴击机率，若暴击则根据移动步数额外增加暴击伤害，低机率附加恐惧",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇全真教：回气量额外上升",
"Ｗ◇不主运先天功：额外低机率被攻击时触发先天护盾",
"Ｗ◇主运先天功：减少20时序先天护盾CD",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇王重阳：触发重生之后，每次行动后会补充移动步数10~50倍的先天护盾值。",
}
--224
ItemInfo[369]={
"Ｌ习得内功：蛇行狸翻",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇移动格数+2",
"Ｗ◇每20时序，（轻功值）%机率集气往前随机跳气(封穴状态下无效)",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇集气跳跃量上升，被封穴依然可以跳气，每一次跳气都有机率对所有集气位置低于自己的敌人附加迟缓状态",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇當自身的集氣位置低於他人時，有機率可以將自己拉到跟場上集氣位置最靠前者相同的集氣位置",
"Ｗ◇主运九陰，发动高阶效果时，则是集气位置最高者与主角互换集气位置",
"Ｗ◇主运逆运，发动高阶效果时，有小机率直接怒气爆发",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇跳气发动时，低机率为敌方附加「仓惶」状态10时序",
"Ｗ◇仓惶：每一时序都有机率集气位置减少20~100",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇黄裳：跳气发动机率提升，跳气发动时必然给敌人附加迟缓",
}

ItemInfo[370]={
"Ｌ习得外功：葵花点穴手",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：105",
"Ｗ武功范围：▽ 7格",
"Ｎ",
"Ｄ组合特效：葵花点穴手+透骨打穴",
"Ｗ◇被封穴者，每次触发解除封穴效果时，有一半几率失败，若成功减少封穴则增加对应的内伤",
"Ｗ◇攻击被封穴者时，根据当前封穴值增加伤害并减少战意、几率破气防、自身怒气爆发时伤害更高",
"Ｗ◇当敌方满封穴时，则必然附加脆弱状态，并必破气防，减少防御力",
"Ｎ",
"Ｄ组合特效：葵花点穴手+兰花拂穴手",
"Ｗ◇被封穴者，每次触发解除封穴效果时，有一半几率在解除时减少一半或1/4的解除量",
"Ｗ◇自身解封穴速度上升，被封穴时的封穴抗性加强",
"Ｗ◇攻击敌方时，敌方增加的怒气减少，减少幅度与封穴程度成正比。同时敌方怒气越高伤害越高",
"Ｎ",
"Ｄ组合特效：葵花点穴手+透骨or兰花手+寒袖拂穴",
"Ｗ◇根据自身面板指法技巧、暗器值增伤，葵花点穴手威力+300",
"Ｗ◇攻击时无视封穴抗性，几率无视封穴免疫，强制上封穴",
"Ｗ◇攻击时几率附加封气绝脉效果、触发极意",
"Ｗ◇攻击时若击中破绽，附加等同于封穴值X破綻次數的真实伤害",
"Ｗ◇被攻击者若被封穴，则会对敌方种下「锁穴奇劲」封穴期间会不断吸收普通异常（只记录数值而已）",
"Ｗ◇被任何人攻击时根据攻击者内力属性上状态，（阳内：点燃；阴内：冰冻+扣血；调和：撕裂；天罡：前三者任一）",
"Ｗ◇当解除封穴、锁穴奇劲超过5000以上几率被引爆或仍有封穴但触发其他立即行动特效时，根据记录的数值扣除血内体，战意减半并止杀一回合，奇劲爆发无法致死，但爆发后若生命低于7％，则有低几率即死",
"Ｗ",
"Ｎ",
"Ｄ◇配套插件：主运葵花宝典",
"Ｗ◇葵花指法威力随机2~4倍，前三次攻击一般断连击",
"Ｗ◇必连击、必中破绽，附加威力10%的伤害",
"Ｗ◇攻击盲目或刺目状态的敌人时，必然无视封穴免疫",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇攻击概率增加1000点气攻；被攻击减少10点封穴",
}

ItemInfo[371]={
"Ｌ习得内功：龟息功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇蓄力状态下集气速度增加15%",
"Ｗ◇防御状态下无法被杀气，被攻击35%概率触发“伺机而动”集气位置增加100",
"Ｗ◇5时序回内伤1点",
"Ｗ◇防御状态下，免疫破绽",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇休息时自动防御",
"Ｗ◇时序回生命2点，1点体力",
"Ｗ◇被攻击时概率进入防御状态，初始概率25，生命越低概率越高",
"Ｗ◇防御状态下被攻击时反震目标内伤15点",
"Ｗ◇攻击后消耗内力减伤30%",
"Ｎ",
"Ｄ组合特效：龟息功+鲸息功",
"Ｗ◇被攻击时降低基础伤害直至100点，并恢复生命内力500，体力5点",
"Ｗ◇如果触发复活进入鲸龟状态，提升自身怒气，行动前无敌，清除所有状态，6时序后立即出手，行动后恒定减伤30%",
"Ｎ",
"Ｄ组合特效：龟息功+大周天",
"Ｗ◇在战斗中，被攻击几率增加防御值，增加20%免疫反击几率",
"Ｗ◇护身甲盾·坚不可摧：被攻击第一下，如果受到的伤害大于自身生命50%，则减伤一半，每降低1%生命，减伤增加1%",
"Ｗ◇蓄势待发·以守为攻：攻击几率根据敌方攻击力、我方防御力之和的10%附加伤害",
"Ｗ◇殊死一搏：被攻击减少5点封穴值，几率根据我方防御力与敌方攻击力之和的部分削减敌人生命值与内力、反弹敌方5点封穴值",
"Ｗ◇特殊人物：张三丰-无条件触发",
"Ｎ",
"Ｄ组合特效：纯阳无极功+龟息功+梯云纵横",
"Ｗ◇被攻击后反弹25%伤害",
"Ｗ◇被攻击后根据伤害25%反弹杀气",
"Ｗ◇被攻击时减少25%杀气",
"Ｗ◇被攻击后杀气转变为集气",
"Ｗ◇被攻击后敌人增加内伤30点",
"Ｗ◇被攻击后降低伤害25%",
"Ｗ◇根据自身防御力增加集气速度",
"Ｗ◇攻击结束后回集气200点",
"Ｗ◇特殊人物：张三丰、霍果自带",
"Ｎ",
"Ｄ组合效果：玉女心经+龟息功+金雁功",
"Ｗ◇玉女心经 重生状态：可复活一次",
"Ｗ◇玉女绝影：开局自带7次必闪避，消耗7次之后几率触发",
"Ｗ◇攻击附带吸血效果，根据自身攻击伤害的30%吸血，上限1000点",
"Ｗ◇特殊人物：林朝英、敌人版杨过小龙女自带",
"Ｎ",
"Ｄ组合特效：主运龟息功+蛤蟆功",
"Ｗ◇龟息蛤蟆诀·息劲御力：当被攻击时，蛤蟆蓄力值可用于抵销伤害（类似护盾）",
"Ｗ◇龟息蛤蟆诀·归元反劲：当自身内力大于50％，回复内力的同时会增加蛤蟆蓄力值",
"Ｗ◇龟息蛤蟆诀·潜心真定：被攻击时必减伤50%",
"Ｗ◇龟息蛤蟆诀·潜息出定：被攻击后自身生命低于1500点，时序恢复生命50点，内力150点，体力2点，基础负面状态各5点",
"Ｗ◇特殊人物：张三丰-自带,石破天-自带,达摩-必然触发",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习不老长春功一脉相承",
}

ItemInfo[372]={
   "Ｌ习得奇术：中庸之道",
   "Ｎ",
"Ｗ◇触发中庸之后清除debuff",
"Ｗ◇中庸一：25时序行动一次；中庸二：被攻击25%几率断连击并反击，暴怒、战意爆发情况下概率翻倍",
   "Ｎ",
   "Ｄ觉醒方法：对话中华阁正厅左上车神（手里拿书，橘黄色衣服，不能先拿龙啸九天），坚持100时序或者将车神打至1/3血量觉醒",
   "Ｎ",
   "Ｗ◇中庸觉醒：觉醒后同时拥有两种中庸特效，并觉醒”布衣之怒“怒气、战意时序增加2",
"Ｗ◇触发中庸抢跑时，全场敌人附加10时序”威慑状态“；触发中庸反击时，概率将自己战意提升为满",
   "Ｎ",
   "Ｚ特别说明：",
   "Ｗ◇触发天魔金身之时，如果自身学有中庸之道，则立即清除中庸之道的抢跑cd，资质越接近50概率越大",
}

ItemInfo[307]={
   "Ｌ习得轻功：灵鳌步",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇被攻击时，几率挪移2格闪避",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇发动瞬移时，增加2格移动范围，并在移动后若是仍未脱出攻击范围，则机率触发格档",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇发动瞬移时，机率触发「金鳌化生·幻潮化影」特效：可诞生出一个只有1血的分身",
"Ｗ◇该分身不复制武功，自带一回合的霸体状态，霸体状态中会储存伤害",
"Ｗ◇当分身解除霸体并死亡时，其八格内敌方被直接扣除等同于分身所储存伤害的生命值",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇发动瞬移时触发：「踏浪狂歌」，全场敌人扣除500内力",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇梁萧：瞬移距离增加为六格，可以多次判定，瞬移后可自选武功反击",
}

ItemInfo[373]={
   "Ｌ习得内功：八卦心法",
   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇使用刀法，系数必然不低于对方。",
   "Ｗ◇刀法武功出招概率+20%。",   
   "Ｎ",
   "Ｄ被动效果：",
   "Ｗ◇刀法武功出招概率+10%。",  
   "Ｎ",
   "Ｚ特别说明：",
   "Ｗ◇主运八卦心法，八卦刀法与八卦掌法威力+200",  
}

ItemInfo[374]={
   "Ｌ习得外功：八卦刀法",
   "Ｎ",
   "Ｗ武功威力：800",
   "Ｗ武功气攻：800",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：△ 5格",
   "Ｎ",
"Ｄ组合特效：八卦刀法+八卦心法",
"Ｗ◇增伤300",
"Ｗ◇八卦刀诀·阴阳无极：附加300点攻击，迟缓状态3-6层，内伤8点",
"Ｗ◇八卦刀诀·阴阳相生：敌人被攻击时阴内流血值增加8点，自身恢复生命100点；阳内迟缓增加2层，自身内力恢复200点",
"Ｗ◇八卦刀诀·乾坤一气：根据敌我刀系总和增加伤害，自身加上怒气值10点，敌人减怒气值10点，如果敌人内伤大于30点，生命损失100点，内力损失500点",
"Ｗ◇八卦刀诀·乾坤无极：根据自身内力、敌人的2倍内伤、冰封、灼烧增加伤害",
"Ｗ◇配套插件：学会八卦掌法威力+200",
"Ｗ◇天赋商家堡主：使用刀法无条件触发",
}

ItemInfo[375]={
   "Ｌ习得外功：神门十三剑",
   "Ｎ",
   "Ｗ武功威力：500",
   "Ｗ武功气攻：1000",
   "Ｗ内力消耗：70",
   "Ｗ武功范围：《 6格",
   "Ｎ",
   "Ｄ组合特效：玄虚刀法+神门十三剑",
   "Ｗ◇炼神还虚：几率将吸收杀气转化为内力增加，并降低一半伤害",
   "Ｎ",
   "Ｄ组合特效：神门十三剑+纯阳无极",
   "Ｗ◇增加伤害200点，神门十三剑攻击范围增加",
   "Ｗ◇剑刺神门·平息干戈-敌人处于封穴状态，每次攻击增加封穴值13点",
   "Ｗ◇剑刺神门·卷甲韬戈-被攻击后敌人无法攻击一回合",
   "Ｗ◇特殊人物：张三丰-无条件，武当3级以上弟子-学会组合，用剑法可以带出",
   "Ｎ",
   "Ｚ特别说明：",
   "Ｗ◇必封穴",
}

ItemInfo[376]={
   "Ｌ习得外功：五虎棍法",
   "Ｎ",
   "Ｗ武功威力：300",
   "Ｗ武功气攻：600",
   "Ｗ内力消耗：140",
   "Ｗ武功范围：田 4格",
   "Ｎ",
"Ｄ组合特效：五虎断门刀+五虎棍法",
"Ｗ◇赞天虎：攻击时30%几率提升全队100集气",
"Ｗ◇彻地虎：被攻击时30%几率提高1000点气防",
"Ｗ◇穿山虎：攻击时30%几率增加100点伤害",
"Ｗ◇翻江虎：集气条30%几率跳跃10点集气速度",
"Ｗ◇锦毛虎：被攻击时30%几率反弹10%伤害",
}

ItemInfo[377]={
   "Ｌ习得外功：流云飞袖",
   "Ｎ",
   "Ｗ武功威力：600",
   "Ｗ武功气攻：1200",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：面 3格",
   "Ｎ",
}

ItemInfo[378]={
   "Ｌ习得内功：武当九阳功",
   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇拳掌功夫招式概率+20%。",
   "Ｗ◇增加伤害10%，减伤10%。",    
   "Ｎ",
   "Ｄ被动效果：",
   "Ｗ◇拳掌功夫招式概率+10%。",
   "Ｎ",
   "Ｚ一脉相承：",
   "Ｗ◇学习纯阳无极功一脉相承",
}

ItemInfo[379]={
   "Ｌ习得内功：峨眉九阳功",
   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇剑法武功招式概率+20%。",
   "Ｗ◇行动后概率触发“佛光普照”清除自身灼烧/中毒/冰封/流血/内伤。",   
   "Ｎ",
   "Ｄ被动效果：",
   "Ｗ◇剑法武功招式概率+10%。",
   "Ｎ",
   "Ｚ一脉相承：", 
   "Ｗ◇学习临济十二桩一脉相承",   
}

ItemInfo[380]={
   "Ｌ习得内功：少林九阳功",
   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇奇门武功招式概率+20%。",
   "Ｗ◇增加自身400气防。",
   "Ｗ◇攻击增加自身气防的伤害。",
   "Ｗ◇防御状态下被攻击后为我方回复生命100点、内力200点。",
   "Ｎ",
   "Ｄ被动效果：",
   "Ｗ◇奇门武功招式概率+10%。",
   "Ｗ◇被攻击50%概率进入防御状态。",   
   "Ｎ", 
   "Ｚ一脉相承：",
   "Ｗ◇学习九阳真经一脉相承",
}


ItemInfo[381]={
   "Ｌ习得外功：虎爪绝户手",
   "Ｎ",
   "Ｗ武功威力：450",
   "Ｗ武功气攻：900",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：米 4格",
   "Ｎ",
   "Ｄ组合特效：",
   "Ｗ◇虎鹤双形：擒龙手+虎爪绝户手。",
   "Ｗ◇攻击时概率触发“虎啸”、“龙吟”。", 
   "Ｗ◇擒龙手，虎爪绝户手概率+20，暴怒概率双倍。",  
   "Ｗ◇虎啸：被击中的目标概率混乱", 
   "Ｗ◇龙吟：被击中的目标集气位置倒退300。",  
"Ｎ",
"Ｚ特别说明：修炼虎爪手+擒龙手且用虎爪手攻击，几率把敌人变成人妖（无论男女）暴怒必出",
}

ItemInfo[382]={
   "Ｌ习得外功：疯魔棍法",
   "Ｎ",
   "Ｗ武功威力：550",
   "Ｗ武功气攻：11000",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：田 5格",
   "Ｎ",
}

ItemInfo[383]={
   "Ｌ习得外功：金蛇缠丝手",
   "Ｎ",
   "Ｗ武功威力：550",
   "Ｗ武功气攻：11000",
   "Ｗ内力消耗：105",
   "Ｗ武功范围：▽ 5格",
   "Ｎ",
   "Ｚ组合特效：", 
   "Ｎ",
}

ItemInfo[384]={
"Ｌ习得内功：小周天功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇增加攻击伤害10%，减少受到的伤害10%。",
"Ｗ◇5时序回复内伤1点。", 
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇增加攻击伤害5%，减少受到的伤害5%。",
"Ｎ",
"Ｄ组合效果：罗汉伏魔功+大周天or小周天",
"Ｗ◇被攻击减伤400点，增加6点集气，行动后恢复",
"Ｗ◇罗汉小周天调息-攻击时触发，自身恢复200点生命、400点内力、4点体力、4点内伤、4点中毒 ",
"Ｗ◇特殊人物：达摩-自带",
"Ｎ",
"Ｄ组合特效：小周天功+小星罗功",
"Ｗ◇群星之力·星曜：根据在场全部人数减低自己所受的伤害，每多一人，多减少5％的伤害，16人为上限",
"Ｗ◇群星之力·天河：根据在场敌人人数，行动前回复己方血、内、体，每多一人，多回复上限2％",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习大周天功一脉相承",
}

ItemInfo[387]={
"Ｌ习得内功：神足经",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇攻击后根据移动格数和自身体质增加伤害",
"Ｗ◇行动后根据移动格数和自身体质获得护盾",
"Ｗ◇攻击后根据移动格数和自身体质提升集气",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇每点体质增加2%伤害",
"Ｗ◇每点体质减少2%受伤",
"Ｎ",
"Ｚ组合特效：主运神足经+乾坤大挪移",
"Ｗ◇自带6层瑜伽护盾，固定伤害为300点，被攻击1次减少1层，25时序恢复1层",
"Ｗ◇护盾效果可降低反弹几率",
"Ｗ◇护盾效果可强制取消敌人连击，部分效果连击无视",
"Ｗ◇免疫冰封",
"Ｗ◇神足秘术·活血化毒：伤害降低50%，被攻击时清除内伤、中毒值，如果自身最大生命小于25%，根据最大生命值的25%-现有生命值恢复生命",
"Ｗ◇内力上限增加2000点",
"Ｗ◇攻击时根据自身伤害80%转为真实伤害",
"Ｗ◇神足真气：攻击时根据敌人现有内力的1%时序减少生命，敌人内伤程度时序减少内力，每时序增加15点内力，持续30时序",
"Ｗ◇勇猛精进：攻击时根据敌我现有内力差附加流血点数，根据敌方内力差增加伤害，被攻击者流血大于30点时触发流血值1-3倍的真实伤害",
"Ｗ◇勘破无相：同时触发流血不止于霸王破甲状态，再次附加流血20点，根据流血值添加真是伤害并附加自身生命值恢复",
"Ｗ◇特殊人物：霍稻自带，游坦之学会神足经",
"Ｎ",
}


ItemInfo[388]={
"Ｌ习得得外功：天刀九问",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：280",
"Ｗ武功范围：△ 7格",
"Ｎ",
"Ｄ组合特效：天刀九问+井月八法+长生诀or神照功",
"Ｗ◇每出一刀，战意额外上涨，并且因战意和自身真实刀法而额外增加伤害",
"Ｗ◇开场战意随机30~50",
"Ｗ◇不败之刀：进战场后，自身刀系数额外增加全场刀系数最高者之刀系数(自己最高就刀系数X2)",
"Ｗ◇被刀法攻击时，敌方刀法伤害大幅衰減",
"Ｗ◇九问：以下九问将依序出现，即使攻击被打断，下一次攻击时不会归零而是持续计算。问数增加，伤害增加",
"Ｗ◇一问“上下未形，何由考之”敌方全体满内伤，附加20点流血及混乱状态",
"Ｗ◇二问“阴阳三合，何本何无”敌方全体封穴15点，根据敌方内属赋予负面状态",
"Ｗ◇三问“地方九则，何以坟之”敌方全体扣减500集气，并附加脆弱、集气下降",
"Ｗ◇四问“增城九重，其高几里”为自己附加霸体状态",
"Ｗ◇五问“焉有蛅龙，负熊以游”必然击中破绽，必然破气防，几率不吃反弹",
"Ｗ◇六问“一蛇吞象，厥大何如”大范围极意攻击、并吸收敌方血内体，若补满的话，超额吸取的会变为buff",
"Ｗ◇七问“天式纵横，阳离爰死”无视对招的全屏攻击，根据敌我道德差增伤",
"Ｗ◇八问“女娲有体，孰则匠之”天命造化之力，根据伤害回复全场我方生命",
"Ｗ◇九问“天命反侧，何罚何佑”全场敌方被埋入刀气，攻击者行动后，中刀气者附加随机负面状态，根据与主角的刀系数差异与当前内力值扣减血内，我方则任一人回满状态并清除所有异常",
"Ｗ",
"Ｗ◇奥义：战意爆发时，该次攻击必定单击，以上九问全出",
"Ｎ",
"Ｚ特别说明：",    
"Ｗ根据天书数量提升威力杀气",
"Ｎ",                                     --问题不断
}


ItemInfo[402]={
"Ｌ习得外功：绕指柔剑",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：600",
"Ｗ内力消耗：15",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习柔云剑法一脉相承",
"Ｎ",                                     --小飞侠
}

ItemInfo[403]={
"Ｌ习得内功：临济十二桩",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇攻击必连击,30%三连击",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇每时序回2点冰封",
"Ｗ◇每时序回2点灼烧",
"Ｗ◇每时序回2点流血",
"Ｗ◇每时序回1点封穴",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇每时序回5点生命",
"Ｗ◇每时序回10点内力",
"Ｗ◇50%几率用双倍内力抵消30%伤害",
"Ｎ",
"Ｄ组合特效：主运临济十二桩+峨眉九阳功",
"Ｗ◇大幅增加暴击机率以及暴击伤害。降低被暴击的伤害",
"Ｗ◇天地之心桩：以自身道德值在战斗中提升五系系数。暴击时回复体力并增加回气。体力不小于90时必中",
"Ｗ◇龙鹤风云桩：被暴击时大幅增加气防，并吸纳对手气攻。下一次攻击时若暴击则附加对手等同于吸纳气攻值的「龙鹤气劲」。身有龙鹤气劲的敌人攻击时会扣除等同于龙鹤气劲值的血量（但敌人最多会留下1/10的血量，不致死），并附加五蕴炽盛状态",
"Ｗ",
"Ｗ◇大小幽明桩：暴击时，基础伤害的系数加成部分大幅提升，机率使被攻击的敌人下回合武功攻击范围缩小，且不能触发极意、全屏攻击；被暴击时，基础防御的系数加成部分大幅提升",
"Ｎ",
"Ｄ战意技（需学会龙象般若功）：满足武功要求、战意大于120时攻击触发其一",
"Ｗ◇成所作智：统计被攻击者的六大基础异常值，回复自身血内体",
"Ｗ◇妙观察智：被攻击者降低战意，且被攻击者不能挪移或闪避",
"Ｗ◇平等性智：此次攻击强迫敌方以内力抵扣伤害，内力没了就扣血。且机率使内力低于生命的敌方，生命降为与内力等值",
"Ｗ◇大圆镜智：满足战意条件外，满怒气且生命值小于1/3时触发，满血、满内、清除大部分异常状态。并在触发圆镜状态，被攻击时机率反击（类似斗转）。此特效一场战斗只能触发一次，但圆镜状态不会清除，会保持到战斗结束",
"Ｗ",
"Ｗ◇特殊人物:郭襄觉醒后学有临济十二桩即可（但插件还是要学才有战意技效果）",
"Ｎ",                                --问题不断
}

ItemInfo[404]={
"Ｌ习得内功：碧海潮生功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇每次攻击杀内300点",
"Ｗ◇攻击附带额外杀气300点",

"Ｎ",
"Ｄ被动效果：",
"Ｗ◇40%概率暴击",
"Ｗ◇40%概率必破气防",
"Ｎ",
"Ｄ组合特效：碧海潮生+奇门五转",
"Ｗ◇桃花乐音·碧海潮生曲-概率降低全场敌人60点内力，没有内力则降低生命",
"Ｗ◇攻击必然全场触发悲欢离合其中之一：",
"Ｗ◇潮音·悲曲·芳魂辞泪-敌人根据怒气值扣血，并怒气值减半",
"Ｗ◇潮音·欢曲·红烛鸾帐-增加15点冰封、灼烧，并时序扣血",
"Ｗ◇潮音·离曲·不思难忘-小概率冻结敌人，反之减少集气速度",
"Ｗ◇潮音·合曲·湖桥伞下-恢复我方150生命、300内力、3体力",
"Ｗ◇特殊人物：东邪、冯蘅、黄蓉-自带",                                  --问题不断
"Ｎ",
"Ｄ组合特效：碧海潮生功+奇门五转+灵鳌步",
"Ｗ◇攻击范围+2",
"Ｗ◇桃花绝技·落英缤纷：攻击附加6点内伤值、封穴值",
"Ｗ◇桃花绝技·狂风忽起：现有内力的16%触发35%真实伤害，内力的16%触发扣除内力",
"Ｗ◇桃花绝技·五虚一实：攻击时周围6格内触发创伤效果20-30时序",
"Ｗ◇桃花绝技·回风拂柳：体力减少3点，集气紊乱15时序",
"Ｗ◇桃花绝技·落英漫天：闪避攻击（普通）",
"Ｗ◇特殊人物：东邪自带", 
}

ItemInfo[405]={
"Ｌ习得内功：金关玉锁诀",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇40%概率为敌人附加随机状态",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇免疫锁足",
"Ｗ◇封穴抗性+10",
"Ｗ◇内伤-60%",
"Ｎ",
"Ｄ组合特效：主运金关玉锁诀+小周天or大周天功",
"Ｗ◇杀意波动：据自身内力值降低全部敌人集气速度，并横纵距离总计10格之内会加强减速效果(敌人集气速度不会低于7)",
"Ｗ◇以上全场集气压制效果，限定金关＋大周天组合",
"Ｗ◇杀意波动·气脉回旋：被攻击时根据内力值增加集气，可抵消杀气",
"Ｗ◇杀意波动·凝气破脉：攻击后50%几率双倍杀气，并且根据杀气扣除被攻击者内力。若被杀气后集气位置位于-300，则70％机率冻结20时序、30%机率昏迷一回合",
"Ｗ◇杀意波动·瞬狱千杀：使用拳掌攻击根据敌我拳系数总和以及敌方集气位置增加伤害，集气位置越高伤害越高",
"Ｗ◇天赋空明之武道-学会对应武学，无需主运",
"Ｗ◇特殊人物：周伯通-自带，郭靖-觉醒后自带",                                   --问题不断
}

ItemInfo[406]={
"Ｌ习得内功：冰火阴阳诀",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇每次攻击附带30%概率引燃5时序效果",
"Ｗ◇每次攻击附带30%概率冻结5时序效果",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇免疫冰封",
"Ｗ◇免疫灼烧",
"Ｎ",
"Ｄ组合特效：枯荣禅功+冰火阴阳诀or天南易阳决",
"Ｗ◇附加内力最大值5%的伤害",
"Ｗ◇枯禅真诀·气护心脉：概率消耗600内力减伤60%+600固定减伤，大理门人进入转龙呼吸状态",
"Ｗ◇枯禅真诀·气锁周天：概率点燃敌人并附加封穴",
"Ｗ◇特殊人物：段思平-自带，枯荣-学会枯荣禅功",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习天南易阳决一脉相承",
}

ItemInfo[407]={
"Ｌ习得内功：奇门遁甲",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ◇被攻击时,30%概率将伤害的50%转化成护盾",
"Ｗ◇攻击后，时序内伤恢复3点",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击后集气速度+3",
"Ｗ◇攻击后20%概率闪避",
"Ｎ",

}

ItemInfo[408]={
"Ｌ习得内功：忘情天书",
"Ｎ",
"Ｄ运功效果：",
"Ｗ2书领悟：“水逝”增加冰封，冰封过50点概率发动“月映”冰冻5时序", 
"Ｗ3书领悟：“火延”增加燃烧，燃烧过50点概率发动“日明”点燃目标",    
"Ｗ4书领悟：“土掩”减伤30点，机率发动“风流”完全闪避攻击",         
"Ｗ5书领悟：“云翳”必杀集气200，暴怒后20%概率“忘情无我”反弹全部伤害。", 
"Ｗ◇时序回复1点流血。",
"Ｗ◇时序回复2点生命，4点内力。",
"Ｎ",

"Ｄ被动效果：",
"Ｗ1书领悟：“天意”死亡时必触发“天意”复活一次",
"Ｎ",                          --问题不断
"Ｄ组合特效：忘情天书+怒涛海潮功",
"Ｗ◇易怒组合：每时序增加怒气值10点",
"Ｎ",
"Ｄ组合特效：忘情天书+武穆遗书+逍遥游",
"Ｗ◇被攻击时触发自身格挡状态，根据第1天赋外功进行反击",
"Ｗ◇被攻击时可触发暗器反击，根据自身拳、剑、特三系效果增加伤害",
"Ｗ◇沛然有雨·清风徐来：休息时恢复生命、内力，减少内伤，中毒",
"Ｗ◇特殊人物：乔峰、洪七公、南子、陆刃自带",
"Ｎ",
"Ｄ组合特效：主运忘情天书+龙象般若功",
"Ｗ◇日明：被攻击后敌人下一回合几率进入盲目状态，减少生命500",
"Ｗ◇月映：攻击后自身30时序内处于闪避状态",
"Ｗ◇风流：攻击后敌人30时序内每时序减少内力最大值的1%，所剩内力的5%",
"Ｗ◇云翳：攻击后敌人30几率内基础负面状态时序提高，根据基础状态总和扣除生命",
"Ｗ◇我无：攻击后敌人30时序内每时序减少生命最大值的1%，所剩生命的5%",
"Ｗ◇强化忘情天书主运效果：（独孤仍需主运，萧秋水不用）",
"Ｗ◇一本天书天意：死亡时复活；学会组合后复活时为自己附加“战神状态”20时序",
"Ｗ◇二本天书水逝：概率触发攻击必冰封，攻击冰封大于50敌人概率冻结；学会组合后概率进化为“海啸”，为敌人施加利刃寒封10时序,冰冻状态",
"Ｗ◇三本天书火延：概率触发攻击必灼烧，攻击灼烧大于50敌人概率点燃；学会组合后概率进化为“焚灭”，为敌人施加举火燎原、无明业火10时序",
"Ｗ◇四本天书土掩：被攻击概率减伤为320点；学会组合后概率进化为“完璧”，回复损失生命的20%",
"Ｗ◇五本天书云翳：概率触发杀敌人200集气；学会组合后概率进化为“遮天”，杀敌人全体集体200点",
"Ｗ◇六本天书风流：被攻击15%概率闪避；学会组合后概率进化为“腾云”，闪避后增加自身集气位置200点",
"Ｗ◇特殊人物：萧秋水-学会忘情天书，逍遥子-不自带，独孤求败-必然触发",
}

ItemInfo[409]={
"Ｌ习得内功：怒涛海潮功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序回复1点内伤",
"Ｗ攻击时，敌方的拳系数按50%计算",
"Ｗ暴怒时，对全场强制杀气100点",
"Ｎ",

"Ｄ被动效果：",
"Ｗ◇50%概率破气防",
"Ｗ◇50%概率暴击",
"Ｗ暴怒时，第一下攻击对全场强制杀气100点",
"Ｎ",                                   --小飞侠
"Ｄ组合特效：武穆遗书+怒涛海潮功",
"Ｗ◇兵势攻奇：攻击时根据敌人当前集气位置追加额外伤害，当敌人当前集气位置低于-100时，追加麻痹不起、感电状态",
"Ｗ◇军形练体：被攻击时根据自身体质概率免疫基础杀气、减少敌人伤害增加、增加自身负面抗性",
"Ｗ◇马不停蹄：行动后根据自身移动格数提升自身集气位置，如果自身移动步数至少9格时，则概率进入再次行动（随移动格数增大概率）",
"Ｗ◇特殊人物：岳云-学会武穆遗书",
"Ｎ",
"Ｄ组合特效：忘情天书+怒涛海潮功",
"Ｗ◇易怒组合：每时序增加怒气值10点",
"Ｎ",
"Ｄ组合特效：金刚不坏体+怒涛海潮功+一苇渡江",
"Ｗ◇真金刚不坏：被攻击时触发霸体状态",
"Ｗ◇水火不侵：攻击结束后清零6种基础状态",
"Ｗ◇不动明王·金刚不坏：休息时可触发清除中级异常",
"Ｗ◇额外增加集气15点",
"Ｗ◇时序恢复15点生命，50点内力，1点体力",
"Ｗ◇特殊人物：罗小鱼、第五蔚柏自带",
"Ｎ",
"Ｄ组合特效：怒涛海潮功+不老长春功+花间游",
"Ｗ◇时序恢复体力3点",
"Ｗ◇无视除空挥以外所有攻击",
"Ｗ◇天魔教魔将主运天魔功享受此效果",
"Ｎ",
"Ｄ组合特效：主运怒涛海潮功+长生诀or神照功",
"Ｗ◇自带9层怒涛气劲，25时序恢复1层，每道气劲攻击加150点伤害、集气停止5时序、10点内伤值、5点流血值",
"Ｗ◇攻击必触发怒涛海潮气劲，随机触发以下效果其中一种",
"Ｗ    波涛汹涌：昏迷状态",
"Ｗ    滔滔不绝：恐惧状态",
"Ｗ    波澜壮阔：混乱状态",
"Ｗ    排山倒海：散功状态",
"Ｗ    惊涛拍岸：麻痹状态",
"Ｗ◇怒海波涛·暗流不尽：攻击根据气攻增加伤害，气攻根据敌人冰封、灼烧增加额外杀气值，10时序内掉血500点",
"Ｗ◇特殊人物：独孤求败-必然触发，逍遥子-不自带，杨过-自带怒涛主运",
"Ｗ◇天赋怒海狂涛：主运怒涛即可享有组合，集气额外增加10点",
}

ItemInfo[410]={
"Ｌ习得外功：神跌鬼倒",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：30",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[411]={
"Ｌ习得外功：伏魔剑法",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：25",
"Ｗ武功范围：3格大米",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[412]={
"Ｌ习得外功：恒山心法",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：米 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习古针禅功一脉相承",                                     --问题不断
}

ItemInfo[413]={
"Ｌ习得内功：易水寒诀",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每次行动后，或是被攻击，获得五层「易水值」",
"Ｗ◇「易水值」大于25，额外有30%机率触发暴击",
"Ｗ◇「易水值」大于30，暴击伤害+30%",
"Ｗ◇「易水值」大于55，攻击时60%机率触发必中",
"Ｗ◇「易水值」大于85，有9%机率，攻击时杀敌全体900集气",
"Ｗ◇「易水值」大于95，暴怒时立刻行动",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇免疫灼烧",
"Ｗ◇攻击必冰封，并根据冰封值追加伤害",
"Ｎ",
"Ｄ组合特效：寒冰真气or易水寒+紫霞神功",
"Ｗ◇寒冰真气·如履薄冰：攻击概率降低敌人集气",
"Ｗ◇寒冰真气·冰散瓦解：攻击概率使敌人集气波动",
"Ｗ◇寒冰真气·霜冻长河：攻击概率冻结敌人",
"Ｗ◇攻击附加8点冰封，根据自身内力和敌人冰封程度增伤",
"Ｗ◇特殊人物：左冷禅-自带",
"Ｎ",
"Ｄ组合特效：主运易水寒+寒冰真气",
"Ｗ◇自带10层易水霸体护盾，受到攻击减少1层，30时序恢复1层",
"Ｗ◇易水霸体护盾可降低反弹",
"Ｗ◇易水霸体护盾不受天魔功、独孤真破清零效果影响",
"Ｗ◇时序清零自身冰封效果，恢复30%灼烧值，恢复10点封穴值，恢复100点内力，3点体力",
"Ｗ◇自身集气被杀到底时内伤清零，根据自身内力差恢复生命值",
"Ｗ◇增加20%集气速度",
"Ｗ◇增加小幅度跳气",
"Ｗ◇特殊人物：杨冰羽自带",
"Ｗ◇天赋雪羽精髓-主运易水寒即可享有组合",
"Ｎ",
"Ｚ特别说明：无",                                     --问题不断
}

ItemInfo[414]={
"Ｌ习得外功：降魔掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：15",
"Ｗ武功范围：移米 2格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[415]={
"Ｌ习得外功：静心守剑",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：50",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[416]={
"Ｌ习得外功：古针禅功",
"Ｎ",
"Ｗ武功威力：800",
"Ｗ武功气攻：800",
"Ｗ内力消耗：50",
"Ｗ武功范围：正方形4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习五岳剑诀一脉相承，限定五岳派",                                    --小飞侠
}

ItemInfo[417]={
"Ｌ习得外功：五大夫剑",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：15",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[418]={
"Ｌ习得外功：七星落长空",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：25",
"Ｗ武功范围：2格3*3□",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[419]={
"Ｌ习得轻功：君子风",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇行动后回复血量，机率与回复量随道德增加",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇修身：被攻击时根据道德值判断机率，依据实战值减伤",
"Ｗ◇齐家：被攻击时机率依照自身道德值回复队友血量与内力",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇增加行动后的回血量，修身、齐家的减伤和回复量额外增加，增加以下效果：",
"Ｗ◇治国：根据自身气攻增加伤害，如果有内功加力则必定封穴",
"Ｗ◇平世：用剑法攻击时以道德计算机率触发极意，道德越高范围越大，并对自己附加天香、五宝效果",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇涉及道德判定时，自身道德翻倍计算",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇五岳剑派：吞气入体效果增加，低机率触发断连击效果；机率减少全体敌方等同于自身道德1.2倍的集气值",
                                     --问题不断
}

ItemInfo[420]={
"Ｌ习得外功：镇岳诀",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习五岳剑诀一脉相承，限定五岳派",                                    --小飞侠
}

ItemInfo[421]={
"Ｌ习得外功：磐石法诀",
"Ｎ",
"Ｗ武功威力：800",
"Ｗ武功气攻：700",
"Ｗ内力消耗：30",
"Ｗ武功范围：正方形4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习五岳剑诀一脉相承，限定五岳派",                                     --小飞侠
}

ItemInfo[422]={
"Ｌ习得外功：参合剑气",
"Ｎ",
"Ｗ武功威力：700",
"Ｗ武功气攻：1500",
"Ｗ内力消耗：350",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｗ◇参合状态：参合指攻击会给敌人添加参合状态", 
"Ｗ◇参合状态：攻击时伤害降低10%~20%", 
"Ｗ◇参合状态：被攻击时受到伤害增加15%~30%",                                       --小飞侠
}

ItemInfo[423]={
"Ｌ习得外功：北斗剑法",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：25",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习参合剑气一脉相承",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[424]={
"Ｌ习得外功：降魔刀法",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：20",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：降魔刀法+伏魔杖法",
"Ｗ◇时序增加怒气值2点",
"Ｗ◇时序恢复，根据自身刀系恢复生命，自身特系恢复内力",
"Ｗ◇破防增加",
"Ｗ◇特殊人物：玄澄、达摩-自带",
"Ｎ",
"Ｚ特别说明：",                                     --问题不断
}

ItemInfo[425]={
"Ｌ习得外功：回风拂柳刀",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：25",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[426]={
"Ｌ习得外功：八卦游龙掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：800",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[427]={
"Ｌ习得外功：金刚伏虎刀",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：700",
"Ｗ内力消耗：20",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[428]={
"Ｌ习得外功：周公剑法",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：周公剑法+剑华皈壹",
"Ｗ◇攻击增加“周公剑意”层数X自身御剑值20%的伤害",
"Ｗ◇攻击概率为自己附加一层“周公剑意”，随着剑意的提升提高自身集气速度，降低敌人集气速度；",
"Ｗ◇大道归一：自身周公剑意达到7层时，被攻击时敌人无法连击",
"Ｗ◇随着周公剑意层数的提高，攻击可以触发更高层次的剑招（当剑意达到5层时，攻击可以同时触发随机1~4层剑招）",
"Ｗ◇剑寒如雪：“周公剑意”四层时可以触发；为敌人附加冰封，“寒冰魄”，当敌人冰封程度达到100时，集气位置冻结到300，每5时序寒透一次，根据冰封损失内力，行动后清除",
"Ｗ◇剑蛊食心：“周公剑意”二层时可以触发；为敌人附加中毒，“食心蛊”，会根据敌人中毒值抑制回血、内比例，每5时序毒发一次，根据中毒损失生命，行动后清除",
"Ｗ◇剑影迷踪：“周公剑意”大于等于五层可以触发；被攻击时概率触发，弹晕敌人，敌人根据自身攻击力损失生命，自身集气满，清除中级状态",
"Ｗ◇剑浪奔腾：“周公剑意”一层时可以触发；为敌人附加灼烧，“烈火核”，当敌人灼烧程度高于50时，时序溅射周围伤害及引燃，每5时序焚烧一次，根据灼烧值烧体力，行动后清除",
"Ｗ◇剑蟒缠绵：“周公剑意”三层时可以触发；为全体敌人附加封穴，附加“缚身蛇”，当敌人封穴大于30时，减缓解穴速度，并持续损失封穴的生命；每5时序，根据封穴值降低集气位置，行动后清除",
"Ｗ◇剑飞惊天：“周公剑意”六层时可以触发；攻击后概率再次行动，为敌人附加感电状态，自身开启“惊雷咒”20时序（每隔5时序，天雷攻击身上有感电状态的敌人，伤害同自身御剑值）",
"Ｗ◇剑芒霹雳：“周公剑意”七层时可以触发；攻击为全场附加感电状态，自己身附加20时序“御雷阵”，范围随自身御剑值扩大，当敌人进入范围时，催动天雷攻击敌人根据自身御剑系数和敌人感电状态、麻痹状态追加伤害、感电状态。",
"Ｗ",
"Ｗ◇感电状态：被攻击或行动前损血（根据基础状态越低增伤越多），并附加一层麻痹状态，行动前减少1层，最高5层）",
"Ｗ◇霞光千道：周公剑意达到七层且怒气爆发时，攻击必连击，攻击变为面功，全场附加麻痹不动。并根据敌人基础状态扣血（基础状态越低扣血越多",
"Ｗ◇暴怒行动后，如果周公剑意7层，则回归至1层",
"Ｎ",
"Ｚ特别说明：",                                     --问题不断
}

ItemInfo[429]={
"Ｌ习得外功：大嵩阳掌",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：15",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[430]={
"Ｌ习得外功：寒冰神掌",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：15",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[431]={
"Ｌ习得外功：快慢十八路",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：400",
"Ｗ内力消耗：15",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[432]={
"Ｌ习得外功：子午十二剑",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：15",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[433]={
"Ｌ习得外功：迅雷剑法",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[434]={
"Ｌ习得轻功：踏雪无痕",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇移动距离额外+2，集气速度额外增加6点，免疫锁足",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇根据自身称号位阶，集气位置低于一定量时，被攻击机率触发闪避，机率进化为真实闪避，并获得「天香续命」buff。",
"Ｗ◇一定量：菜鸟～二流，-400；一流-300，豪侠-200；宗师-100，传说0",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇被攻击时若没有触发闪避，也没有触发真实闪避，则机率进入「雪遁」状态（类似夜雨不沾衣的如影），并与战场上随机一名敌人交换位置。（若敌人只剩攻击者，则不交换，自身回补最大血量1/10）。攻击者攻击结束后显露身形",
"Ｗ",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇行动开始前，距离自己最近的敌人会被附加「追猎」状态，在其下一次行动前，被我方攻击次数越多，所受伤害越大",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇密宗：提升一般闪避的发动机率，闪避成功时机率触发断连与反击（闪避后反击需主运龙象、血河、神足或瑜珈）",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇血刀：踏雪为天轻时，追猎对全场敌方发动",
"Ｗ◇金轮：踏雪触发闪避或挪移时，机率获得霸体",
"Ｗ◇鸠摩智：踏雪触发雪遁时，增加自己战意",

}

ItemInfo[435]={
"Ｌ习得轻功：追魂无影",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇移动+2，回气250点，恢复4点体力",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇初始自带20%闪避效果，根据自身轻功属性增加几率，最高几率可提升到45%，并根据轻功属性减少基础负面数值",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇攻击必中，无法针对挪移，中毒100点，无法集气10时序",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇时序清除中级异常",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇唐门：被攻击后使用武功进行反击",
}

ItemInfo[436]={
"Ｌ习得轻功：风吟步",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇随风步月：移动格数上限额外增加，随进阶增强",
"Ｗ◇疾风狂舞：攻击第一下触发，根据移动步数增加自身怒气、战意",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇风无形：被攻击根据轻功值的概率进入隐匿状态20时序，并持续回复生命与内力",
"Ｗ◇风有声：攻击概率触发，使敌人陷入集气紊乱20时序，并时序损失体力",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇乘风起：被攻击时几率触发，提高自身轻功值/4的集气值，最高300",
"Ｗ◇踏风行：攻击时附加根据自身集气速度与敌方差距几率（最高50%）判定二次行动",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇风刃：攻击概率附加轻功值的伤害与气攻，并概率撕裂敌人",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇雪羽宗：每次行动额外增加移动格数的易水寒层数",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇杨冰羽：行动结束后增加2倍移动格数的易水寒层数，被攻击必触发乘风起",                                    --问题不断
}

ItemInfo[437]={
"Ｌ习得轻功：龙行虎步",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇机率提升时序战意增加",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇天子身：被攻击时依照自身战意减伤",
"Ｗ◇天子守国门：战意在超过150之后，行动前机率直接战意爆发；战意对攻防的加成上升",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇君权神授：根据战意提升特效触发机率，满战意时提升20％",
"Ｗ◇天威难御：根据战意压制全场集气，满战意时压制50点集气",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇行动后额外增加10～20点战意",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇大理：攻击时机率全场减战意",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇段思平：帝心难测，行动后机率全场敌方附加恐惧状态",
}

ItemInfo[438]={
"Ｌ习得外功：六如苍龙诀",
"Ｎ",
"Ｗ武功威力：2000",
"Ｗ武功范围：面攻",
"Ｎ",
"Ｄ组合特效：无需主运",
"Ｎ",                                     --问题不断
"Ｄ被动效果：",
"Ｗ◇其疾如风：攻击后我方全体恢复集气200点",
"Ｗ◇其徐如林：被攻击时自身增加10或15点集气，最高值为80点",
"Ｗ◇侵略如火：攻击时附加3000点气攻",
"Ｗ◇不动如山：被攻击时强制降低伤害为30点",
"Ｗ◇动如雷霆：攻击次数增加1次",
"Ｗ◇难知如阴：被攻击时断连击",
"Ｄ限制门派中华阁获得苍龙令并修炼后（面板上有六如苍龙决）可在过杀破狼阵，胜负都能觉醒为：赤血真龙诀",
"Ｗ◇龙威镇天地：攻击变为全屏",
"Ｗ◇真龙破灭击：攻击根据自身内力、攻击、敌方生命值触发伤害",
"Ｗ◇游龙身法：被攻击时伤害为0",
"Ｗ◇不死真龙：被攻击时生命减少10点",
"Ｗ◇真龙飞升：被攻击时根据2倍杀气值增加集气",
"Ｗ◇真龙·逆鳞：被攻击时根据自身攻击、防御、轻功总和以暗器的方式反击敌人，并自身恢复基础状态。「真龙·逆鳞」特效可以无视暗器免疫特效",
"Ｗ",
"Ｚ特别说明：限定标准主角专属（面板武学），中华阁触发条件：中华阁掌柜并学会龙啸九天",
}

ItemInfo[439]={
"Ｌ习得外功：六如隼龙诀",
"Ｎ",
"Ｗ武功威力：20000",
"Ｗ武功范围：面攻",
"Ｎ",
"Ｄ组合特效：无需主运",
"Ｎ",                                     --问题不断
"Ｄ被动效果：",
"Ｗ◇隼龙闪：初始自带5次闪避必触发，之后几率触发",
"Ｗ◇隼龙步：攻击中自身几率增加5点集气速度",
"Ｗ◇隼龙诀：攻击时自身恢复生命、内力，集气自动增加",
"Ｄ限制门派云梦涧获得隼龙令并修炼后（面板上有六如隼龙决）可在与施施战斗，胜负都能觉醒为：赤血苍龙诀",
"Ｗ◇赤血苍龙·其疾如风：攻击后恢复600点集气",
"Ｗ◇赤血苍龙·其徐如林：被攻击后敌人随机被附加恐惧、昏迷、沉睡、混乱、麻痹其中一种状态",
"Ｗ◇赤血苍龙·侵略如火：攻击后敌人基础负面状态全满",
"Ｗ◇赤血苍龙·不动如山：被攻击后伤害强制30点，必断连",
"Ｗ◇赤血苍龙·动如雷霆：攻击连击次数X2",
"Ｗ◇赤血苍龙·难知如阴：被攻击后自身恢复生命200点，内力1000点，体力10点",
"Ｚ特别说明：限定畅想主角专属（面板武学），云梦涧触发条件：云梦涧仙姬",
}

ItemInfo[440]={
"Ｌ习得外功：同归剑法",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[441]={
"Ｌ习得外功：一气化三清",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[442]={
"Ｌ习得外功：履霜破冰拳",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[443]={
"Ｌ习得轻功：花间游",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇集气速度随人物位阶提升最高加25，根据自身当前集气位置概率触发闪避，恢复体力，集气位置越低闪避概率越高",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇闪避后，根据自身集气速度/5清除基础异常，清除降低自身攻击命中（盲目、头晕等）的debuff",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇免疫混乱、锁足、昏迷，每9时序概率清除所有异常或高级异常，被攻击时30%概率无视必中，攻击时根据受击敌人数量增伤，若自身本次攻击的目标数量大于5个，则大概率立即行动。",
"Ｗ",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇被攻击时，免疫奇数的攻击，增加自身集气位置（不免疫异常）",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇花涧派：当周围5格子有友军时，被攻击时根据友军数量回血内，并根据友军数量降低伤害",
}

ItemInfo[444]={
"Ｌ习得外功：飘雪穿云掌",
"Ｎ",
"Ｗ武功威力：175",
"Ｗ武功气攻：400",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[445]={
"Ｌ习得外功：金顶绵掌",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[446]={
"Ｌ习得外功：四象掌",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[447]={
"Ｌ习得轻功：流云逐月",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇当自身集气速度并非全场最快时，增加15点集气",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇云身：被攻击时根据战场轻功值计算机率闪避",
"Ｗ◇月影：被杀气（无论空挥杀气或武功杀气）时机率免疫",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇真云身：被攻击时，只要攻击者的战场轻功低于自己或差距小于100，则必然闪避，其馀情况则机率闪避，闪避后回复血量",
"Ｗ◇真月影：进一步提升免疫杀气的机率",
"Ｗ◇自身集气速度并非全场最快时，增加30点集气且无视集气上限",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇闪避后回复内力和体力，并清除内伤、封穴",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇峨眉派：提升自带闪避发动的机率",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇郭襄：触发闪避后清除自身所有负面状态",
}

ItemInfo[448]={
"Ｌ习得外功：金顶九式",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[449]={
"Ｌ习得轻功：云龙三现",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇依据自身称号位阶计算机率，战斗开场时增加100集气量",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇根据攻击前行动步数计算机率，攻击后触发「云龙一折」，可挪移五格距离，并15时序内被打闪避",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇大幅提升云龙一折的触发机率，触发云龙一折时根据轻功计算机率，触发「云龙二折」，先退回该回合行动前位置，在可挪移五格距离，15时序内被打闪避。触发云龙二折时，根据战意计算机率，云龙二折变为云龙三折，在云龙二折、一折效果触发后立刻行动（这个额外行动不会再触发云龙三折），并该次攻击伤害翻倍（但吃减伤）",
"Ｗ",
"Ｗ",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇依据自身称号位阶，触发基本效果时额外增加一定集气量（菜鳥+0、弟子+50、三流+100…以此类推）",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇昆仑派：15%固定机率，被打闪必会进化为真实闪避",
}

ItemInfo[450]={
"Ｌ习得外功：霹雳雷火弹",
"Ｎ",
"Ｗ武功威力：9",
"Ｗ武功气攻：9",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｗ◇基础效果：根据自身暗器值附加灼烧",
"Ｗ◇为敌人附加“烈火核”状态15时序",
"Ｗ◇固定扣除生命值700点，并根据灼烧增加伤害",
"Ｗ◇敌人附加止杀状态，行动后降低集气位置",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇郭襄--暴怒时无视战意触发进化大招，觉醒后暗器自带霹雳雷火弹效果",                                  --问题不断
}

ItemInfo[451]={
"Ｌ习得外功：抽髓掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[452]={
"Ｌ习得外功：连环腐尸毒",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：米字 4格",
"Ｗ◇连环腐尸毒·极意：攻击时有30%几率触发，暴怒必定触发",
"Ｗ◇连环腐尸毒·极意：攻击范围变为面攻，追加1000气攻并引爆目标身上毒素",
"Ｎ",
"Ｄ组合特效：千蛛万毒手+连环腐尸毒+五毒神功",
"Ｗ◇毒布武林：对应武功威力增加500",
"Ｗ◇毒布武林：行动前使全场敌人中毒,随着用毒点数增加而增加，并几率叠加随机负面状态",
"Ｗ◇毒布武林：行动后触发“万毒噬心”，扣减敌方中毒值的血量",
"Ｎ",
"Ｄ组合特效：连环腐尸毒+化功大法",
"Ｗ◇毒布武林：腐蚀功·毒砂：中毒+8，随中毒减少生命，攻击时随中毒减少生命，增加西域奇毒，敌人攻击时如果内功加力，则根据中毒减少生命，为自己附加剧毒，毒击层数减少，持续15时序",
"Ｗ◇腐蚀功·连珠：敌人麻痹10时序",
"Ｗ◇腐蚀功·万毒滋养：攻击敌人后根据敌人3倍中毒量恢复自身生命值",
"Ｗ◇攻击时附带22点中毒值，13点内伤值",
"Ｗ◇特殊人物：丁春秋自带",
}

ItemInfo[453]={
"Ｌ习得轻功：摘星功",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇被攻击时根据自身用毒能力计算机率，反弹中毒与「基础蛊毒状态」",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇根据自身用毒能力计算机率，触发以下效果：",
"Ｗ◇集气时机率会跳气，跳气量根据自身中毒量计算，保底10点，每20点中毒＋5点",
"Ｗ◇每一次跳气都低机率对身边的敌方施放「剧毒」。施放范围由自身用毒能力＋中毒量决定，每50点+1格，最高八格",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇免疫剧毒状态",
"Ｗ◇每次行动后都有机率对自身八格内的敌人施放「绿火星毒」，绿火星毒触发以下效果：",
"Ｗ◇每10时序爆发，每次爆发都会附加中毒、中毒不解效果以及根据中毒的血量扣减。爆发次数5~9次不等",
"Ｗ◇最后一次爆发时，如果死亡的话则会溅射周遭6格内的敌人火毒、寒毒、毒击特效",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇攻击时根据自身用毒能力计算机率，增加连击次数2次",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇星宿：自身中毒量大于等于100时，高过100的中毒量每10点中毒+1点机率（保底15），被攻击时触发闪避",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇阿紫：被攻击时随机使敌方陷入盲目状态",                                     --问题不断
}

ItemInfo[454]={
"Ｌ习得外功：三笑逍遥散",
"Ｎ",
"Ｗ武功威力：11",
"Ｗ武功气攻：11",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[455]={
"Ｌ习得外功：三无三不手",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：15",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                      --小飞侠
}

ItemInfo[456]={
"Ｌ习得外功：银拂尘功",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：10",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[457]={
"Ｌ习得外功：玉蜂针",
"Ｎ",
"Ｗ武功威力：6",
"Ｗ武功气攻：6",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[458]={
"Ｌ习得外功：冰魄银针",
"Ｎ",
"Ｗ武功威力：9",
"Ｗ武功气攻：9",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｗ◇攻击范围扩大，并随机打出四种特效之一： ",
"Ｗ◇爱火已成霜：强上冰封和冰冻，依照敌方冰封和冰冻程度增加暗器伤害，并根据敌方当前怒气扣减体力",
"Ｗ◇寒心复盈怨：强上剧毒和混乱，并根据敌我怒气和增加暗器伤害",
"Ｗ◇虚情妄毒誓：强上中毒与基础蛊毒并降低敌人集气速度，根据敌方中毒增加暗器伤害",
"Ｗ◇意冷恨相逢：根据敌方战意增加暗器伤害，并强上冻结与冰魄毒20时序",
"Ｗ◇（冰魄毒：当敌方集气位置越高泽集气速度越低，集气速度低于50时，每时序减少50血。）",
"Ｗ◇杀尽负心人（大招）：爆怒时使用暗器触发，全屏攻击且暗器伤害1.2倍（可与前述效果叠加）",
"Ｗ◇大招进化：爆怒时战意大于120进化为「杀尽天下负心人」，暗器伤害1.5倍并强杀250集气",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇李莫愁-暴怒时无视战意触发进化大招，觉醒后暗器自带冰魄银针效果（可同时拥有2种暗器）",
                                     --问题不断
}

ItemInfo[459]={
"Ｌ习得外功：生死符",
"Ｎ",
"Ｗ武功威力：9",
"Ｗ武功气攻：9",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｗ◇攻击敌人后出现MISS文字后依然可扣除生命：",
"Ｗ◇根据自身暗器值增加敌人冰封、灼烧值",
"Ｗ◇根据自身暗器值扣除敌人生命、内力、50点体力值",
"Ｗ◇敌人进入点燃、冻结10时序",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇天山童姥、逍遥子-暴怒时无视战意触发进化大招，暗器自带生死符效果",                                    --问题不断
}

ItemInfo[460]={
"Ｌ习得外功：透骨针",
"Ｎ",
"Ｗ武功威力：9",
"Ｗ武功气攻：9",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｗ◇基础效果：冰封值增加35点、固定掉血200",
"Ｗ◇敌人集气紊乱，时序增加流血值，根据流血值扣除生命",
"Ｗ◇时序减少体力，减少集气速度",
"Ｗ◇时序增加中毒值，根据中毒值扣除内力",
"Ｎ",
"Ｚ特别说明：",                                     --问题不断
}

ItemInfo[461]={
"Ｌ习得轻功：夜雨不沾衣",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇免疫锁足、混乱、加速解除封穴，每解除1点封穴，集气条前跳25～50点",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇被攻击时机率触发闪避，闪避后机率以暗器反击，若练有细雨花，机率大幅增加",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇被攻击时机率进入「如影」状态，完全隐形，敌方无法针对进入如影状态的敌人进行攻击，并对攻击者附加随形状态",
"Ｗ◇如影状态下，触发以下二种情形：",
"Ｗ◇随形状态者先动：发动「附骨之影」，如影状态者先动并且扣除随形状态者当前生命5％",
"Ｗ◇如影状态者先动：执行任意行动时显露身形，若是选择出招攻击，则敌方防御力以1计算；若选择暗器，则暗器伤害翻倍",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇无视迟缓、集气紊乱、集气倒走、回魂仙梦等特效",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇夜雨楼：微幅提升进入无名夜的机率；无名夜状态中获得生命奔流、内力奔流状态，副楼主进入无明夜状态时，所有集气停止特效将生效不高于10时序",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇楼主：进入如影状态时，获得生命奔流状态；如影状态只会在攻击、使用门派指令时解除；攻击时的伤害将转化44％为真实伤害；时序清零所有集气停止特效。",
"Ｗ◇喵姐：夜雨不沾身效果视为自带，敌方攻击时若三连以上必定进入如影；如影状态中进入内力奔流状态；如影只会在攻击或使用门派指令时解除，使用剑法攻击时将转化33％的伤害为真实伤害，进入无明夜或如影状态时，时序清零所有集气停止特效",
"Ｗ",
"Ｗ◇南子：觉醒后，微幅提升如影的触发机率，并只在使用攻击、物品以及门派指令时解除如影。使用枪法攻击时转化11％的伤害为真实伤害",
}

ItemInfo[462]={
"Ｌ习得外功：劈石破玉拳",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[463]={
"Ｌ习得外功：混元掌",
"Ｎ",
"Ｗ武功威力：375",
"Ｗ武功气攻：800",
"Ｗ内力消耗：280",
"Ｗ武功范围：■ 10+5×5格",
"Ｎ",
"Ｄ组合特效：混元掌+混元功or混沌气决",
"Ｗ◇混元一气：使用任意武功，攻击附带5~15点内伤及集气紊乱",
"Ｎ",
"Ｄ组合特效：太极拳or混元掌or白蟒鞭法+混元功or混沌气决+纯阳无极，使用太极拳or混元掌or白蟒鞭法攻击",
"Ｗ◇闪电五连鞭：必中，附带30点真伤，必定五连，对自己附加10时序的集气紊乱（羞耻的文字特效，酷炫的闪电特效）",
"Ｗ◇武当2级以上弟子不会附加集气紊乱",
"Ｎ",
"Ｄ组合特效：太极拳+混元掌+白蟒鞭法+混元功or混沌气决+纯阳无极，主运混元功or混沌气决",
"Ｗ◇接：被打第一下时触发，伤害减少20％",
"Ｗ◇化：被打第二下时触发，为自己储存等同于杀气1/2的伤害",
"Ｗ◇发：被打第三下时触发，先手反击，50％几率为盲目攻击，接化发重新计算 ",
"Ｎ",
"Ｚ特别说明：",                                     --问题不断
}

ItemInfo[464]={
"Ｌ习得外功：伏虎拳",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[465]={
"Ｌ习得外功：鹰蛇生死搏",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：15",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                      --小飞侠
}

ItemInfo[466]={
"Ｌ习得外功：泼墨披麻剑",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[467]={
"Ｌ习得外功：七玹无形剑",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：10",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[468]={
"Ｌ习得内功：九霄仙息",
"Ｎ",
"Ｄ运功效果：",
"Ｗ行动后小概率再次行动",
"Ｗ敌我行动后，降低全体敌方当前生命9%，若行动后敌人已损失最大生命值的90%，则直接被剑气降低生命至0",
"Ｗ行动后开始记录受到的伤害，下次行动前恢复记录值一半的生命、内力",
"Ｗ时序恢复19点生命、39点内力、3点体力",
"Ｗ每3时序恢复1点内伤、1点封穴",
"Ｎ",
"Ｄ被动效果：",
"Ｗ攻击时体力消耗-2",
"Ｗ攻击时额外根据自身御剑值增加伤害、气攻",
"Ｗ被攻击根据自身御剑值减少伤害、增加气防",
"Ｗ行动后恢复自身御剑值一半的生命、内力",
"Ｎ",
"Ｄ组合特效：主运九霄仙息+怒涛海潮功",
"Ｗ◇九霄剑气消耗体力-2",
"Ｗ◇剑气凝聚·散：行动结束后敌全体按百分比降低生命值",
"Ｗ◇剑气感应·斩：部分时序后行动结束后敌全体按百分比降低生命值",
"Ｗ◇行动结束后根据自身50%剑系恢复生命、内力并触发再次行动",
"Ｗ◇时序恢复生命19点，内力39点，体力3点",
"Ｗ◇攻击时自身剑系50%为基础增加伤害并扣除生命",
"Ｗ◇被攻击时自身剑系50%为基础增加防御并恢复生命",
"Ｗ◇每时序恢复1点封穴值",
"Ｗ◇霸体护盾，初始9层，被攻击后抵消1层，30时序恢复1层，可以被天魔和破尽天下清零",
"Ｗ◇特殊人物：独孤、阿青、李白自带，逍遥子-不自带",
"Ｎ",
"Ｚ特别说明：",                                     --问题不断
}

ItemInfo[469]={
"Ｌ习得外功：黑血神针功",
"Ｎ",
"Ｗ武功威力：9",
"Ｗ武功气攻：9",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｗ◇暗器伤害随敌人黑血毒层数增加，敌人生命值越低伤害越高，如果敌方没有逆杀状态，日月神教教徒额外附加5时序的神教逆杀",
"Ｗ◇敌人附加1层“黑血毒”，叠加6层以上时敌人行动前概率引发毒爆造成黑血毒层数范围内敌人生命损失，并溅射剧毒、黑血毒，10层以上时行动后清零",
"Ｗ◇暗器必然触发下面两个特效之一：",
"Ｗ◇黑血破命：附加敌人当前血量7%的伤害，敌人生命值越低，附加“败血破命”的概率越大",
"Ｗ◇黑血断筋：为敌人附加1层脆弱状态，当敌人身上脆弱状态达到3层及以上时，额外附加“封气绝脉”",
"Ｗ◇战意爆发或怒气爆发时，射出暗器提高自身行动后集气位置，东方不败必触发",
"Ｎ",
"Ｚ特别说明：",                                     --问题不断
}

ItemInfo[470]={
"Ｌ习得外功：葵花神针功",
"Ｎ",
"Ｗ武功威力：9",
"Ｗ武功气攻：9",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：葵花神针+主运葵花宝典",
"Ｗ◇以奇门系数和暗器系数增加伤害",
"Ｗ◇集气位置900，使用葵花神针攻击忽视绝对气防，必流血",
"Ｗ◇基础效果（必出）：",
"Ｗ◇攻击刺目状态的敌人，必然附加封穴以及「残劲袭魄」陷阱",
"Ｗ◇被攻击者的集气速度如果低于攻击者，则伤害根据二者集气速度差值增加",
"Ｗ◇满怒气时行动，若敌方有流血，则附加等同于流血的真实伤害",
"Ｗ◇几率性效果：",
"Ｗ◇破空千影：当自身的集气速度高于所有场上敌人时，发动二次攻击特效（不是左右，不会被打断）",
"Ｗ◇空寂之蝉几率触发极意，增加1500点气攻，该次攻击必中且享受二回合集气速度变为1.5倍",
"Ｗ◇以下四个效果在攻击时四选一触发：",
"Ｗ◇依云：全场附加迟缓30层、毒击以及锁足",
"Ｗ◇光君：全屏刺目、并解除所有我方对的刺目",
"Ｗ◇六合：此次攻击必定爆击、享受神兵状态20时序、加速内伤、中毒、封穴的恢复",
"Ｗ◇随风：在下一次攻击前，集气速度+10；对全场敌方附加回气负值的陷阱",
"Ｎ",
"Ｚ特别说明：辟邪剑法与葵花神针联动",
"Ｎ",                                     --问题不断
}

ItemInfo[471]={
"Ｌ习得外功：天南易阳决",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇每3时序恢复1点内伤",
"Ｗ◇攻击时根据敌人灼烧额外增加伤害",
"Ｗ◇使用指法概率为敌人附加阳气侵蚀",
"Ｗ◇无视灼烧带来的基础异常",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇使用六脉剑法时，概率无视敌人一半指法",
"Ｗ◇时序恢复10~15点内力",
"Ｗ◇攻击必灼烧",
"Ｎ",
"Ｄ组合特效：枯荣禅功+冰火阴阳诀or天南易阳决",
"Ｗ◇附加内力最大值5%的伤害",
"Ｗ◇枯禅真诀·气护心脉：概率消耗600内力减伤60%+600固定减伤，大理门人进入转龙呼吸状态",
"Ｗ◇枯禅真诀·气锁周天：概率点燃敌人并附加封穴",
"Ｗ◇特殊人物：段思平-自带，枯荣-学会枯荣禅功",
"Ｎ",
"Ｄ组合特效：主运天南易阳决+枯荣禅功",
"Ｗ◇天南易阳·导气归虚：攻击时根据自身现有内力增加伤害，根据敌方现有内力恢复自身内力，如果自身内力保持在3000以上，每次攻击自身降低15点内伤、中毒",
"Ｗ◇天南易阳·变化无穷：攻击时敌人基础负面状态增加25点，被攻击的敌人将会受到天南气劲侵蚀10时序，每掉血50点",
"Ｗ◇特殊人物：段思平-自带，段誉-主运天南，六脉玄机-大理门人可以自运天南",
"Ｎ",
"Ｚ特别说明：",                                     --问题不断
}

ItemInfo[472]={
"Ｌ习得外功：玄武真功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇攻击时根据使用对应武学增伤，触发对应武学的效果",
"Ｗ◇被攻击时根据对方使用的武学减伤",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇集气+10",
"Ｎ",
"Ｄ组合特效：主运玄武真功+长生诀or神照经+九阴真经+先天功",
"Ｗ◇玄武真气护体：被攻击时必触发，根据敌人使用的攻击类型，对应的自身兵器值减伤",
"Ｗ◇玄武真功行动前休息，几率清除高级异常",
"Ｗ◇三绝招实战300以上时解锁，三绝招必触发其中之一，不能同时触发多个",
"Ｗ   守招·十方无敌：全屏十方无敌100时序",
"Ｗ   杀招·十方皆灭：全屏敌人损失生命、内力",
"Ｗ   进招·十方皆杀：超大范围极意攻击，根据自身内力增伤",
"Ｗ◇30%概率根据使用武学触发特效，并根据对应武学兵器值增伤",
"Ｗ   拳法：敌人增加20点内伤，清除自身基础异常",
"Ｗ   指法：敌人增加20点封穴，减少集气位置100点",
"Ｗ   剑法：敌人冰封、灼烧增加25点，减少体力5点",
"Ｗ   刀法：敌人增加20点流血，内力减少300-500点",
"Ｗ   棍法：敌人增加20点中毒，生命减少武功威力对应的点数",
"Ｗ◇特殊人物：竹老板-自带",
"Ｗ◇天赋玄门正宗-主运玄武真功就可以享受玄武真功组合效果",
"Ｎ",
}

ItemInfo[473]={
"Ｌ习得轻功：暗香疏影",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇加速所有集氣負面效果的解除速度",
"Ｎ",
"Ｄ进阶效果：主运对应轻功，运功者轻功大于300，称号等级为一流或以上",
"Ｗ◇「疏影」，所有瞬疑效果增加一格瞬移距离，增加10％",
"Ｎ",
"Ｄ高阶效果：主运对应轻功，基础轻功（不计算额外增加）大于500，称号等级为宗师或以上，目前敌人不享受",
"Ｗ◇免疫集气紊乱、集气倒退、集气停止效果",
"Ｗ◇进入战斗时就会随机施放四大暗香之一，每次行动结束后随机切换四大暗香之一：",
"Ｗ◇失魂香：敌方在此回合的攻击伤害降低，机率为零，低机率变为回血",
"Ｗ◇忘心香：敌方被攻击不增加怒气，其他加怒气效果的怒气增幅减半",
"Ｗ◇迷情香：敌方在行动前机率触发混乱状态",
"Ｗ◇幻梦香：敌方攻击时必定扣除自身少量血量、内力消耗翻倍且机率打空",
"Ｎ",
"Ｄ天轻效果：主运对应轻功，拥有对应天赋轻功",
"Ｗ◇净华香：集气速度超过50之后，每时序机率为自己回复「集气速度-50」的血量与内力",
"Ｗ◇清檀香：被击中破绽时，不会被杀气，清除自身六项基础负面状态",
"Ｎ",
"Ｄ门派效果：主运对应轻功，加入对应门派",
"Ｗ◇日月神教：触发暴怒技之后，为自己附加三回合的中毒免疫、灼烧免疫",
"Ｎ",
"Ｄ特殊人物：主运对应轻功，选择对应角色",
"Ｗ◇东方不败：机率在触发真葵花移行之后，自身进入战意爆发状态",
}

ItemInfo[474]={
"Ｌ习得外功：奇门五转",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇被攻击时5%几率将一半伤害转化为自身护盾",
"Ｗ◇被攻击时5%几率将一半伤害转化为对方掉血",
"Ｗ◇被攻击时5%几率将一半伤害转化为内力回复",
"Ｗ◇被攻击时5%几率攻击转给随机敌方承受",
"Ｗ◇被攻击时5%几率转移自身位置",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇被攻击时5%几率将杀气效果转由对方承受",
"Ｗ◇被攻击时5%根据敌方杀气提高集气位置",
"Ｗ◇武功威力提高5%",
"Ｗ◇加力/护体/出招几率提高5%",
"Ｗ◇气攻/气防提高5%",
"Ｎ",
"Ｄ组合特效：碧海潮生+奇门五转",
"Ｗ◇桃花乐音·碧海潮生曲-概率降低全场敌人60点内力，没有内力则降低生命",
"Ｗ◇攻击必然全场触发悲欢离合其中之一：",
"Ｗ◇潮音·悲曲·芳魂辞泪-敌人根据怒气值扣血，并怒气值减半",
"Ｗ◇潮音·欢曲·红烛鸾帐-增加15点冰封、灼烧，并时序扣血",
"Ｗ◇潮音·离曲·不思难忘-小概率冻结敌人，反之减少集气速度",
"Ｗ◇潮音·合曲·湖桥伞下-恢复我方150生命、300内力、3体力",
"Ｗ◇特殊人物：东邪、冯蘅、黄蓉-自带",                                  --问题不断
"Ｎ",
"Ｄ组合特效：碧海潮生功+奇门五转+灵鳌步",
"Ｗ◇攻击范围+2",
"Ｗ◇桃花绝技·落英缤纷：攻击附加6点内伤值、封穴值",
"Ｗ◇桃花绝技·狂风忽起：现有内力的16%触发35%真实伤害，内力的16%触发扣除内力",
"Ｗ◇桃花绝技·五虚一实：攻击时周围6格内触发创伤效果20-30时序",
"Ｗ◇桃花绝技·回风拂柳：体力减少3点，集气紊乱15时序",
"Ｗ◇桃花绝技·落英漫天：闪避攻击（普通）",
"Ｗ◇特殊人物：东邪自带", 
}

ItemInfo[475]={
"Ｌ习得外功：劈空掌",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[476]={
"Ｌ习得外功：碧波掌",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：300",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[477]={
"Ｌ习得外功：落英剑法",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：0 田字",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[478]={
"Ｌ习得外功：一字电剑",
"Ｎ",
"Ｗ武功威力：175",
"Ｗ武功气攻：300",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习周公剑法一脉相承",                                    --小飞侠
}

ItemInfo[479]={
"Ｌ习得外功：圣火令诀",
"Ｎ",
"Ｗ武功威力：900",
"Ｗ武功气攻：900",
"Ｗ内力消耗：10",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：圣火令诀+主运圣火神功",
"Ｗ◇应左则前：敌方轻功越高伤害越高",
"Ｗ◇需右乃后：攻击时无视系数差必然增伤，机率使敌方进入混乱状态或头晕目眩",
"Ｗ◇三虚七实：敌方无闪避时增伤30%；有闪避时变为必中",
"Ｗ◇无中生有：该场战斗中损失的血量会累积起来，并根据当前血量计算机率（血越少机率越高，保底15%），于攻击时附加等同累积量1/2的伤害、被攻击时减少等同累积量1/2的伤害",
"Ｎ",
"Ｚ特别说明：",                                     --问题不断
}

ItemInfo[480]={
"Ｌ习得外功：雷公轰",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：10",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[481]={
"Ｌ习得外功：袖里乾坤",
"Ｎ",
"Ｗ武功威力：4",
"Ｗ武功气攻：4",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[482]={
"Ｌ习得外功：天王补心针",
"Ｎ",
"Ｗ武功威力：6",
"Ｗ武功气攻：6",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[483]={
"Ｌ习得外功：八仙剑法",
"Ｎ",
"Ｗ武功威力：300",
"Ｗ武功气攻：600",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[484]={
"Ｌ习得外功：天遁剑法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[485]={
"Ｌ习得外功：摧心掌",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：280",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｚ特别说明：",  
"Ｗ学会九阴真经后威力翻倍",                                   --小飞侠
}

ItemInfo[486]={
"Ｌ习得外功：細雨花",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：300",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｗ◇依照时序增加暗器伤害，时序越久伤害越高",
"Ｗ◇暗器攻击机率无视闪避与挪移，机率依敌我轻功差决定（保底20％）（但依然不能对东方、独孤丢暗器）",
"Ｗ◇暗器攻击时机率三连，机率依怒气值决定",
"Ｗ◇暗器上机率附有夜雨楼奇毒--「夜雨绵延」，上限五层，效果：",
"Ｗ◇每一次敌方行动前，夜雨绵延翻5倍，并敌方扣减该值血量与该值两倍内力。（不致死）",
"Ｗ◇夜雨绵延状态存续时，加力护体触发必定失败(易筋经组合例外），并附加中毒、剧毒以及夜雨绵延",
"Ｗ◇夜雨绵延状态存续时，免疫中毒失效，并增加毒素爆发的伤害",
"Ｗ◇身上有夜雨绵延时，每次行动后减少（解毒能力/50）的夜雨绵延值。可被「清除高级异常」及「清除所有异常」清除",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇商御隐--无条件",                                     --问题不断
}

ItemInfo[487]={
"Ｌ习得外功：毒龙锥",
"Ｎ",
"Ｗ武功威力：4",
"Ｗ武功气攻：4",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[488]={
"Ｌ习得外功：毒蟾砂",
"Ｎ",
"Ｗ武功威力：5",
"Ｗ武功气攻：5",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[489]={
"Ｌ习得外功：三蜈五蟆烟",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：500",
"Ｗ内力消耗：60",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｗ◇根据自身用毒能力增加伤害",
"Ｗ◇为敌人增加随机一种基础异常25点和1层加力陷阱",
"Ｗ◇当敌人流血大于50时，概率降低10点集气",
"Ｗ◇当敌人灼烧大于50时，概率附加混乱状态",
"Ｗ◇当敌人冰封大于50时，概率附加10层冰冻",
"Ｗ◇当敌人中毒大于50时，概率附加头晕目眩",
"Ｗ◇当敌人内伤大于50时，概率附加重度内伤10时序",
"Ｗ◇当敌人封穴大于30时，概率附加虚弱状态10时序",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇程灵素觉醒后自带，低级暗器，有烟无伤",                                     --问题不断
}

ItemInfo[490]={
"Ｌ习得外功：金蛇锥功",
"Ｎ",
"Ｗ武功威力：7",
"Ｗ武功气攻：7",
"Ｗ内力消耗：9",
"Ｗ武功范围：点 10格",
"Ｎ",
"Ｗ◇依照自身内力和敌方中毒程度计算伤害",
"Ｗ◇附加中毒、流血值。若敌方中毒满则附加毒击；流血值满则附加撕裂",
"Ｗ◇每一次丢暗器都会对敌方附加一层金蛇幻毒；当轮到练有金蛇锥秘籍者行动时，机率引爆全场身上有金蛇幻毒者的毒，扣减生命与内力",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇袁承志-觉醒后暗器自带金蛇锥效果",
"Ｗ◇夏雪宜-暗器自带金蛇锥效果",                                     --问题不断
}

ItemInfo[491]={
"Ｌ习得外功：千蛛万毒手",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：15",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：千蛛万毒手+连环腐尸毒+五毒神功",
"Ｗ◇毒布武林：对应武功威力增加500",
"Ｗ◇毒布武林：行动前使全场敌人中毒,随着用毒点数增加而增加，并几率叠加随机负面状态",
"Ｗ◇毒布武林：行动后触发“万毒噬心”，扣减敌方中毒值的血量",
"Ｎ",
"Ｚ特别说明：",  
"Ｗ攻击强制上毒20点，根据目标中毒值回复生命",                                   --小飞侠
}

ItemInfo[492]={
"Ｌ习得外功：五行六合拳",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：105",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[493]={
"Ｌ习得外功：上清快剑",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：线 7格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[494]={
"Ｌ习得外功：劈卦刀法",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：10",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[495]={
"Ｌ习得外功：雁行刀",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[496]={
"Ｌ习得外功：华岳三神峰",
"Ｎ",
"Ｗ武功威力：450",
"Ｗ武功气攻：900",
"Ｗ内力消耗：10",
"Ｗ武功范围：△ 5格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[497]={
"Ｌ习得外功：大九天手",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：15",
"Ｗ武功范围：米字 4格",
"Ｎ",
"Ｄ组合特效：大九天手+主运乾坤大挪移",
"Ｗ◇攻击时附加指系数伤害，再根据称号等级计算随机伤害倍数，（如果是明教中人，再额外增加1倍）",
"Ｗ◇随机触发以下一种效果： ",
"Ｗ◇  钧天：敌方封印一回合",
"Ｗ◇  苍天：极意攻击，附加内伤、重伤",
"Ｗ◇  变天：此次攻击无视敌方指系数(但优先度低于某些强制无视系数差异的特效)",
"Ｗ◇  玄天：此次攻击免疫部分敌方减伤效果",
"Ｗ◇  幽天：此次攻击附加冰封，并根据冰封值扣减内力",
"Ｗ◇  颢天：此次攻击强杀敌方150点集气",
"Ｗ◇  朱天：此次攻击给自身附加持续回复血内的buff",
"Ｗ◇  炎天：此次攻击附加灼烧，并根据灼烧扣除血量",
"Ｗ◇  阳天：此次攻击附加封穴，并根据封穴值的1/5扣除体力",
"Ｎ",
"Ｚ特别说明：",                                     --问题不断
}

ItemInfo[498]={
"Ｌ习得外功：狂风迅雷扇",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：10",
"Ｗ武功范围：田 6格",
"Ｎ",
"Ｄ组合特效：狂风迅雷扇+狂风刀法or狂风剑法+龙象般若功or极阴无相功",
"Ｗ◇根据狂风刀法、狂风剑法、狂风迅雷扇合计威力与自身真实奇门系数额外增伤",
"Ｗ◇攻击时必触发以下8特效其中1项：",
"Ｗ◇千鳥飛鳴：连击次数+1，无视敌方50％的防御，并以自身轻功附加伤害，低机率附加晕眩状态",
"Ｗ◇狩雷擊：附加自身拳系数的攻击力，附带必中效果。低机率附加晕眩",
"Ｗ◇鳴雷吼：全场敌方附加迟缓、内伤，本来就内伤超过80者附加集气紊乱效果",
"Ｗ◇烈雷：提升自身战意、怒气，并根据怒气比例增加伤害",
"Ｗ◇天鳴黑雷網：攻击触发大范围极意，低机率附加晕眩状态，无视敌方武常并必然击中破绽",
"Ｗ◇裂心之雷：无视一切条件必然附加内伤，低机率附加重度内伤、晕眩，并根据敌方内伤增加伤害",
"Ｗ◇烈雷之刃：无视所有条件必然附加流血，低机率附加撕裂、晕眩、并根据刀系数增加伤害",
"Ｗ◇萬滅悍雷：不吃反弹、反击的全屏攻击，对敌人附加虚弱、脆弱、破甲状态，并依据自身三圍附加真實傷害",
"Ｗ◇暴怒时进入「八雷神」状态：此时无法被杀气，且时序机率对全场敌人「雷殛」，扣除一定血量（有内伤则额外附加等同内伤的扣血量）并杀气。(怒气超过100即失效）",
"Ｗ◇（晕眩状态：攻击机率落空、移动格数-2、集气速度-5；被狂风迅雷功组合攻击则必然无法闪避）",
"Ｎ",
"Ｚ特别说明：主运任一组合内功即可",                                     --问题不断
}

ItemInfo[499]={
"Ｌ习得外功：大伏魔拳",
"Ｎ",
"Ｗ武功威力：600",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：大伏魔拳+主运九阴真经",
"Ｗ◇攻击时敌人必增加9点灼烧值，并根据现有灼烧值+999增加攻击",
"Ｗ◇1.九阴拳劲·刚猛：30%根据现有灼烧值X5扣除生命",
"Ｗ◇2.九阴拳劲·凤凰哀歌：攻击时30%几率9格内强制附加9点灼烧值",
"Ｗ◇3.九阴拳劲·蓝劲：攻击时30%敌人时序增加内伤、中毒、冰封、流血值10点，封穴值5点，体力时序减少3点，持续20时序",
"Ｗ◇4.九阴拳劲·赤劲：攻击时30%自身9格内敌人根据现有灼烧值时序扣除生命，持续20时序",
"Ｗ◇5.九阴拳劲·青劲：攻击时30%敌人根据现有内力的1.5%扣除生命，根据现有生命的3%扣除内力",
"Ｗ◇6.攻击距离增加至9格",
"Ｗ◇7.九阴拳势·威不可挡：45%9X9格范围攻击",
"Ｗ◇8.连击小于3次时，按3次计算",
"Ｗ◇9.附加封气绝脉效果",
"Ｗ◇10.根据自身现有内力15%+拳系总和附加真实伤害",
"Ｗ◇触发九阴大伏魔拳特效时，追加敌人最大生命值10%伤害",
"Ｗ◇特殊人物：黄裳-1~6条无条件触发并增加15%概率",
"Ｎ",                             --问题不断
}

ItemInfo[500]={
"Ｌ习得外功：阴阳磨掌",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[501]={
"Ｌ习得外功：飞凤手",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：10",
"Ｗ武功范围：十字 4格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[504]={
"Ｌ习得外功：玄女剑法",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：70",
"Ｗ武功范围：《 5",
"Ｎ",
"Ｎ",
"Ｚ特别说明：",   
"Ｗ 【女性专属】伤害、气攻增加20%",
}


ItemInfo[507]={
"Ｌ习得外功：铁剑",
"Ｎ",
"Ｗ武功威力：650",
"Ｗ武功气攻：1300",
"Ｗ内力消耗：140",
"Ｗ武功范围：《 8",
"Ｎ",
"Ｄ组合特效：铁掌or铁剑+铁布衫",
"Ｗ◇铁甲依然在：护甲提升30%，被攻击20%恢复生命最大值5%",
"Ｎ",
"Ｚ特别说明：",                                     --问题不断


}

ItemInfo[514]={
"Ｌ习得外功：大慈大悲手",
"Ｎ",
"Ｗ武功威力：400",
"Ｗ武功气攻：800",
"Ｗ内力消耗：105",
"Ｗ武功范围：3◆",
"Ｎ",
"Ｄ组合特效：慈悲刀法+大慈大悲手",
"Ｗ◇慈悲为怀：道德高于60时，60%减伤品德*6的伤害",
"Ｎ",
"Ｚ特别说明：",                                     --问题不断
}

ItemInfo[515]={
"Ｌ习得外功：韦陀掌",
"Ｎ",
"Ｗ武功威力：150",
"Ｗ武功气攻：300",
"Ｗ内力消耗：30",
"Ｗ武功范围：△ 2格",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",                                     --问题不断
"Ｚ一脉相承：",
"Ｗ◇学习大力金刚掌一脉相承",
}

ItemInfo[516]={
"Ｌ习得外功：大阴阳手",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：30",
"Ｗ武功范围：3十字 ",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[517]={
"Ｌ习得外功：屠龙刀法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：210",
"Ｗ武功范围：5直线 ",
"Ｎ",
"Ｚ特别说明：", 
"Ｗ击杀小龙女不会触发复活",                                   --小飞侠
}

ItemInfo[518]={
"Ｌ习得外功：阿难破戒刀",
"Ｎ",
"Ｗ武功威力：750",
"Ｗ武功气攻：1000",
"Ｗ内力消耗：350",
"Ｗ武功范围：5▼ ",
"Ｎ",
"Ｚ特别说明：",  
"Ｗ少林门人且学有少林心法时，敌方道德越低，刀法伤害越高",                                      --小飞侠
}

ItemInfo[519]={
"Ｌ习得外功：金龙鞭法",
"Ｎ",
"Ｗ武功威力：200",
"Ｗ武功气攻：400",
"Ｗ内力消耗：10",
"Ｗ武功范围：3井",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[520]={
"Ｌ习得外功：碧针清掌",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：20",
"Ｗ武功范围：3大米",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[522]={
"Ｌ习得外功：泰山心法",
"Ｎ",
"Ｗ武功威力：250",
"Ｗ武功气攻：500",
"Ｗ内力消耗：30",
"Ｗ武功范围：3井",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习磐石法诀一脉相承",                                    --小飞侠
}

ItemInfo[523]={
"Ｌ习得内功：通幽诀",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：500",
"Ｗ内力消耗：30",
"Ｗ武功范围：1格3*3□",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：",                                     --小飞侠
}

ItemInfo[524]={
"Ｌ习得内功：衡山心法",
"Ｎ",
"Ｗ武功威力：500",
"Ｗ武功气攻：500",
"Ｗ内力消耗：30",
"Ｗ武功范围：移1米",
"Ｎ",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ一脉相承：",
"Ｗ◇学习镇岳诀一脉相承",                                     --问题不断
}

ItemInfo[525]={
   "Ｌ习得内功：剑华皈壹",
   "Ｎ",
   "Ｄ运功效果：",
   "Ｗ◇行动后扣除5%当前内力",
   "Ｗ◇使用剑法攻击时追加20%当前内力值伤害",    
   "Ｎ",
   "Ｄ被动效果：",
   "Ｗ◇行动后扣除5%当前内力",
   "Ｗ◇使用剑法攻击时追加10%当前内力值伤害", 
   "Ｎ",
}

ItemInfo[526]={
"Ｌ习得内功：铁布衫",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇行动后扣除5%最大内力",
"Ｗ◇护甲提升20%",
"Ｗ◇承受伤害大于100时，减伤60点",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇行动后扣除5%最大内力",
"Ｗ◇护甲提升10%",
"Ｗ◇承受伤害大于100时，减伤20点",
"Ｎ",
"Ｄ组合特效：铁掌or铁剑+铁布衫",
"Ｗ◇铁甲依然在：护甲提升30%，被攻击20%恢复生命最大值5%",
"Ｎ",
"Ｄ组合特效：金刚不坏体+铁布衫+龙象般若功",
"Ｗ◇十三太保横练：免疫破绽，免疫杀气，受到伤害降低13%",
"Ｗ◇十三太保横练：当自身生命大于50％，受到足以致死的【武功伤害】时，消耗自身当前生命的60％，免疫此次攻击伤害并获得霸体状态",
"Ｗ◇（此效果对于「因特效产生的真实伤害致死」无效）",  
"Ｗ◇鳌拜-自带，天赋十三太保-自带",
"Ｎ",                            --问题不断
}

ItemInfo[527]={
"Ｌ习得外功：释迦掷象功",
"Ｎ",
"Ｗ武功威力：350",
"Ｗ武功气攻：700",
"Ｗ内力消耗：700",
"Ｗ武功范围：5◆",
"Ｎ",
"Ｄ组合特效：",
"Ｗ◇阿婆星：学会瑜伽密乘+释迦掷象功",
"Ｗ◇阿婆星：使用释迦掷象功追加自身体质X100点伤害",     
"Ｎ",
"Ｚ特别说明：",
"Ｗ必定单击",                                                                 --小飞侠
}

ItemInfo[535]={
"Ｌ习得内功：嗜血狱魔功",
"Ｎ",
"Ｗ武功威力：1500",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：60",
"Ｗ武功范围：□ 6格",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无", 
}

ItemInfo[536]={
"Ｌ习得内功：中华傲诀",
"Ｎ",
"Ｗ武功威力：2000",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：50",
"Ｗ武功范围：□ 6格",
"Ｄ组合特效：无",
"Ｎ",
"Ｚ特别说明：无", 
}

ItemInfo[537]={
"Ｌ习得内功：极阴无相功",
"Ｎ",
"Ｄ运功效果：",
"Ｗ◇无视冰冻效果带来的基础异常",
"Ｗ◇阴内专属，每21时序清除一次高级异常",
"Ｗ◇阴内专属，内力高于40%时免疫昏迷",
"Ｗ◇阴内专属，暴击时概率将敌人打成白板",
"Ｗ◇阴内专属，攻击时敌人如果不是阴内，则无法回复内力",
"Ｗ◇使用阴性武功攻击时，无视敌人的强制免疫一般伤害",
"Ｗ◇使用阴性武功攻击时，随机为敌人附加陷阱状态",
"Ｗ◇周围敌人时序增加冰封，冰封大于50时降低集气扣血，敌人冰冻抗性降低",
"Ｗ◇被攻击时概率储存伤害，直到敌人下次攻击附加额外伤害，概率时序中清除",
"Ｗ◇暴击无上限，最小5倍暴击",
"Ｗ◇免疫冰封",
"Ｎ",
"Ｄ被动效果：",
"Ｗ◇攻击概率触发小无相杂学效果",
"Ｎ",
"Ｄ组合特效：",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇基础效果",
"Ｗ◇基础威力<500的武功必然触发以下效果；基础威力>=500则低几率触发，（极阴无相功不受武功威力限制、触发机率提升）",
"Ｗ◇七宝琉璃：攻击概率无视敌人50%气防，逍遥派武学威力增加200点",
"Ｗ◇任意拳法",
"Ｗ◇扶摇直上：几率增加一次连击。以拳系数增加伤害，敌方内伤大于80时附加重度内伤",
"Ｗ◇鹏飞千里：必然内伤，如果敌方内伤满则附加重度内伤，行动后增加100点回气",
"Ｗ◇任意指法",
"Ｗ◇一点红：必然连击，最高三连，必然流血并减少等同于流血值的生命",
"Ｗ◇八仙指路：必然连击，最高三连，必暴击，暴击伤害翻倍",
"Ｗ◇任意剑法",
"Ｗ◇青龙啸天：几率触发暴击，暴击时几率清除自身基础异常（冰封等）",
"Ｗ◇凤翼天翔：随自身怒气计算，无视敌方防御（满怒气则无视70%)",
"Ｗ◇任意刀法",
"Ｗ◇剥极而复：根据战意增加伤害，战意爆发时附加虚弱与脆弱",
"Ｗ◇复无极也：根据战意计算几率，攻击时无视所有条件触发左右互搏",
"Ｗ◇任意奇门",
"Ｗ◇风随白云飞：根据自身轻功值附加伤害，必定击中",
"Ｗ◇梦中云莱境：攻击打出6x6的极意，直接扣除5%~10%的血量并附加内伤",
}

ItemInfo[541]={
"Ｌ习得外功：霹雳狂刀",
"Ｎ",
"Ｗ武功威力：750",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：60",
"Ｗ武功范围：△ 7格",
"Ｎ",
"Ｄ组合特效：霹雳狂刀+主运霹雳心法",
"Ｗ◇伤害翻倍",
"Ｗ◇刀气蚀体：敌人内伤增加15点，根据内伤值2倍减少生命，集气紊乱20时序",
"Ｗ◇狂刀决：",
"Ｗ◇  春雨：生命值减少100点",
"Ｗ◇  夏芒：内力值减少300点",
"Ｗ◇  秋露：体力值减少1点",
"Ｗ◇  冬雪：中毒值增加10点",
"Ｗ◇霹雳狂刀一：",
"Ｗ◇  横扫千军：封穴值增加20点",
"Ｗ◇  血战八方：流血值增加20点",
"Ｗ◇  烈火燎原：灼烧值增加20点",
"Ｗ◇  雷霆万钧：冰封值增加20点",
"Ｗ◇霹雳狂刀二：",
"Ｗ◇  灭魄：3倍封穴值扣除生命值",
"Ｗ◇  鬼雄：3倍流血值扣除生命值",
"Ｗ◇  祝融：3倍灼烧值扣除生命值",
"Ｗ◇  共工：3倍冰封值扣除生命值",
"Ｗ◇霹雳狂刀三：",
"Ｗ◇  天火围城：被攻击后怒气值减100点，昏迷1回合",
"Ｗ◇  梵天烈焰：敌全体无法攻击20时序",
"Ｗ◇  天河洪泄：自身刀系、所剩内力值总和扣除生命",
"Ｗ",
"Ｎ",
"Ｚ特别说明：无",                                         --问题不断
}

ItemInfo[542]={
"Ｌ习得内功：霹雳心法",
"Ｎ",
"Ｗ武功威力：1500",
"Ｗ武功气攻：1200",
"Ｗ内力消耗：60",
"Ｗ武功范围：□ 6格",
"Ｎ",
"Ｄ组合特效：主运霹雳心法+混沌气诀",
"Ｗ◇被攻击时伤害减半",
"Ｗ◇风扫千里：被攻击时敌人刺目一回合",
"Ｗ◇虚凝御风：被攻击时敌人无法攻击一回合",
"Ｗ◇秋江映月：气攻增加1200点，根据最大内力值增加伤害，最高不超过10倍",
"Ｗ◇风卷残云：攻击时敌人有冰封、灼烧、封穴、流血四种状态时根据数值扣除生命",
"Ｗ◇雷轰电掣：攻击时根据敌我内力差扣除生命，最大值不会超过1000点",
"Ｗ◇雨意云情：攻击时根据敌人3倍内伤、中毒状态扣除内力",
"Ｗ◇电光火石：攻击时敌人脆弱状态一回合，无明业火30时序，集气倒走20时序",
}

ItemInfo[543]={
"Ｌ习得轻功：霹雳身法",
"Ｎ",
"Ｄ基础效果：主运对应轻功",
"Ｗ◇回集气200点",
"Ｗ◇集气速度增加20点",
"Ｗ◇疾风迅雷：被攻击时可移开攻击范围，效果同迷踪步，被太极拉人克制",
}

ItemInfo[544]={
"Ｌ习得外功：万剑归宗",
"Ｎ",
"Ｗ武功威力：1500",
"Ｗ武功气攻：0",
"Ｗ内力消耗：900",
"Ｗ武功范围：《 12格",
"Ｎ",
"Ｄ组合特效：万剑归宗+九阴真经+九阳神功",
"Ｗ◇根据自身气攻追加伤害",
"Ｗ◇攻击时必触发吸体力效果，每次2点",
"Ｗ◇攻击时几率触发全屏攻击",
"Ｗ◇万剑归宗剑气：攻击附加根据自身剑系附加剑气伤害，敌人行动后触发",
"Ｗ◇万气自生：攻击时自身触发恢复状态效果",
"Ｗ◇气离脉腕·反而太冲·乾坤倒转·化柔为刚：根据自身剑系，被攻击者负状态总和扣除生命，根据所剩内力增加气攻，最高不超过1500点",
"Ｗ◇特殊人物：竹老板-无条件触发",
"Ｎ",
"Ｚ特别说明：",
"Ｗ◇攻击附加内伤、流血、封穴各20点，敌全体生命-50",
}

ItemInfo[547]={
"Ｌ习得内功：洗髓换脉",
"Ｎ",
"Ｗ◇洗髓换脉激发后为1点，之后在战斗中加力护体时，可增加随机点（江湖称号阅高加越多）。注意：空挥时的加力不会增加洗髓点数",
"Ｎ",
"Ｄ觉醒方法：洗髓点数在战斗中累积至1000点（天罡标主为700点）",
"Ｎ",
"Ｗ◇会在战斗中开启第二运功，并内力转化为天罡（本局游戏永久开启）",
"Ｎ",
"Ｚ特别说明：洗髓证果要在瑜伽大成前修炼，最好先练洗髓在练瑜伽", 
}

ItemInfo[548]={"Ｌ青竹棒","Ｎ","Ｗ阿青套装◆青竹棒","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[549]={"Ｌ浅绿青衫","Ｎ","Ｗ阿青套装◆浅绿青衫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[550]={"Ｌ羊","Ｎ","Ｗ阿青套装◆羊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[551]={"Ｌ飞天玉虎爪","Ｎ","Ｗ白虎套装◆飞天玉虎爪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[552]={"Ｌ驺虞皮裘","Ｎ","Ｗ白虎套装◆驺虞皮裘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[553]={"Ｌ驺虞","Ｎ","Ｗ白虎套装◆驺虞","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[554]={"Ｌ幻蝶扇","Ｎ","Ｗ白驼套装◆幻蝶扇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[555]={"Ｌ绣金白袍","Ｎ","Ｗ白驼套装◆绣金白袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[556]={"Ｌ骆驼","Ｎ","Ｗ白驼套装◆骆驼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[557]={"Ｌ沥泉盘龙枪","Ｎ","Ｗ北侠套装◆沥泉盘龙枪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[558]={"Ｌ龙神天铠","Ｎ","Ｗ北侠套装◆龙神天铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[559]={"Ｌ黑雕","Ｎ","Ｗ北侠套装◆黑雕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[560]={"Ｌ九弦琴","Ｎ","Ｗ碧波套装◆九弦琴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[561]={"Ｌ缀玉华裳","Ｎ","Ｗ碧波套装◆缀玉华裳","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[562]={"Ｌ猫","Ｎ","Ｗ碧波套装◆猫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[563]={"Ｌ金铃索带","Ｎ","Ｗ冰霜套装◆金铃索带","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[564]={"Ｌ雪羽披风","Ｎ","Ｗ冰霜套装◆雪羽披风","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[565]={"Ｌ九尾灵狐","Ｎ","Ｗ冰霜套装◆九尾灵狐","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[566]={"Ｌ乌兹钢刃","Ｎ","Ｗ波斯套装◆乌兹钢刃","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[567]={"Ｌ鳄神皮甲","Ｎ","Ｗ波斯套装◆鳄神皮甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[568]={"Ｌ鲨鱼","Ｎ","Ｗ波斯套装◆鲨鱼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[569]={"Ｌ毒龙银鞭","Ｎ","Ｗ超风套装◆毒龙银鞭","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[570]={"Ｌ素绸朱绫","Ｎ","Ｗ超风套装◆素绸朱绫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[571]={"Ｌ蛇蟋","Ｎ","Ｗ超风套装◆蛇蟋","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[572]={"Ｌ乾坤一气袋","Ｎ","Ｗ成昆套装◆乾坤一气袋","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[573]={"Ｌ化蕴神铠","Ｎ","Ｗ成昆套装◆化蕴神铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[574]={"Ｌ漆黑星","Ｎ","Ｗ成昆套装◆漆黑星","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[575]={"Ｌ金蛇剑","Ｎ","Ｗ承志套装◆金蛇剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[576]={"Ｌ金丝背心","Ｎ","Ｗ承志套装◆金丝背心","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[577]={"Ｌ猩猩","Ｎ","Ｗ承志套装◆猩猩","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[578]={"Ｌ银钩铁划","Ｎ","Ｗ翠山套装◆银钩铁划","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[579]={"Ｌ火浣银纱","Ｎ","Ｗ翠山套装◆火浣银纱","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[580]={"Ｌ白熊","Ｎ","Ｗ翠山套装◆白熊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[581]={"Ｌ楼兰古剑","Ｎ","Ｗ翠羽套装◆楼兰古剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[582]={"Ｌ玉女云袖","Ｎ","Ｗ翠羽套装◆玉女云袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[583]={"Ｌ兀鹰","Ｎ","Ｗ翠羽套装◆兀鹰","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[584]={"Ｌ九仪天尊","Ｎ","Ｗ达摩套装◆九仪天尊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[585]={"Ｌ辟法玄胄","Ｎ","Ｗ达摩套装◆辟法玄胄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[586]={"Ｌ狻倪","Ｎ","Ｗ达摩套装◆狻倪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[587]={"Ｌ井中水月","Ｎ","Ｗ刀王套装◆井中水月","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[588]={"Ｌ黄缠明锦","Ｎ","Ｗ刀王套装◆黄缠明锦","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[589]={"Ｌ照夜白","Ｎ","Ｗ刀王套装◆照夜白","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[590]={"Ｌ血刀","Ｎ","Ｗ狄云套装◆血刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[591]={"Ｌ乌蚕宝衣","Ｎ","Ｗ狄云套装◆乌蚕宝衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[592]={"Ｌ黄牛","Ｎ","Ｗ狄云套装◆黄牛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[593]={"Ｌ簪花绣针","Ｎ","Ｗ东方套装◆簪花绣针","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[594]={"Ｌ山河绣袍","Ｎ","Ｗ东方套装◆山河绣袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[595]={"Ｌ空速星痕","Ｎ","Ｗ东方套装◆空速星痕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[596]={"Ｌ玉箫","Ｎ","Ｗ东邪套装◆玉箫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[597]={"Ｌ软?宝甲","Ｎ","Ｗ东邪套装◆ 软?宝甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[598]={"Ｌ白驼怪蛇","Ｎ","Ｗ东邪套装◆白驼怪蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[599]={"Ｌ柳叶银狐刀","Ｎ","Ｗ毒妇套装◆柳叶银狐刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[600]={"Ｌ玄罗轻袖","Ｎ","Ｗ毒妇套装◆玄罗轻袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[601]={"Ｌ金银血蛇","Ｎ","Ｗ毒妇套装◆金银血蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[602]={"Ｌ阴阳扇","Ｎ","Ｗ段誉套装◆阴阳扇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[603]={"Ｌ浅绿青衫","Ｎ","Ｗ段誉套装◆浅绿青衫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[604]={"Ｌ莽牯朱蛤","Ｎ","Ｗ段誉套装◆莽牯朱蛤","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[605]={"Ｌ鳄嘴剪","Ｎ","Ｗ鳄神套装◆鳄嘴剪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[606]={"Ｌ鳄神皮甲","Ｎ","Ｗ鳄神套装◆鳄神皮甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[607]={"Ｌ鳄鱼","Ｎ","Ｗ鳄神套装◆鳄鱼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[608]={"Ｌ闯王军刀","Ｎ","Ｗ飞狐套装◆闯王军刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[609]={"Ｌ紫云战衣","Ｎ","Ｗ飞狐套装◆紫云战衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[610]={"Ｌ九尾灵狐","Ｎ","Ｗ飞狐套装◆九尾灵狐","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[611]={"Ｌ凤屏孔雀翎","Ｎ","Ｗ凤凰套装◆凤屏孔雀翎","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[612]={"Ｌ九龙云胄","Ｎ","Ｗ凤凰套装◆九龙云胄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[613]={"Ｌ狴犴","Ｎ","Ｗ凤凰套装◆狴犴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[614]={"Ｌ金丝芙蓉镯","Ｎ","Ｗ芙华套装◆金丝芙蓉镯","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[615]={"Ｌ浮光锦裘","Ｎ","Ｗ芙华套装◆浮光锦裘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[616]={"Ｌ蛇蟋","Ｎ","Ｗ芙华套装◆蛇蟋","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[617]={"Ｌ烂银鹤爪","Ｎ","Ｗ蝠王套装◆烂银鹤爪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[618]={"Ｌ雪羽披风","Ｎ","Ｗ蝠王套装◆雪羽披风","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[619]={"Ｌ黑玫瑰","Ｎ","Ｗ蝠王套装◆黑玫瑰","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[620]={"Ｌ打狗棒","Ｎ","Ｗ丐王套装◆打狗棒","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[621]={"Ｌ百结鹑衣","Ｎ","Ｗ丐王套装◆百结鹑衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[622]={"Ｌ漆黑星","Ｎ","Ｗ丐王套装◆漆黑星","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[623]={"Ｌ金刀黑剑","Ｎ","Ｗ公孙套装◆金刀黑剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[624]={"Ｌ幽旛魂锦","Ｎ","Ｗ公孙套装◆幽旛魂锦","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[625]={"Ｌ彩雪蛛","Ｎ","Ｗ公孙套装◆彩雪蛛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[626]={"Ｌ倚天剑","Ｎ","Ｗ郭襄套装◆倚天剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[627]={"Ｌ天都雾月","Ｎ","Ｗ郭襄套装◆天都雾月","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[628]={"Ｌ金钱豹","Ｎ","Ｗ郭襄套装◆金钱豹","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[629]={"Ｌ绿波香露刀","Ｎ","Ｗ红药套装◆绿波香露刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[630]={"Ｌ九黎轻装","Ｎ","Ｗ红药套装◆九黎轻装","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[631]={"Ｌ羊","Ｎ","Ｗ红药套装◆羊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[632]={"Ｌ冷月宝刀","Ｎ","Ｗ胡斐套装◆冷月宝刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[633]={"Ｌ紫云战衣","Ｎ","Ｗ胡斐套装◆紫云战衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[634]={"Ｌ黑熊","Ｎ","Ｗ胡斐套装◆黑熊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[635]={"Ｌ金龙鞭","Ｎ","Ｗ胡商套装◆金龙鞭","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[636]={"Ｌ金丝缎袍","Ｎ","Ｗ胡商套装◆金丝缎袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[637]={"Ｌ碧云霞","Ｎ","Ｗ胡商套装◆碧云霞","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[638]={"Ｌ打狗棒","Ｎ","Ｗ黄蓉套装◆打狗棒","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[639]={"Ｌ软?宝甲","Ｎ","Ｗ黄蓉套装◆软?宝甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[640]={"Ｌ白雕","Ｎ","Ｗ黄蓉套装◆白雕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[641]={"Ｌ卜天钻","Ｎ","Ｗ黄衫套装◆卜天钻","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[642]={"Ｌ黄缠明锦","Ｎ","Ｗ黄衫套装◆黄缠明锦","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[643]={"Ｌ黄骝自在","Ｎ","Ｗ黄衫套装◆黄骝自在","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[644]={"Ｌ凝碧剑","Ｎ","Ｗ火手套装◆凝碧剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[645]={"Ｌ素绸朱绫","Ｎ","Ｗ火手套装◆素绸朱绫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[646]={"Ｌ豺狼","Ｎ","Ｗ火手套装◆豺狼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[647]={"Ｌ圣火令","Ｎ","Ｗ霍山套装◆圣火令","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[648]={"Ｌ幽旛魂锦","Ｎ","Ｗ霍山套装◆幽旛魂锦","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[649]={"Ｌ菩斯曲蛇","Ｎ","Ｗ霍山套装◆菩斯曲蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[650]={"Ｌ木剑","Ｎ","Ｗ剑魔套装◆木剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[651]={"Ｌ山河绣袍","Ｎ","Ｗ剑魔套装◆山河绣袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[652]={"Ｌ神雕","Ｎ","Ｗ剑魔套装◆神雕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[653]={"Ｌ九韶定音剑","Ｎ","Ｗ剑神套装◆九韶定音剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[654]={"Ｌ玄乌羽衣","Ｎ","Ｗ剑神套装◆玄乌羽衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[655]={"Ｌ天尊令","Ｎ","Ｗ剑神套装◆天尊令","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[656]={"Ｌ木剑","Ｎ","Ｗ剑圣套装◆木剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[657]={"Ｌ飙风猿铠","Ｎ","Ｗ剑圣套装◆飙风猿铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[658]={"Ｌ猩猩","Ｎ","Ｗ剑圣套装◆猩猩","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[659]={"Ｌ青竹棒","Ｎ","Ｗ剑仙套装◆青竹棒","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[660]={"Ｌ瑶池仙袖","Ｎ","Ｗ剑仙套装◆瑶池仙袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[661]={"Ｌ白猿","Ｎ","Ｗ剑仙套装◆白猿","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[662]={"Ｌ虎头金刀","Ｎ","Ｗ金刀套装◆虎头金刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[663]={"Ｌ肃霜宝裘","Ｎ","Ｗ金刀套装◆肃霜宝裘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[664]={"Ｌ黑雕","Ｎ","Ｗ金刀套装◆黑雕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[665]={"Ｌ龙凤子母环","Ｎ","Ｗ金环套装◆龙凤子母环","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[666]={"Ｌ金丝缎袍","Ｎ","Ｗ金环套装◆金丝缎袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[667]={"Ｌ灵獒","Ｎ","Ｗ金环套装◆灵獒","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[668]={"Ｌ五行轮","Ｎ","Ｗ金轮套装◆五行轮","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[669]={"Ｌ天蚕宝甲","Ｎ","Ｗ金轮套装◆天蚕宝甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[670]={"Ｌ彩雪蛛","Ｎ","Ｗ金轮套装◆彩雪蛛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[671]={"Ｌ金蛇剑","Ｎ","Ｗ金蛇套装◆金蛇剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[672]={"Ｌ凤凰织锦","Ｎ","Ｗ金蛇套装◆凤凰织锦","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[673]={"Ｌ金蛇","Ｎ","Ｗ金蛇套装◆金蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[674]={"Ｌ镔铁判官笔","Ｎ","Ｗ九真套装◆镔铁判官笔","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[675]={"Ｌ银狐披肩","Ｎ","Ｗ九真套装◆银狐披肩","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[676]={"Ｌ灵獒","Ｎ","Ｗ九真套装◆灵獒","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[677]={"Ｌ君子剑","Ｎ","Ｗ君子套装◆君子剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[678]={"Ｌ钧天珑袖","Ｎ","Ｗ君子套装◆钧天珑袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[679]={"Ｌ踏霜白","Ｎ","Ｗ君子套装◆踏霜白","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[680]={"Ｌ崆峒印","Ｎ","Ｗ崆峒套装◆崆峒印","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[681]={"Ｌ仙符法袍","Ｎ","Ｗ崆峒套装◆仙符法袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[682]={"Ｌ血蛙","Ｎ","Ｗ崆峒套装◆血蛙","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[683]={"Ｌ割鹿刀","Ｎ","Ｗ葵花套装◆割鹿刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[684]={"Ｌ雷绛纹帛","Ｎ","Ｗ葵花套装◆雷绛纹帛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[685]={"Ｌ血鸟","Ｎ","Ｗ葵花套装◆血鸟","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[686]={"Ｌ伏魔金杵","Ｎ","Ｗ力士套装◆伏魔金杵","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[687]={"Ｌ九黎轻装","Ｎ","Ｗ力士套装◆九黎轻装","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[688]={"Ｌ黄牛","Ｎ","Ｗ力士套装◆黄牛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[689]={"Ｌ碧水剑","Ｎ","Ｗ灵珊套装◆碧水剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[690]={"Ｌ玉女云袖","Ｎ","Ｗ灵珊套装◆玉女云袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[691]={"Ｌ照夜白","Ｎ","Ｗ灵珊套装◆照夜白","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[692]={"Ｌ银烟管","Ｎ","Ｗ灵素套装◆银烟管","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[693]={"Ｌ凝玉纱索","Ｎ","Ｗ灵素套装◆凝玉纱索","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[694]={"Ｌ莽牯朱蛤","Ｎ","Ｗ灵素套装◆莽牯朱蛤","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[695]={"Ｌ紫薇软剑","Ｎ","Ｗ令狐套装◆紫薇软剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[696]={"Ｌ钧天珑袖","Ｎ","Ｗ令狐套装◆钧天珑袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[697]={"Ｌ乌云盖雪","Ｎ","Ｗ令狐套装◆乌云盖雪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[698]={"Ｌ淑女剑","Ｎ","Ｗ龙女套装◆淑女剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[699]={"Ｌ胧影织衣","Ｎ","Ｗ龙女套装◆胧影织衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[700]={"Ｌ玉蜂","Ｎ","Ｗ龙女套装◆玉蜂","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[701]={"Ｌ北霸银鲨枪","Ｎ","Ｗ龙燕套装◆北霸银鲨枪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[702]={"Ｌ冰壁玉甲","Ｎ","Ｗ龙燕套装◆冰壁玉甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[703]={"Ｌ龙燕令","Ｎ","Ｗ龙燕套装◆龙燕令","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[704]={"Ｌ鹿角杖","Ｎ","Ｗ鹿杖套装◆鹿角杖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[705]={"Ｌ蚀魄幽铠","Ｎ","Ｗ鹿杖套装◆蚀魄幽铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[706]={"Ｌ黄犬","Ｎ","Ｗ鹿杖套装◆黄犬","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[707]={"Ｌ鸳鸯宝刀","Ｎ","Ｗ骆冰套装◆鸳鸯宝刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[708]={"Ｌ玄罗轻袖","Ｎ","Ｗ骆冰套装◆玄罗轻袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[709]={"Ｌ银霜逐电","Ｎ","Ｗ骆冰套装◆银霜逐电","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[710]={"Ｌ金龙鞭","Ｎ","Ｗ马王套装◆金龙鞭","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[711]={"Ｌ肃霜宝裘","Ｎ","Ｗ马王套装◆肃霜宝裘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[712]={"Ｌ追风黄","Ｎ","Ｗ马王套装◆追风黄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[713]={"Ｌ铁鸳鸯","Ｎ","Ｗ蒙帝套装◆铁鸳鸯","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[714]={"Ｌ黑天魔铠","Ｎ","Ｗ蒙帝套装◆黑天魔铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[715]={"Ｌ九花?","Ｎ","Ｗ蒙帝套装◆九花?","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[716]={"Ｌ辉耀金斧","Ｎ","Ｗ迷城套装◆辉耀金斧","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[717]={"Ｌ驼纹金胄","Ｎ","Ｗ迷城套装◆驼纹金胄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[718]={"Ｌ骆驼","Ｎ","Ｗ迷城套装◆骆驼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[719]={"Ｌ黑白双剑","Ｎ","Ｗ闵柔套装◆黑白双剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[720]={"Ｌ胧影织衣","Ｎ","Ｗ闵柔套装◆胧影织衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[721]={"Ｌ墨蹄玉兔","Ｎ","Ｗ闵柔套装◆墨蹄玉兔","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[722]={"Ｌ东皇钟","Ｎ","Ｗ明王套装◆东皇钟","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[723]={"Ｌ计都荒寰","Ｎ","Ｗ明王套装◆计都荒寰","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[724]={"Ｌ战象","Ｎ","Ｗ明王套装◆战象","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[725]={"Ｌ圣火令","Ｎ","Ｗ明尊套装◆圣火令","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[726]={"Ｌ幽日煌袍","Ｎ","Ｗ明尊套装◆幽日煌袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[727]={"Ｌ金银血蛇","Ｎ","Ｗ明尊套装◆金银血蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[728]={"Ｌ圆月弯刀","Ｎ","Ｗ魔刀套装◆圆月弯刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[729]={"Ｌ黄泉祭衣","Ｎ","Ｗ魔刀套装◆黄泉祭衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[730]={"Ｌ狻倪","Ｎ","Ｗ魔刀套装◆狻倪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[731]={"Ｌ苍狼天刃","Ｎ","Ｗ魔神套装◆苍狼天刃","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[732]={"Ｌ黑天魔铠","Ｎ","Ｗ魔神套装◆黑天魔铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[733]={"Ｌ飞云骓","Ｎ","Ｗ魔神套装◆飞云骓","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[734]={"Ｌ银丝拂尘","Ｎ","Ｗ莫愁套装◆银丝拂尘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[735]={"Ｌ雾幻云袍","Ｎ","Ｗ莫愁套装◆雾幻云袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[736]={"Ｌ金钱豹","Ｎ","Ｗ莫愁套装◆金钱豹","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[737]={"Ｌ玄铁棋盘","Ｎ","Ｗ木桑套装◆玄铁棋盘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[738]={"Ｌ金丝背心","Ｎ","Ｗ木桑套装◆金丝背心","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[739]={"Ｌ黄骢骠","Ｎ","Ｗ木桑套装◆黄骢骠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[740]={"Ｌ琥珀神环","Ｎ","Ｗ慕容套装◆琥珀神环","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[741]={"Ｌ紫灵天珠","Ｎ","Ｗ慕容套装◆紫灵天珠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[742]={"Ｌ御风乘黄","Ｎ","Ｗ慕容套装◆御风乘黄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[743]={"Ｌ天蛇杖","Ｎ","Ｗ女娲套装◆天蛇杖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[744]={"Ｌ圣灵披风","Ｎ","Ｗ女娲套装◆圣灵披风","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[745]={"Ｌ圣灵珠","Ｎ","Ｗ女娲套装◆圣灵珠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[746]={"Ｌ偷天剑","Ｎ","Ｗ平之套装◆偷天剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[747]={"Ｌ雷绛纹帛","Ｎ","Ｗ平之套装◆雷绛纹帛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[748]={"Ｌ小雪龙","Ｎ","Ｗ平之套装◆小雪龙","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[749]={"Ｌ玄铁令","Ｎ","Ｗ破天套装◆玄铁令","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[750]={"Ｌ乌蚕宝衣","Ｎ","Ｗ破天套装◆乌蚕宝衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[751]={"Ｌ黄犬","Ｎ","Ｗ破天套装◆黄犬","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[752]={"Ｌ冥煌刺","Ｎ","Ｗ千尺套装◆冥煌刺","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[753]={"Ｌ百结鹑衣","Ｎ","Ｗ千尺套装◆百结鹑衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[754]={"Ｌ鳄鱼","Ｎ","Ｗ千尺套装◆鳄鱼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[755]={"Ｌ北霸银鲨枪","Ｎ","Ｗ青龙套装◆北霸银鲨枪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[756]={"Ｌ紫金玄铠","Ｎ","Ｗ青龙套装◆紫金玄铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[757]={"Ｌ五彩神龙","Ｎ","Ｗ青龙套装◆五彩神龙","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[758]={"Ｌ血滴子","Ｎ","Ｗ清帝套装◆血滴子","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[759]={"Ｌ九龙云胄","Ｎ","Ｗ清帝套装◆九龙云胄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[760]={"Ｌ玉花骢","Ｎ","Ｗ清帝套装◆玉花骢","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[761]={"Ｌ白玉瑶琴","Ｎ","Ｗ若兰套装◆白玉瑶琴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[762]={"Ｌ银狐披肩","Ｎ","Ｗ若兰套装◆银狐披肩","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[763]={"Ｌ猫","Ｎ","Ｗ若兰套装◆猫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[764]={"Ｌ黑狼鬼索","Ｎ","Ｗ三渡套装◆黑狼鬼索","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[765]={"Ｌ辟法玄胄","Ｎ","Ｗ三渡套装◆辟法玄胄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[766]={"Ｌ战象","Ｎ","Ｗ三渡套装◆战象","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[767]={"Ｌ真武剑","Ｎ","Ｗ三丰套装◆真武剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[768]={"Ｌ神隐披风","Ｎ","Ｗ三丰套装◆神隐披风","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[769]={"Ｌ灵龟","Ｎ","Ｗ三丰套装◆灵龟","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[770]={"Ｌ焦尾琴","Ｎ","Ｗ三圣套装◆焦尾琴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[771]={"Ｌ银华月缎","Ｎ","Ｗ三圣套装◆银华月缎","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[772]={"Ｌ仙鹤","Ｎ","Ｗ三圣套装◆仙鹤","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[773]={"Ｌ蟠龙金棍","Ｎ","Ｗ僧人套装◆蟠龙金棍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[774]={"Ｌ锦斓袈裟","Ｎ","Ｗ僧人套装◆锦斓袈裟","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[775]={"Ｌ小雪龙","Ｎ","Ｗ僧人套装◆小雪龙","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[776]={"Ｌ满月雕弓","Ｎ","Ｗ射雕套装◆满月雕弓","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[777]={"Ｌ驼纹金胄","Ｎ","Ｗ射雕套装◆驼纹金胄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[778]={"Ｌ九花?","Ｎ","Ｗ射雕套装◆九花?","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[779]={"Ｌ玄铁剑","Ｎ","Ｗ神雕套装◆玄铁剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[780]={"Ｌ玄乌羽衣","Ｎ","Ｗ神雕套装◆玄乌羽衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[781]={"Ｌ菩斯曲蛇","Ｎ","Ｗ神雕套装◆菩斯曲蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[782]={"Ｌ龙牙击","Ｎ","Ｗ狮王套装◆龙牙击","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[783]={"Ｌ驺虞皮裘","Ｎ","Ｗ狮王套装◆驺虞皮裘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[784]={"Ｌ白熊","Ｎ","Ｗ狮王套装◆白熊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[785]={"Ｌ嵩阳铁剑","Ｎ","Ｗ嵩阳套装◆嵩阳铁剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[786]={"Ｌ紫练华衣","Ｎ","Ｗ嵩阳套装◆紫练华衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[787]={"Ｌ黑木令","Ｎ","Ｗ嵩阳套装◆黑木令","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[788]={"Ｌ玄铁匕首","Ｎ","Ｗ苏荃套装◆玄铁匕首","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[789]={"Ｌ轻绸舞袖","Ｎ","Ｗ苏荃套装◆轻绸舞袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[790]={"Ｌ五彩神龙","Ｎ","Ｗ苏荃套装◆五彩神龙","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[791]={"Ｌ昆仑镜","Ｎ","Ｗ太白套装◆昆仑镜","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[792]={"Ｌ飙风猿铠","Ｎ","Ｗ太白套装◆飙风猿铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[793]={"Ｌ白猿","Ｎ","Ｗ太白套装◆白猿","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[794]={"Ｌ峨嵋分水刺","Ｎ","Ｗ桃花套装◆峨嵋分水刺","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[795]={"Ｌ七色蝶裳","Ｎ","Ｗ桃花套装◆七色蝶裳","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[796]={"Ｌ汗血宝马","Ｎ","Ｗ桃花套装◆汗血宝马","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[797]={"Ｌ剑盾珠索","Ｎ","Ｗ天池套装◆剑盾珠索","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[798]={"Ｌ银华月缎","Ｎ","Ｗ天池套装◆银华月缎","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[799]={"Ｌ豺狼","Ｎ","Ｗ天池套装◆豺狼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[800]={"Ｌ白虹剑","Ｎ","Ｗ天鹰套装◆白虹剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[801]={"Ｌ火浣银纱","Ｎ","Ｗ天鹰套装◆火浣银纱","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[802]={"Ｌ玉面火猴","Ｎ","Ｗ天鹰套装◆玉面火猴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[803]={"Ｌ精钢指套","Ｎ","Ｗ铁丑套装◆精钢指套","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[804]={"Ｌ荧煌明光","Ｎ","Ｗ铁丑套装◆荧煌明光","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[805]={"Ｌ冰蚕","Ｎ","Ｗ铁丑套装◆冰蚕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[806]={"Ｌ金蜈钩","Ｎ","Ｗ铁手套装◆金蜈钩","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[807]={"Ｌ紫薇仙衣","Ｎ","Ｗ铁手套装◆紫薇仙衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[808]={"Ｌ金蛇","Ｎ","Ｗ铁手套装◆金蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[809]={"Ｌ冥煌刺","Ｎ","Ｗ铁掌套装◆冥煌刺","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[810]={"Ｌ紫金玄铠","Ｎ","Ｗ铁掌套装◆紫金玄铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[811]={"Ｌ追风黄","Ｎ","Ｗ铁掌套装◆追风黄","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[812]={"Ｌ毒针指环","Ｎ","Ｗ顽童套装◆毒针指环","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[813]={"Ｌ仙符法袍","Ｎ","Ｗ顽童套装◆仙符法袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[814]={"Ｌ鲨鱼","Ｎ","Ｗ顽童套装◆鲨鱼","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[815]={"Ｌ点钢峨嵋刺","Ｎ","Ｗ婉清套装◆点钢峨嵋刺","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[816]={"Ｌ舞风霓裳","Ｎ","Ｗ婉清套装◆舞风霓裳","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[817]={"Ｌ黑玫瑰","Ｎ","Ｗ婉清套装◆黑玫瑰","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[818]={"Ｌ金银小剑","Ｎ","Ｗ文秀套装◆金银小剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[819]={"Ｌ羊皮长袍","Ｎ","Ｗ文秀套装◆羊皮长袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[820]={"Ｌ踏霜白","Ｎ","Ｗ文秀套装◆踏霜白","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[821]={"Ｌ真武剑","Ｎ","Ｗ我行套装◆真武剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[822]={"Ｌ绣金白袍","Ｎ","Ｗ我行套装◆绣金白袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[823]={"Ｌ血鸟","Ｎ","Ｗ我行套装◆血鸟","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[824]={"Ｌ屠龙刀","Ｎ","Ｗ无忌套装◆屠龙刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[825]={"Ｌ幽日煌袍","Ｎ","Ｗ无忌套装◆幽日煌袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[826]={"Ｌ血蛙","Ｎ","Ｗ无忌套装◆血蛙","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[827]={"Ｌ九仪天尊","Ｎ","Ｗ无名套装◆九仪天尊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[828]={"Ｌ神隐披风","Ｎ","Ｗ无名套装◆神隐披风","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[829]={"Ｌ驺虞","Ｎ","Ｗ无名套装◆驺虞","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[830]={"Ｌ蝎尾鞭","Ｎ","Ｗ五毒套装◆蝎尾鞭","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[831]={"Ｌ凝玉纱索","Ｎ","Ｗ五毒套装◆凝玉纱索","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[832]={"Ｌ花斑毒蝎","Ｎ","Ｗ五毒套装◆花斑毒蝎","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[833]={"Ｌ白龙剑","Ｎ","Ｗ武当套装◆白龙剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[834]={"Ｌ玄武道装","Ｎ","Ｗ武当套装◆玄武道装","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[835]={"Ｌ青驴","Ｎ","Ｗ武当套装◆青驴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[836]={"Ｌ天蛇杖","Ｎ","Ｗ西毒套装◆天蛇杖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[837]={"Ｌ计都荒寰","Ｎ","Ｗ西毒套装◆计都荒寰","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[838]={"Ｌ白驼怪蛇","Ｎ","Ｗ西毒套装◆白驼怪蛇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[839]={"Ｌ玄铁剑","Ｎ","Ｗ西狂套装◆玄铁剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[840]={"Ｌ天瑞华绫","Ｎ","Ｗ西狂套装◆天瑞华绫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[841]={"Ｌ神雕","Ｎ","Ｗ西狂套装◆神雕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[842]={"Ｌ海月清辉","Ｎ","Ｗ惜花套装◆海月清辉","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[843]={"Ｌ缀玉华裳","Ｎ","Ｗ惜花套装◆缀玉华裳","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[844]={"Ｌ九霄环佩","Ｎ","Ｗ惜花套装◆九霄环佩","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[845]={"Ｌ玉剑","Ｎ","Ｗ香香套装◆玉剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[846]={"Ｌ轻绸舞袖","Ｎ","Ｗ香香套装◆轻绸舞袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[847]={"Ｌ碧云霞","Ｎ","Ｗ香香套装◆碧云霞","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[848]={"Ｌ黑玉碎星镯","Ｎ","Ｗ襄儿套装◆黑玉碎星镯","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[849]={"Ｌ浮光锦裘","Ｎ","Ｗ襄儿套装◆浮光锦裘","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[850]={"Ｌ青驴","Ｎ","Ｗ襄儿套装◆青驴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[851]={"Ｌ伏羲琴","Ｎ","Ｗ逍遥套装◆伏羲琴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[852]={"Ｌ瑶池仙袖","Ｎ","Ｗ逍遥套装◆瑶池仙袖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[853]={"Ｌ云狐","Ｎ","Ｗ逍遥套装◆云狐","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[854]={"Ｌ锯齿钢盾","Ｎ","Ｗ萧峰套装◆锯齿钢盾","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[855]={"Ｌ龙神天铠","Ｎ","Ｗ萧峰套装◆龙神天铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[856]={"Ｌ狴犴","Ｎ","Ｗ萧峰套装◆狴犴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[857]={"Ｌ罗剎火枪","Ｎ","Ｗ小宝套装◆罗剎火枪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[858]={"Ｌ天蚕宝甲","Ｎ","Ｗ小宝套装◆天蚕宝甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[859]={"Ｌ玉花骢","Ｎ","Ｗ小宝套装◆玉花骢","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[860]={"Ｌ柔丝索","Ｎ","Ｗ星宿套装◆柔丝索","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[861]={"Ｌ黄泉祭衣","Ｎ","Ｗ星宿套装◆黄泉祭衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[862]={"Ｌ冰蚕","Ｎ","Ｗ星宿套装◆冰蚕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[863]={"Ｌ神农鼎","Ｎ","Ｗ虚竹套装◆神农鼎","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[864]={"Ｌ冥契法衣","Ｎ","Ｗ虚竹套装◆冥契法衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[865]={"Ｌ白鹿","Ｎ","Ｗ虚竹套装◆白鹿","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[866]={"Ｌ降魔禅杖","Ｎ","Ｗ玄澄套装◆降魔禅杖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[867]={"Ｌ荧煌明光","Ｎ","Ｗ玄澄套装◆荧煌明光","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[868]={"Ｌ犀牛","Ｎ","Ｗ玄澄套装◆犀牛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[869]={"Ｌ黑白双剑","Ｎ","Ｗ玄素套装◆黑白双剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[870]={"Ｌ黑缎笼衫","Ｎ","Ｗ玄素套装◆黑缎笼衫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[871]={"Ｌ乌云盖雪","Ｎ","Ｗ玄素套装◆乌云盖雪","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[872]={"Ｌ洞佩蝶恋花","Ｎ","Ｗ玄武套装◆洞佩蝶恋花","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[873]={"Ｌ玄武道装","Ｎ","Ｗ玄武套装◆玄武道装","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[874]={"Ｌ灵龟","Ｎ","Ｗ玄武套装◆灵龟","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[875]={"Ｌ血刀","Ｎ","Ｗ血刀套装◆血刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[876]={"Ｌ锦斓袈裟","Ｎ","Ｗ血刀套装◆锦斓袈裟","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[877]={"Ｌ黄骢骠","Ｎ","Ｗ血刀套装◆黄骢骠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[878]={"Ｌ镔铁杖","Ｎ","Ｗ延庆套装◆镔铁杖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[879]={"Ｌ冰月皇衣","Ｎ","Ｗ延庆套装◆冰月皇衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[880]={"Ｌ醉人蜂","Ｎ","Ｗ延庆套装◆醉人蜂","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[881]={"Ｌ君子剑","Ｎ","Ｗ杨过套装◆君子剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[882]={"Ｌ黑缎笼衫","Ｎ","Ｗ杨过套装◆黑缎笼衫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[883]={"Ｌ黄骝自在","Ｎ","Ｗ杨过套装◆黄骝自在","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[884]={"Ｌ妖刀村正","Ｎ","Ｗ妖刀套装◆妖刀村正","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[885]={"Ｌ化蕴神甲","Ｎ","Ｗ妖刀套装◆化蕴神甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[886]={"Ｌ黑木令","Ｎ","Ｗ妖刀套装◆黑木令","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[887]={"Ｌ铁浮屠","Ｎ","Ｗ一灯套装◆铁浮屠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[888]={"Ｌ冰月皇衣","Ｎ","Ｗ一灯套装◆冰月皇衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[889]={"Ｌ白雕","Ｎ","Ｗ一灯套装◆白雕","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[890]={"Ｌ龙泉剑","Ｎ","Ｗ仪琳套装◆龙泉剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[891]={"Ｌ白练单衣","Ｎ","Ｗ仪琳套装◆白练单衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[892]={"Ｌ兔子","Ｎ","Ｗ仪琳套装◆兔子","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[893]={"Ｌ燕语琴","Ｎ","Ｗ盈盈套装◆燕语琴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[894]={"Ｌ七色蝶裳","Ｎ","Ｗ盈盈套装◆七色蝶裳","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[895]={"Ｌ墨蹄玉兔","Ｎ","Ｗ盈盈套装◆墨蹄玉兔","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[896]={"Ｌ海月清辉","Ｎ","Ｗ语嫣套装◆海月清辉","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[897]={"Ｌ珠璃莹甲","Ｎ","Ｗ语嫣套装◆珠璃莹甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[898]={"Ｌ醉人蜂","Ｎ","Ｗ语嫣套装◆醉人蜂","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[899]={"Ｌ逍遥神仙环","Ｎ","Ｗ玉璧套装◆逍遥神仙环","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[900]={"Ｌ珠璃莹甲","Ｎ","Ｗ玉璧套装◆珠璃莹甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[901]={"Ｌ仙鹤","Ｎ","Ｗ玉璧套装◆仙鹤","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[902]={"Ｌ铂丝掌套","Ｎ","Ｗ玉女套装◆铂丝掌套","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[903]={"Ｌ天瑞华绫","Ｎ","Ｗ玉女套装◆天瑞华绫","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[904]={"Ｌ玉蜂","Ｎ","Ｗ玉女套装◆玉蜂","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[905]={"Ｌ蟒神蛇鞭","Ｎ","Ｗ圆性套装◆蟒神蛇鞭","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[906]={"Ｌ紫练华衣","Ｎ","Ｗ圆性套装◆紫练华衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[907]={"Ｌ银霜逐电","Ｎ","Ｗ圆性套装◆银霜逐电","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[908]={"Ｌ黑狼鬼索","Ｎ","Ｗ远山套装◆黑狼鬼索","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[909]={"Ｌ羊皮长袍","Ｎ","Ｗ远山套装◆羊皮长袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[910]={"Ｌ黑熊","Ｎ","Ｗ远山套装◆黑熊","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[911]={"Ｌ轩辕剑","Ｎ","Ｗ芸诗套装◆轩辕剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[912]={"Ｌ圣灵披风","Ｎ","Ｗ芸诗套装◆圣灵披风","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[913]={"Ｌ云狐","Ｎ","Ｗ芸诗套装◆云狐","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[914]={"Ｌ倚天剑","Ｎ","Ｗ赵敏套装◆倚天剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[915]={"Ｌ凤凰织锦","Ｎ","Ｗ赵敏套装◆凤凰织锦","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[916]={"Ｌ飞云骓","Ｎ","Ｗ赵敏套装◆飞云骓","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[917]={"Ｌ暴雨梨花针","Ｎ","Ｗ针神套装◆暴雨梨花针","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[918]={"Ｌ冥契法衣","Ｎ","Ｗ针神套装◆冥契法衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[919]={"Ｌ兀鹰","Ｎ","Ｗ针神套装◆兀鹰","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[920]={"Ｌ毒龙银鞭","Ｎ","Ｗ芷若套装◆毒龙银鞭","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[921]={"Ｌ天都雾月","Ｎ","Ｗ芷若套装◆天都雾月","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[922]={"Ｌ兔子","Ｎ","Ｗ芷若套装◆兔子","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[923]={"Ｌ秋水雁翎刀","Ｎ","Ｗ钟灵套装◆秋水雁翎刀","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[924]={"Ｌ舞风霓裳","Ｎ","Ｗ钟灵套装◆舞风霓裳","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[925]={"Ｌ闪电貂","Ｎ","Ｗ钟灵套装◆闪电貂","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[926]={"Ｌ七星龙渊剑","Ｎ","Ｗ重阳套装◆七星龙渊剑","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[927]={"Ｌ冰壁玉甲","Ｎ","Ｗ重阳套装◆冰壁玉甲","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[928]={"Ｌ犀牛","Ｎ","Ｗ重阳套装◆犀牛","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[929]={"Ｌ朱雀神焰扇","Ｎ","Ｗ朱雀套装◆朱雀神焰扇","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[930]={"Ｌ雾幻云袍","Ｎ","Ｗ朱雀套装◆雾幻云袍","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[931]={"Ｌ白鹿","Ｎ","Ｗ朱雀套装◆白鹿","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[932]={"Ｌ紫金珊瑚杖","Ｎ","Ｗ紫衫套装◆紫金珊瑚杖","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[933]={"Ｌ紫薇仙衣","Ｎ","Ｗ紫衫套装◆紫薇仙衣","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[934]={"Ｌ玉面火猴","Ｎ","Ｗ紫衫套装◆玉面火猴","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[935]={"Ｌ鹤嘴笔","Ｎ","Ｗ醉鹤套装◆鹤嘴笔","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[936]={"Ｌ蚀魄幽铠","Ｎ","Ｗ醉鹤套装◆蚀魄幽铠","Ｗ◆套装特效 ","Ｎ",}
ItemInfo[937]={"Ｌ花斑毒蝎","Ｎ","Ｗ醉鹤套装◆花斑毒蝎","Ｗ◆套装特效 ","Ｎ",}