--设置全局变量CC，保存游戏中使用的常数
function SetGlobalConst2()

	--无酒不欢：基本完整的SDL2键码，便于设置快捷键
	VK_ESCAPE=27
	VK_SPACE=32				--注意这里的空格实际上不需要定义，因为底层会自动把空格转换成回车
	VK_RETURN=13
	VK_F1=1073741882
	VK_F2=1073741883
	VK_F3=1073741884
	VK_F4=1073741885
	VK_A = 97
	VK_B = 98 
	VK_C = 99 
	VK_D = 100 
	VK_E = 101
	VK_F = 102 
	VK_G = 103
	VK_H = 104 
	VK_I = 105
	VK_J = 106 
	VK_K = 107
	VK_L = 108 
	VK_M = 109
	VK_N = 110 
	VK_O = 111
	VK_P = 112 
	VK_Q = 113
	VK_R = 114 
	VK_S = 115
	VK_T = 116 
	VK_U = 117
	VK_V = 118 
	VK_W = 119
	VK_X = 120 
	VK_Y = 121
	VK_Z = 122 
	
	VK_BACKSPACE = 8

	VK_UP=1073741906
	VK_DOWN=1073741905
	VK_LEFT=1073741904
	VK_RIGHT=1073741903
	VK_PGUP=1073741899
	VK_PGDN=1073741902
		
	-- 游戏中颜色定义
	C_GRAY22 = RGB(68, 68, 68)
	C_BLUE = RGB(7, 99, 219)
	C_WSTM = RGB(0, 0, 0)  --属性面板用	
	C_CYGOLD = RGB(216, 214, 175)  --属性面板用
	C_STARTMENU = RGB(132, 0, 4)
	C_RED = RGB(216, 20, 24) --红
	C_WHITE = RGB(236, 236, 236) --白
	C_ORANGE = RGB(252, 148, 16) --橘色
	C_GOLD = RGB(236, 200, 40) --金
	C_BLACK = RGB(0, 0, 0) --黑色
	M_Black = RGB(0, 0, 0) --黑色
	M_Sienna = RGB(160, 82, 45) --褐色
	M_DarkOliveGreen = RGB(85, 107, 47)--深绿 
	M_DarkGreen = RGB(0, 100, 0) --深绿
	M_DarkSlateBlue = RGB(72, 61, 139) --板岩暗蓝灰色
	M_Navy = RGB(0, 0, 128) --海军蓝
	M_Indigo = RGB(75, 0, 130) --靓蓝色
	M_DarkSlateGray = RGB(47, 79, 79) --深青色
	M_DarkRed = RGB(139, 0, 0) -- 深红
	M_DarkOrange = RGB(255, 140, 0) --深橘色
	M_Olive = RGB(128, 128, 0) --橄榄色
	M_Green = RGB(0, 128, 0) --绿
	M_Teal = RGB(0, 128, 128) --水绿
	M_Blue = RGB(0, 0, 255) --蓝
	M_SlateGray = RGB(112, 128, 144) --灰石
	M_DimGray = RGB(105, 105, 105) --暗灰
	M_Red = RGB(255, 0, 0) --红
	M_SandyBrown = RGB(244, 164, 96) --黄褐色
	M_YellowGreen = RGB(154, 205, 50) --黄绿
	M_SeaGreen = RGB(46, 139, 87) --海绿
	M_MediumTurquoise = RGB(72, 209, 204) --宝石绿
	M_RoyalBlue = RGB(65, 105, 225) --宝蓝色
	M_Purple = RGB(128, 0, 128) -- 紫
	M_Gray = RGB(128, 128, 128) --灰
	M_Magenta = RGB(255, 0, 255) --洋红
	M_Orange = RGB(255, 165, 0) --橘色
	M_Yellow = RGB(255, 255, 0) --黄
	M_Lime = RGB(0, 255, 0)  --石灰
	M_Cyan = RGB(0, 255, 255) --青色/蓝绿
	M_DeepSkyBlue = RGB(0, 191, 255) --深天蓝
	M_DarkOrchid = RGB(153, 50, 204) --深兰花紫 
	M_Silver = RGB(192, 192, 192) --银色
	M_Pink = RGB(255, 192, 203) -- 粉
	M_Wheat = RGB(245, 222, 179) --小麦色
	M_Wheat2 = RGB(205, 182, 139) --小麦色
	M_LemonChiffon = RGB(255, 250, 205) --柠檬色
	M_PaleGreen = RGB(152, 251, 152) -- 苍绿
	M_PaleTurquoise = RGB(175, 238, 238) -- 宝石绿
	M_LightBlue = RGB(173, 216, 230)   --浅蓝
	M_Plum = RGB(221, 160, 221) --紫红葡萄
	M_White = RGB(255, 255, 255) --白
	MilkWhite =RGB(255, 255, 204)  --奶白
	LimeGreen = RGB(100,200, 90) -- 灰灰绿
	Lime = RGB(0,255,0) --石灰
	LightGreen = RGB(144,238,144)  --浅绿
	LightSkyBlue = RGB(135,206,250) --深空蓝
	green1 = RGB(145, 235, 45)  --绿色1
	OliveDrab = RGB(107, 142, 35) --绿褐色
	Snow3 = RGB(205, 201, 201) --雪银
	grey21 = RGB(54, 54, 54)  --灰
	LightSlateBlue = RGB(132, 112, 255) -- 浅石蓝
	Violet = RGB(208, 152, 208) -- 紫罗兰
	PinkRed = RGB(255, 102, 102) --粉红
	LightPurple = RGB(165, 28, 218) --深紫
	Color_Hurt1 = RGB(255, 215, 0) --金
	TG_Red = RGB(216, 20, 24) --红色
	TG_Red_Bright = RGB(248, 40, 44) --亮红
	Dark_Gold = RGB(216, 180, 20) -- 黑金
	S_Yellow = RGB(245, 215, 15) --深黄
	LightYellow = RGB(255, 242, 204)  --浅黄
	LightYellow2 = RGB(255, 229, 153)  --浅黄
	LightYellow3 = RGB(255, 217, 102)  --浅黄2

	-- 游戏状态定义
    GAME_START =0       --开始画面
    GAME_FIRSTMMAP = 1  --第一次显示主地图
    GAME_MMAP =2;       --主地图
    GAME_FIRSTSMAP = 3  --第一次显示主地图
    GAME_SMAP =4;       --场景地图
    GAME_WMAP =5;       --战斗地图
	GAME_DEAD =6;       --死亡画面
    GAME_END  =7;       --结束
    GAME_NEWNAME = 8;		--开启新游戏
	
	
	--游戏数据全局变量
	CC={};				--定义游戏中使用的常量，这些可以在修改游戏时修改之

	--实际的屏幕宽度与高度
	CC.ScreenW=lib.GetScreenW();		--显示窗口宽高
    CC.ScreenH=lib.GetScreenH();

	CC.SrcCharSet=0;					--源代码的字符集 0 gb  1 big5，用于转换R×。 如果源码被转换为big5，则应设为1
	CC.OSCharSet=CONFIG.CharSet;		--OS 字符集，-1 系统判断，0 GB, 1 Big5
	CC.FontName=CONFIG.FontName;		--显示字体

	--定义记录文件名。S和D由于是固定大小，因此不再定义idx了。
	CC.R_IDXFilename = {[0] = CONFIG.DataPath .. "ranger.idx"}
	CC.R_GRPFilename = {[0] = CONFIG.DataPath .. "ranger.grp"}
	CC.S_Filename = {[0] = CONFIG.DataPath .. "allsin.grp"}
	CC.D_Filename = {[0] = CONFIG.DataPath .. "alldef.grp"}
	
	CC.SavePath = CONFIG.DataPath .. "save/";
	CC.R_GRP = CC.SavePath.."r%d.grp"
	CC.S_GRP = CC.SavePath.."s%d.grp"
	CC.D_GRP = CC.SavePath.."d%d.grp"
	CC.CS = CC.SavePath.."tjm"
	CC.SaveNum = 10;			--存档数量为10

	CC.TempS_Filename=CONFIG.DataPath .. "allsinbk.grp";

	CC.PaletteFile=CONFIG.DataPath .. "mmap.col";
   
    CC.GAMESTARTFile = CONFIG.PicturePath .. "GAMESTAR.png";
    CC.SayBoxNMFile=CONFIG.PicturePath .. "sayboxnm.png";  
    CC.SayBoxFile=CONFIG.PicturePath .. "saybox.png";
	CC.BG01File=CONFIG.PicturePath .. "bg01.png";
	CC.FirstFile=CONFIG.PicturePath .. "1000.png";
	--local n = math.random(2)
	-- local pic = {"1000.png","1001.png","1002.png"}
	
		-- -- CC.FirstFile=CONFIG.PicturePath..pic[math.random(3)];
	-- for i=1,3 do
		-- CC.FirstFile=CONFIG.PicturePath..pic[math.random(3)];
	-- end
	
	
	CC.DeadFile=CONFIG.PicturePath .. "dead.png";
    CC.JYXXFile=CONFIG.PicturePath .. "jyxx.png";
	CC.MMapFile={CONFIG.DataPath .. "earth.002",
				CONFIG.DataPath .. "surface.002",
				CONFIG.DataPath .. "building.002",
		        CONFIG.DataPath .. "buildx.002",
				CONFIG.DataPath .. "buildy.002"};

	--各种贴图文件名。这里只给出文件名，扩展名必须为idx/grp
	CC.MMAPPicFile = {CONFIG.DataPath .. "mmap.idx", CONFIG.DataPath .. "mmap.grp"}
	CC.SMAPPicFile = {CONFIG.DataPath .. "smap.idx", CONFIG.DataPath .. "smap.grp"}
	CC.WMAPPicFile = {CONFIG.DataPath .. "wmap.idx", CONFIG.DataPath .. "wmap.grp"}
	CC.EFTFile = {CONFIG.DataPath .. "eft.idx", CONFIG.DataPath .. "eft.grp"}
	CC.BJ = {CONFIG.DataPath .. "bj.idx", CONFIG.DataPath .. "bj.grp"}
	CC.FightPicFile = {CONFIG.DataPath .. "fight/fight%03d.idx", CONFIG.DataPath .. "fight/fight%03d.grp"}

	CC.BodyPath = CONFIG.DataPath .. "body/";
	CC.BodyNum = 1110;
	CC.HeadPath = CONFIG.DataPath .. "head/";
	CC.HeadNum = 1110;
	CC.ThingPicFile = {CONFIG.DataPath .. "thing.idx", CONFIG.DataPath .. "thing.grp"}
	
	CC.IconPath = CONFIG.DataPath .. "icons/";
	CC.IconNum = 1010;
  	CC.XTPath = CONFIG.DataPath .. "xt/";  
	CC.XTNum = 1100;	
	CC.UIPath = CONFIG.DataPath .. "ui/";
	CC.UINum = 1100;
	
	CC.ThingPath = CONFIG.DataPath .. "thing/";
	CC.ThingNum = 1100;
	
	CC.PTPath = CONFIG.DataPath .. "portrait/";
    CC.PTNum = 1100;
    
	
	CC.BJPath = CONFIG.DataPath .. "bj/";
	CC.BJNum = 1100;
	
	CONFIG.HelpPath = CONFIG.DataPath .. "gl/";
	-- CC.EFTPath = CONFIG.DataPath .. "eft/";
	-- CC.EFTNum = 5500;
	
    --人物总数量
    CC.PerNum = 1000;
    
	if CONFIG.MP3 == 1 then
		CC.MIDIFile=CONFIG.SoundPath .. "game%02d.mp3";
	else
		CC.MIDIFile=CONFIG.SoundPath .. "game%02d.mid";
	end
	CC.OGGFile=CONFIG.SoundPath .. "game%02d.ogg";
	CC.ATKFile=CONFIG.SoundPath .. "atk%02d.wav";
	CC.EFile=CONFIG.SoundPath .. "e%02d.wav";

	CC.WarFile=CONFIG.DataPath .. "war.sta";
	CC.WarMapFile={CONFIG.DataPath .. "warfld.idx",
                  CONFIG.DataPath .. "warfld.grp"};

	CC.TRP = CONFIG.DataPath.."talk.grp"
	CC.TDX = CONFIG.DataPath.."talk.idx"
	
	CC.Acvmts = CONFIG.DataPath .. "achievements"

	--定义记录文件R×结构。  lua不支持结构，无法直接从二进制文件中读取，因此需要这些定义，用table中不同的名字来仿真结构。
	CC.TeamNum=15;          --队伍人数
	CC.MyThingNum=950      --主角物品数量

	CC.Week = 1
	--CC.ItemInfoPath = CONFIG.ScriptPath .. "ItemInfo/"
	
	
	-- CC.pic = {"1000.png","1001.png","1002.png"}
	 --CC.n = math.random(3)
	-- if n == 1 then
		-- CC.FirstFile=CONFIG.PicturePath..CC.pic[n];
	-- elseif n == 2 then
		-- CC.FirstFile=CONFIG.PicturePath..CC.pic[n];
	-- elseif n == 3
		-- CC.FirstFile=CONFIG.PicturePath..CC.pic[n];
	-- end
	-- CC.FirstFile=CONFIG.PicturePath.."1001.png";
	
	
	
	--版本号
	CC.Version=""--版本 1.04
   
	--动态显示提示
	CC.Timer={
						stime=0,
						status=0,
						str='',
						len=0,
						fun=demostr,
					};
	--动态显示的内容
	CC.RUNSTR={
							'快捷键 F1-马车 F3-队列 F4-整理物品 H-回家',
							'多培养一些队友，可以让你后面的战斗更轻松',
							'千年灵芝是能增加体质的药品，人物体质跟主运内功决定人物生命最大值，体质最多可以提升到12点',
							'更新下载问题反馈请加 QQ群号：865420131',
							'本游戏部分素材取自铁血丹心论坛/游侠网/人在江湖/金书红颜录/黑山群侠传/金书群侠传',
							'小村的厨灶和炼丹炉可以制作药品',							
						};
	CC.TJMSJ = {} 
	CC.TJM = 0
    CC.HSLJ = {}
	CC.HSLJ2 = {}
	
	rest()
	CC.Base_S={};         --保存基本数据的结构，以便以后存取
	CC.Base_S["乘船"]={0,0,2}   -- 起始位置(从0开始)，数据类型(0有符号 1无符号，2字符串)，长度
	CC.Base_S["无用"]={2,0,2};
	CC.Base_S["人X"]={4,0,2};
	CC.Base_S["人Y"]={6,0,2};
	CC.Base_S["人X1"]={8,0,2};
	CC.Base_S["人Y1"]={10,0,2};
	CC.Base_S["人方向"]={12,0,2};
	CC.Base_S["船X"]={14,0,2};
	CC.Base_S["船Y"]={16,0,2};
	CC.Base_S["船X1"]={18,0,2};
	CC.Base_S["船Y1"]={20,0,2};
	CC.Base_S["船方向"]={22,0,2};
	CC.Base_S["难度"]={24,0,2};
	CC.Base_S["标准"]={26,0,2};
	CC.Base_S["畅想"]={28,0,2};
	CC.Base_S["特殊"]={30,0,2};
	CC.Base_S["单通"]={32,0,2};
	CC.Base_S["周目"]={34,0,2};
	CC.Base_S["天书数量"]={36,0,2};
	CC.Base_S["武功数量"]={38,0,2};
	CC.Base_S["碎片"]={40,0,2};	
	CC.Base_S["备用5"]={42,0,2};	
	CC.Base_S["备用4"]={44,0,2};	
	CC.Base_S["备用3"]={46,0,2};	
	CC.Base_S["备用2"]={48,0,2};	
	CC.Base_S["备用1"]={50,0,2};	
	for i=1,CC.TeamNum do
		CC.Base_S["队伍" .. i]={52+2*(i-1),0,2};
	end

	for i=1,CC.MyThingNum do
		CC.Base_S["物品" .. i]={82+4*(i-1),0,2};
		CC.Base_S["物品数量" .. i]={82+4*(i-1)+2,0,2};
	end

	CC.PersonSize=602;   --每个人物数据占用字节
    CC.Person_S={};      --保存人物数据的结构，以便以后存取
    CC.Person_S["代号"]={0,0,2}
    CC.Person_S["头像代号"]={2,0,2}
    CC.Person_S["生命增长"]={4,0,2}
    CC.Person_S["无用"]={6,0,2}
    CC.Person_S["姓名"]={8,2,10}
    CC.Person_S["外号"]={18,2,10}
    CC.Person_S["性别"]={28,0,2}
    CC.Person_S["等级"]={30,0,2}
    CC.Person_S["经验"]={32,1,2}
    CC.Person_S["生命"]={34,0,2}
    CC.Person_S["生命最大值"]={36,0,2}
    CC.Person_S["受伤程度"]={38,0,2}
    CC.Person_S["中毒程度"]={40,0,2}
    CC.Person_S["体力"]={42,0,2}
    CC.Person_S["物品修炼点数"]={44,0,2}
    CC.Person_S["武器"]={46,0,2}
    CC.Person_S["防具"]={48,0,2}

	for i=1,5 do
		CC.Person_S["出招动画帧数" .. i]={50+2*(i-1),0,2};
        CC.Person_S["出招动画延迟" .. i]={60+2*(i-1),0,2};
        CC.Person_S["武功音效延迟" .. i]={70+2*(i-1),0,2};
	end

    CC.Person_S["内力性质"]={80,0,2}
    CC.Person_S["内力"]={82,0,2}
    CC.Person_S["内力最大值"]={84,0,2}
    CC.Person_S["攻击力"]={86,0,2}
    CC.Person_S["轻功"]={88,0,2}
    CC.Person_S["防御力"]={90,0,2}
    CC.Person_S["医疗能力"]={92,0,2}
    CC.Person_S["用毒能力"]={94,0,2}
    CC.Person_S["解毒能力"]={96,0,2}
    CC.Person_S["抗毒能力"]={98,0,2}
    CC.Person_S["拳掌功夫"]={100,0,2}
	CC.Person_S["指法技巧"]={102,0,2}
    CC.Person_S["御剑能力"]={104,0,2}
    CC.Person_S["耍刀技巧"]={106,0,2}
    CC.Person_S["特殊兵器"]={108,0,2}
    CC.Person_S["暗器技巧"]={110,0,2}
    CC.Person_S["武学常识"]={112,0,2}
    CC.Person_S["品德"]={114,0,2}
    CC.Person_S["攻击带毒"]={116,0,2}
    CC.Person_S["左右互搏"]={118,0,2}
    CC.Person_S["声望"]={120,0,2}
    CC.Person_S["资质"]={122,0,2}
    CC.Person_S["修炼物品"]={124,0,2}
    CC.Person_S["修炼点数"]={126,0,2}

    for i=1,15 do
       CC.Person_S["武功" .. i]={128+2*(i-1),0,2};
        CC.Person_S["武功等级" .. i]={158+2*(i-1),0,2};
    end

    for i=1,4 do
        CC.Person_S["携带物品" .. i]={188+2*(i-1),0,2};
        CC.Person_S["携带物品数量" .. i]={196+2*(i-1),0,2};
    end
	
	for i=1,4 do
		CC.Person_S["天赋外功"..i]={204+2*(i-1),0,2};
	end
	
	CC.Person_S["天赋内功"]={212,0,2}
	CC.Person_S["天赋轻功"]={214,0,2}
	CC.Person_S["实战"]={216,0,2}
	CC.Person_S["出战"]={218,0,2}
	CC.Person_S["休战"]={220,0,2}
	CC.Person_S["主运内功"]={222,0,2}
	CC.Person_S["主运轻功"]={224,0,2}
	CC.Person_S["六如觉醒"]={226,0,2}
	CC.Person_S["个人觉醒"]={228,0,2}
	CC.Person_S["畅想分阶"]={230,0,2}
	CC.Person_S["外号2"]={232,2,10}
	CC.Person_S["冰封程度"]={242,0,2}
	CC.Person_S["血量翻倍"]={244,0,2}
	CC.Person_S["论剑奖励"]={246,0,2}
	CC.Person_S["灼烧程度"]={248,0,2}
	CC.Person_S["行为模式"]={250,0,2}
	CC.Person_S["优先使用"]={252,0,2}
	CC.Person_S["是否吃药"]={254,0,2}
	CC.Person_S["生命阈值"]={256,0,2}
	CC.Person_S["内力阈值"]={258,0,2}
	CC.Person_S["体力阈值"]={260,0,2}
	CC.Person_S["禁用自动"]={262,0,2}
	CC.Person_S["特色指令"]={264,0,2}
	CC.Person_S["坐骑"]={266,0,2}
	CC.Person_S["中庸"]={268,0,2}
	CC.Person_S["半身像"]={270,0,2}
	CC.Person_S["迷踪步"]={272,0,2}
	CC.Person_S["门派"]={274,0,2}
	CC.Person_S["门派位阶"]={276,0,2}
	--CC.Person_S["暂时无用"]={278,0,2}
	for i=1,8 do
		CC.Person_S["门派技能"..i]={278+2*(i-1),0,2};
	end
	CC.Person_S["流血程度"]={294,0,2}
	CC.Person_S["封穴程度"]={296,0,2}
	CC.Person_S["暂时无用"]={298,0,2}
	
	for i = 1,20 do
		CC.Person_S["指法奇穴等级"..i]={300+2*(i-1),0,2};
	end	
	for i = 1,20 do
		CC.Person_S["拳掌奇穴等级"..i]={340+2*(i-1),0,2};
	end	
	for i = 1,20 do
		CC.Person_S["耍刀奇穴等级"..i]={380+2*(i-1),0,2};
	end	
	for i = 1,20 do
		CC.Person_S["内功奇穴等级"..i]={420+2*(i-1),0,2};
	end
	for i = 1,20 do
		CC.Person_S["奇门奇穴等级"..i]={460+2*(i-1),0,2};
	end		
	for i = 1,20 do
		CC.Person_S["御剑奇穴等级"..i]={500+2*(i-1),0,2};
	end	
	for i = 21,25 do
		CC.Person_S["拳掌奇穴等级"..i]={540+2*(i-21),0,2};
	end	
	for i = 21,25 do
		CC.Person_S["指法奇穴等级"..i]={550+2*(i-21),0,2};
	end	
	for i = 21,25 do
		CC.Person_S["御剑奇穴等级"..i]={560+2*(i-21),0,2};
	end	
	for i = 21,25 do
		CC.Person_S["耍刀奇穴等级"..i]={570+2*(i-21),0,2};
	end	
	for i = 21,25 do
		CC.Person_S["奇门奇穴等级"..i]={580+2*(i-21),0,2};
	end			
	for i = 21,25 do
		CC.Person_S["内功奇穴等级"..i]={590+2*(i-21),0,2};
	end	
	CC.Person_S["武学点数"]={600,0,2}
	
	
    CC.ThingSize=202;   --每个人物数据占用字节
    CC.Thing_S={};
    CC.Thing_S["代号"]={0,0,2}
    CC.Thing_S["名称"]={2,2,20}
    CC.Thing_S["名称2"]={22,2,20}
    CC.Thing_S["物品说明"]={42,2,30}
    CC.Thing_S["练出武功"]={72,0,2}
    CC.Thing_S["暗器动画编号"]={74,0,2}
    CC.Thing_S["使用人"]={76,0,2}
    CC.Thing_S["装备类型"]={78,0,2}
    CC.Thing_S["显示物品说明"]={80,0,2}
    CC.Thing_S["类型"]={82,0,2}
    CC.Thing_S["未知5"]={84,0,2}
    CC.Thing_S["未知6"]={86,0,2}
    CC.Thing_S["未知7"]={88,0,2}
    CC.Thing_S["加生命"]={90,0,2}
    CC.Thing_S["加生命最大值"]={92,0,2}
    CC.Thing_S["加中毒解毒"]={94,0,2}
    CC.Thing_S["加体力"]={96,0,2}
    CC.Thing_S["改变内力性质"]={98,0,2}
    CC.Thing_S["加内力"]={100,0,2}
    CC.Thing_S["加内力最大值"]={102,0,2}
    CC.Thing_S["加攻击力"]={104,0,2}
    CC.Thing_S["加轻功"]={106,0,2}
    CC.Thing_S["加防御力"]={108,0,2}
    CC.Thing_S["加医疗能力"]={110,0,2}
    CC.Thing_S["加用毒能力"]={112,0,2}
    CC.Thing_S["加解毒能力"]={114,0,2}
    CC.Thing_S["加抗毒能力"]={116,0,2}
    CC.Thing_S["加拳掌功夫"]={118,0,2}
	CC.Thing_S["加指法技巧"]={120,0,2}	
    CC.Thing_S["加御剑能力"]={122,0,2}
    CC.Thing_S["加耍刀技巧"]={124,0,2}
    CC.Thing_S["加特殊兵器"]={126,0,2}
    CC.Thing_S["加暗器技巧"]={128,0,2}
    CC.Thing_S["加武学常识"]={130,0,2}
    CC.Thing_S["加品德"]={132,0,2}

    CC.Thing_S["加攻击次数"]={134,0,2}
    CC.Thing_S["加攻击带毒"]={136,0,2}
    CC.Thing_S["仅修炼人物"]={138,0,2}
    CC.Thing_S["需内力性质"]={140,0,2}
    CC.Thing_S["需内力"]={142,0,2}
    CC.Thing_S["需攻击力"]={144,0,2}
    CC.Thing_S["需轻功"]={146,0,2}
    CC.Thing_S["需用毒能力"]={148,0,2}
    CC.Thing_S["需医疗能力"]={150,0,2}
    CC.Thing_S["需解毒能力"]={152,0,2}
    CC.Thing_S["需拳掌功夫"]={154,0,2}	
	CC.Thing_S["需指法技巧"]={156,0,2}	
    CC.Thing_S["需御剑能力"]={158,0,2}
    CC.Thing_S["需耍刀技巧"]={160,0,2}
    CC.Thing_S["需特殊兵器"]={162,0,2}
    CC.Thing_S["需暗器技巧"]={164,0,2}

    CC.Thing_S["需资质"]={166,0,2}
    CC.Thing_S["需经验"]={168,0,2}
    CC.Thing_S["练出物品需经验"]={170,0,2}
    CC.Thing_S["需材料"]={172,0,2}

    for i=1,5 do
		CC.Thing_S["练出物品" .. i]={174+2*(i-1),0,2};
		CC.Thing_S["需要物品数量" .. i]={184+2*(i-1),0,2};
	end
	 
	CC.Thing_S["是否特效"]={194,0,2}
	CC.Thing_S["装备经验"]={196,0,2}
	CC.Thing_S["装备等级"]={198,0,2}
	CC.Thing_S["暂时无用"]={200,0,2}
	
    CC.SceneSize=54;   --每个场景数据占用字节
    CC.Scene_S={};
    CC.Scene_S["代号"]={0,0,2}
    CC.Scene_S["名称"]={2,2,10}
    CC.Scene_S["出门音乐"]={12,0,2}
    CC.Scene_S["进门音乐"]={14,0,2}
    CC.Scene_S["跳转场景"]={16,0,2}
    CC.Scene_S["进入条件"]={18,0,2}
    CC.Scene_S["外景入口X1"]={20,0,2}
    CC.Scene_S["外景入口Y1"]={22,0,2}
    CC.Scene_S["外景入口X2"]={24,0,2}
    CC.Scene_S["外景入口Y2"]={26,0,2}
    CC.Scene_S["入口X"]={28,0,2}
    CC.Scene_S["入口Y"]={30,0,2}
    CC.Scene_S["出口X1"]={32,0,2}
    CC.Scene_S["出口X2"]={34,0,2}
    CC.Scene_S["出口X3"]={36,0,2}
    CC.Scene_S["出口Y1"]={38,0,2}
    CC.Scene_S["出口Y2"]={40,0,2}
    CC.Scene_S["出口Y3"]={42,0,2}
    CC.Scene_S["跳转口X1"]={44,0,2}
    CC.Scene_S["跳转口Y1"]={46,0,2}
    CC.Scene_S["跳转口X2"]={48,0,2}
    CC.Scene_S["跳转口Y2"]={50,0,2}
	CC.Scene_S["场景类型"]={52,0,2}

    CC.WugongSize=148;   --每个武功数据占用字节
    CC.Wugong_S={};
    CC.Wugong_S["代号"]={0,0,2}
    CC.Wugong_S["名称"]={2,2,10}
    CC.Wugong_S["未知1"]={12,0,2}
    CC.Wugong_S["未知2"]={14,0,2}
    CC.Wugong_S["未知3"]={16,0,2}
    CC.Wugong_S["未知4"]={18,0,2}
    CC.Wugong_S["未知5"]={20,0,2}
    CC.Wugong_S["出招音效"]={22,0,2}
    CC.Wugong_S["武功类型"]={24,0,2}
    CC.Wugong_S["武功动画&音效"]={26,0,2}
    CC.Wugong_S["伤害类型"]={28,0,2}
    CC.Wugong_S["攻击范围"]={30,0,2}
    CC.Wugong_S["消耗内力点数"]={32,0,2}
    CC.Wugong_S["敌人中毒点数"]={34,0,2}

    for i=1,10 do
		CC.Wugong_S["攻击力" .. i]={36+2*(i-1),0,2};
		CC.Wugong_S["移动范围" .. i]={56+2*(i-1),0,2};
		CC.Wugong_S["杀伤范围" .. i]={76+2*(i-1),0,2};
		CC.Wugong_S["加内力" .. i]={96+2*(i-1),0,2};
		CC.Wugong_S["杀内力" .. i]={116+2*(i-1),0,2};
    end
	 
	CC.Wugong_S["冰封系数"]={136,0,2}
	CC.Wugong_S["灼烧系数"]={138,0,2}
    CC.Wugong_S["灵巧系数"]={140,0,2}
    CC.Wugong_S["力敌系数"]={142,0,2}
    CC.Wugong_S["普通系数"]={144,0,2}	
	CC.Wugong_S["暂时无用"]={146,0,2}
	CC.ShopSize=36;   --每个小宝商店数据占用字节
	CC.Shop_S={};
	for i=1,6 do
		CC.Shop_S["物品" .. i]={0+2*(i-1),0,2};
		CC.Shop_S["物品数量" .. i]={12+2*(i-1),0,2};
		CC.Shop_S["物品价格" .. i]={24+2*(i-1),0,2};
	end

	CC.ShopScene={};       --小宝商店场景数据，sceneid 场景id，d_shop 小宝位置D*, d_leave 小宝离开D*，一般在场景出口，路过触发
	CC.ShopScene[0]={sceneid=1,d_shop=16,d_leave={17,18}, };
	CC.ShopScene[1]={sceneid=3,d_shop=14,d_leave={15,16}, };
	CC.ShopScene[2]={sceneid=40,d_shop=20,d_leave={21,22}, };
	CC.ShopScene[3]={sceneid=60,d_shop=16,d_leave={17,18}, };
	CC.ShopScene[4]={sceneid=61,d_shop=9,d_leave={10,11,12}, };
	CC.ShopScene[5]={sceneid=197,d_shop=14,d_leave={57,59}, };


	--其他常量
	CC.MWidth=480;       --主地图宽
	CC.MHeight=480;      --主地图高

	CC.SWidth=64;     --子场景地图大小
	CC.SHeight=64;

	CC.DNum=200;       --D*每个场景的事件数

	CC.XScale=CONFIG.XScale;    --贴图一半的宽高
	CC.YScale=CONFIG.YScale;    


	CC.Frame=CONFIG.FrameRate;     --每帧毫秒数
	CC.BattleDelay=CONFIG.BattleDelay;     --战斗点数显示的延迟（毫秒）
	CC.Bj = CONFIG.Bj;
	CC.SceneMoveFrame=100;           --场景移动帧速，用于场景移动事件
	CC.PersonMoveFrame=100;          --主角移动速度，用于主角移动事件
	CC.AnimationFrame=150;           --动画显示帧速，用于显示动画事件

	CC.WarAutoDelay=300;                   --自动战斗时显示头像的延时

	CC.DirectX={0,1,-1,0};  --不同方向x，y的加减值，用于走路改变坐标值
	CC.DirectY={-1,0,0,1};

	CC.MyStartPicM=2501;      --男主角走路起始贴图
	CC.MyStartPicF=5001;      --女主角走路起始贴图
	CC.BoatStartPic=3715;    --船起始贴图

	CC.Level=30;                  ---人物等级和每等级经验
	CC.Exp={   50,    150,     300 ,500   , 750 ,
               1050,  1400,   1800 ,2250  , 2750 ,
               3850,  5050,   6350 ,7750  , 9250 ,
               10850, 12550, 14350 ,16750 , 18250 ,
               21400, 24700, 28150 ,31750 , 35500 ,
	           39400, 43450, 47650 ,52000 , 60000 , [0] = 0 };

    CC.MMapBoat={};    --主地图船可以进入的贴图
	local tmpBoat={ {0x166,0x16a},{0x176,0x17c},{0x1ca,0x1d0},{0x1fa,0x262},{0x3f8,0x3fe},};
    for i,v in ipairs(tmpBoat) do      --把这些数据变换成数组，其中有值就是可以进入
        for j=v[1],v[2],2 do
            CC.MMapBoat[j]=1;
        end
    end
	--Alungky 解决船开到深海区时，显示为人的问题
	local tmpForbid={{0x264,0x29E}}
    for i,v in ipairs(tmpForbid) do    
        for j=v[1],v[2],2 do
			CC.MMapBoat[j]=1;
        end
    end

    CC.SceneWater={};    --场景人不能进入的贴图
    local tmpWater={ {0x166,0x16a},{0x176,0x17c},{0x1ca,0x1d0},{0x1fa,0x262},{0x332,0x338},
                     {0x346,0x346},{0x3a6,0x3a8},{0x3f8,0x3fe},{0x52c,0x544},};
    for i,v in ipairs(tmpWater) do      --把这些数据变换成数组，其中空项就是可以进入的贴图
        for j=v[1],v[2],2 do
            CC.SceneWater[j]=1;
        end
    end

    CC.WarWater={};    --战斗地图人不能进入的贴图
    local tmpWater={ {0x166,0x16a},{0x176,0x17c},{0x1ca,0x1d0},{0x1fa,0x262},{0x332,0x338},
                     {0x346,0x346},{0x3a6,0x3a8},{0x3f8,0x3fe},{0x52c,0x544},};
    for i,v in ipairs(tmpWater) do      --把这些数据变换成数组，其中空项就是可以进入的贴图
        for j=v[1],v[2],2 do
            CC.WarWater[j]=1;
        end
    end

--武功招式
CC.KFMove={}
--圣火神功
CC.KFMove[93]={
	{'石火电光',900,1},
	{'火中取栗',950,1},
	{'明火执仗',1000,1},
	{'引火烧身',1100,1},
	{'烽火连天',1100,1},
	{'刀山火海',1100,1},
	}
--六脉神剑
CC.KFMove[49]={
	{'少商剑',1600,1,"效果：无"},
	{'商阳剑',1600,1,"效果：无"},
	{'中冲剑',1600,1,"效果：剑逆天光--无视敌方气防 且必破防50%。"},
	{'关冲剑',1600,1,"效果：剑煌镜影--增加一次连击 附带灼烧效果。"},
	{'少冲剑',1600,1,"效果：南柯万剑--必暴击,且暴击攻击加成提升至200％。"},
	{'少泽剑',1600,1,"效果：皇玺剑印--对目标造成随机造成眩晕/虚弱/定身。"}
	}
--降龙十八掌
CC.KFMove[26]={
	{'亢龙有悔',1500,1},
	{'见龙在田',1500,1},
	{'飞龙在天',1500,1},
	{'双龙出水',1500,1},
	{'神龙摆尾',1500,1},
	{'潜龙勿用',1500,1},
	{'时乘六龙',1500,1},
	}
CC.KFMove[377]={
	{'五岳神劍·北',1000,1,"效果：觸發五岳神劍—北堂北水劍意"},
	{'五岳神劍·東',1000,1,"效果：觸發五岳神劍—東方東木劍意"},
	{'五岳神劍·南',1000,1,"效果：觸發五岳神劍—南宮南火劍意"},
	{'五岳神劍·中',1000,1,"效果：觸發五岳神劍—中央中土劍意"},
	{'五岳神劍·西',1000,1,"效果：觸發五岳神劍—西門西金劍意"}
}	
--白虹掌力4招
CC.KFMove[202]={
{'隐若白虹起',1200,1},
{'呼气兮成白虹',1200,1},
{'白虹为贯日',1200,1},
{'薄暮垂虹去',1200,1},
}
--寒袖拂穴4招
CC.KFMove[201]={
{'春寒乍暖',1200,1},
{'寒泉滞骨',1200,1},
{'独立寒秋',1200,1},
{'寒月笼纱',1200,1},
}
--岳家枪法4招
CC.KFMove[200]={
{'锁喉枪',1400,1},
{'一夫当关',1400,1},
{'枕戈待旦',1400,1},
{'烽火连城',1400,1},
}
--岳王散手4招
CC.KFMove[198]={
{'黑虎剪尾',1100,1},
{'上动不停',1100,1},
{'饱虎登山',1200,1},
{'黑虎剪',1200,1},
}
--无极玄功拳3招
CC.KFMove[197]={
{'冲天炮',1100,1},
{'铁牛耕地',1100,1},
{'仙鹤亮翅',1200,1},
}
--阳春白雪曲5招
CC.KFMove[185]={
{'宫',1200,1},
{'商',1300,1},
{'角',1400,1},
{'徵',1400,1},
{'羽',1400,1},
}
--井月八法
CC.KFMove[181]={
{'不攻',1300,1},
{'击奇',1300,1},
{'兵诈',1300,1},
{'棋弈',1300,1},
{'战定',1300,1},
{'用谋',1300,1},
{'速战',1300,1},
{'方圆',1400,1},
}
--碧海惊涛掌6招
CC.KFMove[179]={
{'长风破浪',1200,1,'增加200气攻'},
{'碧波汹涌',1300,1,'必灼烧冰封'},
{'惊涛骇浪',1400,1,'附加真伤实害100'},
{'白浪滔天',1400,1,'必暴击'},
{'波谲云诡',1400,1,'如果冰封>50，冻结10时序'},
{'碧海长空',1600,1,'大范围攻击，增加气攻2000点'}
}
--无极玄易功
CC.KFMove[183]={
{'卷一.诛仙',4500,1},
{'卷二.灭神',4500,1},
{'卷三.开天',4500,1}, 
{'卷四.创世',4500,1}, 
{'卷五.涅槃',4500,1},
}
--九阳神功3招
CC.KFMove[106]={
{'清风拂山冈',1500,1,'造成敌方“虚弱”状态60时序'},
{'明月照大江',1400,1,'造成敌方“散功”状态20时序'},
{'一口真气足',1500,1,'自身“长生”回复状态100时序'}
}
--擒龙手3招
CC.KFMove[187]={
{'羚羊挂角',1100,1},
{'倏然而至',1100,1},
{'徒手擒龙',1200,1}
}
--猿公剑法4招
CC.KFMove[188]={
{'剑气长空',1400,1},
{'剑灵寰宇',1400,1},
{'剑主天地',1400,1},
{'剑破苍穹',1400,1}
}
--般若掌法4招
CC.KFMove[189]={
{'童子拜佛',1400,1},
{'礼戒四参',1400,1},
{'一拍两散',1400,1},
{'大梵般若',1400,1}
}
--追魂夺命剑招式
CC.KFMove[192]={
{'孟婆灌汤',1300,1},
{'一剑封喉',1300,1},
{'神驼骏足',1300,1},
{'追魂夺命',1300,1}
}
--奔雷手3招
CC.KFMove[191]={
{'轰雷贯耳',1100,1},
{'雷鸣瓦釜',1100,1},
{'平地风雷',1100,1},
{'电闪雷鸣',1100,1}
}
--解牛刀法3招
CC.KFMove[193]={
{'族庖月更刀',1400,1},
{'良庖岁更刀',1400,1},
{'无厚入有间',1400,1},
{'游刃必有馀',1400,1}
}
--袈裟伏魔功8招
CC.KFMove[194]={
{'菩提上首',1400,1},
{'处众人天',1400,1},
{'龙披免难',1400,1},
{'国王敬信',1400,1},
{'众生礼拜',1400,1},
{'罗刹恭敬',1400,1},
{'天龙护佑',1400,1},
{'得成佛道',1400,1}
}

--五毒神掌1招
CC.KFMove[3]={
{'五毒摧心',700,1},
{'五毒俱全',700,1},
{'五毒不丈夫',700,1}
}
--鹰爪功2招
CC.KFMove[4]={
{'锁喉',700,1},
{'探目',700,1},
{'撩阴',700,1}
}
--寒冰绵掌1招
CC.KFMove[5]={
{'寒冰封体',700,1},
{'冰雪严寒',700,1},
{'冰厚三尺',700,1},
{'冰销蚀骨',700,1},
}
--美女拳法3招
CC.KFMove[6]={
{'红玉击鼓',700,1},
{'文姬归汉',700,1},
{'木兰弯弓',700,1}
}
--绵掌1招
CC.KFMove[7]={
{'连绵不绝',700,1},
{'连绵不断',700,1},
{'连绵不休',700,1},
}
--天山六阳掌3招
CC.KFMove[8]={
{'阳歌天钧',900,1},
{'阳春白雪',900,1},
{'阳关三叠',900,1}
}
--白驼雪山掌1招
CC.KFMove[9]={
{'雪山白驼',800,1},
{'飞鸿踏雪',800,1},
{'雪上加霜',800,1},
}
--百花错拳2招
CC.KFMove[10]={
{'红花天梦',800,1},
{'天池缭乱',800,1},
{'走马观花',800,1},
}
--九阴白骨爪1招
CC.KFMove[11]={
{'探微索隐',1100,1},
{'犹鬼神幽',1100,1},
{'六阴已极',1100,1},
{'冥华幻灭',1100,1}
}
--落英神剑掌3招
CC.KFMove[12]={
{'珞樱缤纷',900,1},
{'雨急风狂',900,1},
{'江城飞花',900,1}
}
--铁掌1招
CC.KFMove[13]={
{'壁立千仞',900,1},
{'斩钉截铁',900,1},
{'铁掌莲花',900,1},
}
--天山折梅手2招
CC.KFMove[14]={
{'踏雪折梅',1200,1},
{'望梅止渴',1200,1},
{'别有洞天',1300,1},
{'天山灵鹫',1300,1},
{'平淡无奇',1400,1},
}
--空明拳3招
CC.KFMove[15]={
{'深藏若虚',1200,2},
{'天马行空',1200,2},
{'空穴来风',1200,2},
{'空空如也',1200,3},
}
--太极拳3招
CC.KFMove[16]={
{'野马分鬃',1000,1},
{'提步探马',1000,1},
{'双峰贯耳',1000,1},
{'揽雀尾',1000,1},
{'白鹤晾翅',1000,1},
}
--一阳指3招
CC.KFMove[17]={
{'颐指气使',1200,1},
{'梵指南天',1200,1},
{'指矢天日',1200,1},
{'紫微伏龙',1200,1},
}
--弹指神通2招
CC.KFMove[18]={
{'弹指一瞬',1200,1},
{'踏月香华',1200,1},
{'弹冠相庆',1200,1},
{'日月如梭',1200,1},
}
--幻阴指1招
CC.KFMove[19]={
{'魔幻天阴',1000,1},
{'梦幻泡影',1000,1},
{'诪张为幻',1000,1},
{'冥狱幻影',1000,1},
}
--龙爪手1招
CC.KFMove[20]={
{'捉影式',1000,1},
{'捕风式',1000,1},
{'鼓瑟式',1000,1}
}
--玄冥神掌2招
CC.KFMove[21]={
{'玄冥侵体',1200,1},
{'天地幽冥',1200,1},
{'天梦冥蒙',1200,1},
{'冰毒缭绕',1200,1}
}
--大金刚掌3招
CC.KFMove[22]={
{'大梵炼狱',1000,1},
{'九仪崩乱',1000,1},
{'地火燃穹',1000,1}
}
--七伤拳2招
CC.KFMove[23]={
{'五行阴阳',1000,1},
{'损心催肝',1000,1},
{'藏离精失',1000,1},
{'三焦齐逆',1000,1},
{'意恍惚诀',1000,1},
}
--须弥山神掌3招
CC.KFMove[24]={
{'色空四显',1400,1},
{'无色无相',1400,1},
{'慑伏外道',1400,1},
{'众佛参禅',1400,1},
{'莲花佛相',1400,1},
{'须弥芥子',1400,1},
}
--黯然销魂掌6招
CC.KFMove[25]={
{'拖泥带水',1300,1},
{'倒行逆施',1300,1},
{'行尸走肉',1300,1},
{'魂不守舍',1300,1},
{'心惊肉跳',1300,1},
{'六神不安',1300,1}
}
--松风剑法3招
CC.KFMove[27]={
{'平沙落雁',300,1},
{'鸿飞冥冥',300,1},
{'碧渊腾蛟',300,1}
}
--雷震剑术2招
CC.KFMove[28]={
{'轰雷掣电',300,1},
{'雷霆万钧',300,1}
}
--三分剑术3招
CC.KFMove[29]={
{'冰河倒泻',400,1},
{'雪中奇莲',400,1},
{'千岩竞秀',400,1}
}
--恒山剑法3招
CC.KFMove[30]={
{'万花齐放',500,1},
{'万卉争艳',500,1},
{'清澈梅花',500,1}
}
--泰山剑法3招
CC.KFMove[31]={
{'五大夫剑',500,1},
{'岱宗如何',500,1},
{'七星落长空',500,1}
}
--衡山剑法3招
CC.KFMove[32]={
{'泉鸣芙蓉',600,1},
{'鹤翔紫盖',600,1},
{'天柱云气',600,1}
}
--嵩山剑法3招
CC.KFMove[33]={
{'叠翠浮青',600,1},
{'玉进天池',600,1},
{'天外玉龙',600,1}
}
--华山剑法3招
CC.KFMove[34]={
{'苍松迎客',600,1},
{'金雁横空',600,1},
{'天坤倒悬',600,1}
}
--雪山剑法3招
CC.KFMove[35]={
{'雪泥鸿爪',600,1},
{'梅雪争春',600,1},
{'雪山六出',600,1}
}
--柔云剑法3招
CC.KFMove[36]={
{'杏花春雨',700,1},
{'满天花雨',700,1},
{'玉带围腰',700,1}
}
--两仪剑法2招
CC.KFMove[37]={
{'金针渡劫',800,1},
{'峭壁断云',800,1},
{'仪静体闲',800,1},
}
--玉萧剑法5招
CC.KFMove[38]={
{'山外清音',800,1},
{'金声玉振',800,1},
{'凤曲长鸣',800,1},
{'响隔楼台',800,1},
{'棹歌中流',800,1}
}
--全真剑法
CC.KFMove[39]={
	{'素月分辉',600,1},
	{'疏星淡月',700,1},
	{'星河欲转',800,1},
	{'月皓凝霜',800,1},
	{'星河鹭起',800,1},
	{'月满西楼',800,1},
	{'明河共影',800,1}
}

--金蛇剑法5招
CC.KFMove[40]={
{'金光蛇影',900,1},
{'蛇影万馈',900,1},
{'金蛇化龙',900,1},
{'灵蛇电闪',900,1},
{'蛇困愁城',900,1}
}
--倚天剑法3招
CC.KFMove[41]={
{'玉碎昙香',1000,1},
{'天劫俱灭',1000,1}, 
{'倚天照海',1000,1}
}
--斩流剑术招
CC.KFMove[151]={
{'一念无量',1400,1},
{'现世执妄',1400,1}, 
{'悟入幻想',1400,1},
{'草木成佛',1400,1}, 
{'天人五衰',1400,1},
{'六根清净',1400,1}, 
{'众生无情',1400,1},
{'生死有命',1400,1}, 
{'半身大悟',1400,1}
}

--斗转星移2招
CC.KFMove[43]={
{'星落云散',1200,1},
{'星光日月',1200,1}
}
--苗家剑法6招
CC.KFMove[44]={
{'冲天掌苏秦背剑',1000,1},
{'黄龙转身吐须势',1000,1},
{'迎门腿反劈华山',1000,1},
{'洗剑怀中抱月',1000,1},
{'上步云边摘月',1000,1},
{'提撩剑白鹤舒翅',1000,1}
}
--玄铁剑法4招
CC.KFMove[45]={
{'逆击',1500,1},
{'倒劈',1500,1},
{'顺刺',1500,1},
{'横削',1500,1}
}
--太极剑法3招
CC.KFMove[46]={
{'仙人指路',1300,1},
{'青龙出水',1300,1},
{'三环套月',1300,1}
}
--独孤九剑9招
CC.KFMove[47]={
{'总决式',1600,1},
{'破剑式',1600,1},
{'破枪式',1600,1},
{'破刀式',1600,1},
{'破鞭式',1600,1},
{'破索式',1600,1},
{'破掌式',1600,1},
{'破箭式',1600,1},
{'破气式',1600,1}
}
--辟邪剑法6招
CC.KFMove[48]={
{'指打奸邪',800,1,"效果：无"},
{'飞燕穿柳',1000,1,"效果：伤害+100，CD1回合，主运葵花必连击无CD"},
{'花开见佛',1300,1,"效果：命中目标虚弱状态50时序"}, 
{'锺馗抉目',1300,1,"效果：必刺目，目标100%概率MISS"}, 
{'扫荡群魔',1400,1,"效果：大范围面攻，如果有流血，则时序损失目标0.5%生命值"},
{'紫气东来',1300,1,"效果：连击3~4次，下回合不可攻击。如果有击杀，则无负面影响"},
}

--玉女剑法
CC.KFMove[42]={
	{'清饮小酌',800,1},
	{'举案齐眉',800,1},
	{'冷月窥人',800,1},
	{'浪迹天涯',800,1}
	}
--柴刀十八路2招
CC.KFMove[50]={
{'砍',500,1},
{'劈',500,1}
}
--鬼头刀法1招
CC.KFMove[52]={
{'鬼见愁',600,1},
{'鬼见忧',600,1},
{'鬼见糗',600,1},
}
--南山刀法2招
CC.KFMove[53]={
{'铁锁横江',600,1},
{'燕子入巢',600,1}
}
--鸳鸯刀法2招
CC.KFMove[54]={
{'云蕾花开',700,1},
{'玲珑偃月',800,1},
{'只羡鸳鸯',800,1},
}
--狂风刀法2招
CC.KFMove[55]={
{'狂风大作',700,1},
{'飞沙走石',700,1}
}
--奇门三才刀2招
CC.KFMove[56]={
{'带醉脱靴',700,1},
{'奇刀单鞭式',700,1}
}
--慈悲刀法2招
CC.KFMove[57]={
{'放下屠刀',600,1},
{'立地成佛',600,1}
}
--修罗刀1招
CC.KFMove[58]={
{'恨意绵绵',600,1},
{'饮恨而终',600,1},
{'含恨九泉',600,1},
}
--五虎断门刀2招
CC.KFMove[59]={
{'白虎跳涧',600,1},
{'剪扑自如',600,1}
}
--反两仪刀法2招
CC.KFMove[60]={
{'辗转反复',900,1},
{'两小无猜',900,1},
{'万劫不复',900,1},
{'两仪转承',900,1},
}
--金乌刀法2招
CC.KFMove[61]={
{'梅雪逢夏',700,1},
{'赤日炎炎',700,1},
{'锄禾当午',700,1},
}
--夫妻刀法4招
CC.KFMove[62]={
{'女貌郎才珠万斛',1200,1},
{'天教丽质为眷属',1200,1}, 
{'清风引佩下瑶台',1200,1}, 
{'明月照妆成金屋',1200,1}
}
--血刀大法3招
CC.KFMove[63]={
{'呕心沥血',800,1},
{'批纸削腐',800,1},
{'流星经天',800,1}
}
--玄虚刀法2招
CC.KFMove[64]={
{'莫测高深',900,1},
{'故弄玄虚',900,1},
{'神而明之',900,1},
{'玄天虚若',900,1},
}
--燃木刀法2招
CC.KFMove[65]={
{'钻木取火',900,1},
{'无名孽火',900,1},
{'飞蛾扑火',900,1},
{'无明业火',900,1},
}
--火焰刀法2招
CC.KFMove[66]={
{'炽炎破军',1200,1},
{'昊火焚天',1200,1},
{'五内如焚',1200,1},
{'烟焱张天',1200,1},
{'炉火纯青',1200,1},
{'星火燎原',1200,1},
}
--胡家刀法2招
CC.KFMove[67]={
{'参拜北斗式',1200,1},
{'沙鸥掠波式',1200,1},
{'闭门铁扇刀',1200,1},
{'缠身摘心刀',1200,1},
{'拜佛听经式',1200,1},
{'八方藏刀式',1200,1},
}
--杨家枪法3招
CC.KFMove[68]={
{'回马枪',500,1},
{'春雷震怒',500,1},
{'凤点头',500,1}
}
--中平枪法2招
CC.KFMove[70]={
{'中正锁喉',600,1},
{'枪平九洲',600,1}
}
--裴将军帖2招
CC.KFMove[71]={
{'大君制六合',700,1},
{'猛将清九垓',700,1},
{'战马若龙虎',700,1},
}
--棋盘招式8招
CC.KFMove[72]={
{'紧气',800,1},
{'提子',800,1},
{'大飞',800,1},
{'小飞',800,1},
{'天元',800,1},
{'跳',800,1},
{'立',800,1},
{'长',800,1}
}
--鹤蛇八打2招
CC.KFMove[74]={
{'冲天一鹤',700,1},
{'仙鹤穿云',700,1}
}
--大剪刀2招
CC.KFMove[75]={
{'咔嚓',800,1},
{'我剪',800,1}
}
--阴阳倒乱刃2招
CC.KFMove[77]={
{"假刀非刀",1000,1},
{"假剑非剑",1000,1},
{"白马非马",1000,1},
{"坤悬倒刺",1000,1},
}
--黄沙万里鞭2招
CC.KFMove[78]={
{"血染黄沙",800,1},
{"飞沙万里",800,1}
}
--银索金铃2招
CC.KFMove[79]={
{"水银泻地",1100,1},
{"金枝玉叶",1100,1},
{"银索缠身",1100,1},
{"锁穴金铃",1100,1},
}
--打狗棒法4招
CC.KFMove[80]={
{'棒打狗头',1400,1},
{'反截狗臀',1400,1},
{'獒口夺杖',1400,1},
{'棒打双犬',1400,1},
{'恶狗拦路',1400,1},
{'天下无狗',1400,1},
}
--灵蛇杖法2招
CC.KFMove[81]={
{'怪蟒翻身',1400,1},
{'毒蛇吐信',1400,1},
{'蛇己旧人',1400,1},
{'打草惊蛇',1400,1},
{'蛇蝎心肠',1400,1},
{'灵蛇之珠',1400,1},
}
--金刚伏魔圈4招
CC.KFMove[82]={
{'祗园精舍',1400,1},
{'诸行无常',1400,1},
{'娑罗双树',1400,1}, 
{'幻梦一场',1400,1},
{'佛陀割肉',1400,1},
{'金刚伏魔',1400,1},
}
--无上大力杵3招
CC.KFMove[83]={
{'力战千钧',1200,1},
{'拔山填海',1200,1},
{'千钧压顶',1200,1},
{'推象伏虎',1200,1},
}
--倚天屠龙功6招
CC.KFMove[84]={
{'武林至尊',1100,1},
{'宝刀屠龙',1100,1},
{'号令天下',1100,1},
{'莫敢不从',1100,1},
{'倚天不出',1100,1},
{'谁与争锋',1100,1}
}
--伏魔杖法2招
CC.KFMove[86]={
{'天魔降伏',1400,1},
{'佛怒唐莲',1400,1},
{'祸福倚伏',1400,1},
{'摩诃无量',1400,1},
{'佛高一尺',1400,1},
{'佛魔摄道',1400,1},
}
--太玄神功5招
CC.KFMove[102]={
{'赵客缦胡缨',1200,1},
{'银鞍照白马',1200,1},
{'三杯吐然诺',1200,1},
{'纵死侠骨香',1200,1},
{'白首太玄经',1200,1}
}	
--野球拳3招
CC.KFMove[109]={
{'石头',1200,1},
{'剪子',1200,1},
{'布',1200,1}
}
--神山剑法3招
CC.KFMove[110]={
{'神洲移山剑',1200,1},
{'神洲镇山剑',1200,1},
{'神洲擎山剑',1200,1}
}
--西瓜刀法3招
CC.KFMove[111]={
{'切瓜',1200,1},
{'剁瓜',1200,1},
{'砍瓜',1200,1}
}
--犽月流空2招
CC.KFMove[112]={
{'月犽流',1200,1},
{'月骁流',1200,1}
}
--连城剑法4招
CC.KFMove[114]={
{'故人西辞黄鹤楼',900,1},
{'烟花三月下扬州',900,1},
{'孤帆远影碧空尽',900,1},
{'唯见长江天际流',900,1}
}
--三花聚顶掌1招
CC.KFMove[115]={
{'炼精化气',700,1},
{'炼气化神',700,1},
{'炼神还虚',700,1},
}
--化骨绵掌1招
CC.KFMove[118]={
{'积毁销骨',1000,1},
{'挫骨扬灰',1000,1},
{'敲骨吸髓',1000,1},
{'百鬼恸哭',1000,1},
}
--冰蚕毒掌1招
CC.KFMove[120]={
{'冰消瓦解',1100,1},
{'鲸吞蚕食',1100,1},
{'如履薄冰',1100,1},
{'冰毒缭绕',1100,1},
}
--凝血神爪2招
CC.KFMove[134]={
{'风驰电掣',1000,1},
{'阴凝坚冰',1000,1},
{'黄石纳履',1000,1},
{'逆挽天华',1000,1},
}
--大力金刚指2招
CC.KFMove[135]={
{'金刚揭谛',1400,1},
{'正骨松筋',1400,1},
{'金刚菩提',1400,1},
{'铁指拔钉',1400,1},
{'金刚震脉',1400,1},
{'金刚般若',1400,1},
}
--无相劫指2招
CC.KFMove[136]={
{'天保九如',1300,1},
{'天马行空',1300,1},
{'天地玄黄',1300,1},
{'千劫不动',1300,1},
{'金刚无相',1300,1},
{'天火焚城',1500,1},
}
--参合指6招
CC.KFMove[138]={
{'国破山河在，城春草木深',1500,1},
{'感时花溅泪，恨别鸟惊心',1500,1},
{'锋火连三月，兵败参合陂',1500,1},
{'白头搔更短，浑欲不胜簪',1500,1},
{'夜来参星斗，天命何所归',1500,1},
{'顾盼子孙贤，铭记复国志',1500,1}
}
--玉女素心剑6招
CC.KFMove[139]={
{'清饮小酌',1100,1},
{'浪迹天涯',1100,1},
{'举案齐眉',1100,1},
{'皓腕玉镯',1100,1},
{'冷月窥人',1100,1},
{'竹帘临池',1100,1}
}
--达摩剑法1招
CC.KFMove[140]={
{'万事随缘往',1000,1},
{'来去若梦行',1000,1},
{'浮世沧桑远',1000,1},
{'轮回法舟轻',1000,1},
}
--百胜刀法2招
CC.KFMove[141]={
{'却月天戈',1000,1},
{'孤月寒江',1000,1},
{'寒光百刃',1000,1},
{'百战百胜',1000,1},
}
--妙笔丹青1招
CC.KFMove[142]={
{'妙笔生花',1200,1},
{'神笔马良',1200,1},
{'神封太渊',1200,1},
{'铁血丹心',1200,1},
}
--沧溟刀法2招
CC.KFMove[153]={
{'素月分辉',1200,1},
{'银河共影',1200,1},
{'沧海遗珠',1200,1},
{'陵谷沧桑',1200,1},
{'溟思苦想',1200,1},
{'溟顽不灵',1200,1},
}
--越女剑法4招
CC.KFMove[156]={
{'电照长空',1500,1},
{'仙猿剑舞',1500,1},
{'诛天凌神',1500,1},
{'天仙剑影',1500,1}
}
--枣核钉1招
CC.KFMove[157]={
{'囫囵吞枣',1000,1},
{'付之梨枣',1000,1},
{'透骨腐肉',1000,1},
{'瞬狱一杀',1000,1},
}
--五轮大转2招
CC.KFMove[158]={
{'天高云淡',1300,1},
{'天灾人祸',1300,1},
{'天魔降伏',1300,1},
{'天移日易',1300,1},
{'天罡震烈',1300,1},
{'天舞宝轮',1300,1},
}
--苍狼战戟2招
CC.KFMove[159]={
{'苍髯如戟',2000,1},
{'染苍染黄',2000,1},
{'鬼哭狼嚎',2000,1},
{'狼烟四起',2000,1},
{'魔澜惊炽',2000,1},
{'罗摩沌灭',2000,1},
}
--玄女剑法1招
CC.KFMove[161]={
{'碧落穹苍',1200,1},
{'飞花逐蝶',1200,1},
{'月下花前',1200,1},
{'玄裳缟衣',1200,1},
}
--狂风快剑2招
CC.KFMove[162]={
{'一叶扁舟',1300,1},
{'天外飞龙',1300,1},
{'风驰云卷',1300,1},
{'长风破浪',1300,1},
{'疾风骤雨',1300,1},
{'狂风怒号',1300,1}
}
--白蟒鞭法1招
CC.KFMove[164]={
{'残烛引月',1200,1},
{'杯弓蛇影',1200,1},
{'白璧微瑕',1200,1},
{'晦蟒否塞',1200,1},
}
--青莲剑法10招
CC.KFMove[167]={
{'长风万里送秋雁',1200,1},
{'对此可以酣高楼',1200,1},
{'蓬莱文章建安骨',1200,1},
{'中间小谢又清发',1200,1},
{'俱怀逸兴壮思飞',1200,1},
{'欲上青天览明月',1200,1},
{'抽刀断水水更流',1200,1},
{'举杯消愁愁更愁',1200,1},
{'人生在世不称意',1200,1},
{'明朝散发弄扁舟',1200,1}
}
--逍遥神剑2招
CC.KFMove[168]={
{'既不回头',1600,1},
{'何必不忘',1600,1},
{'既然无缘',1600,1},
{'何需誓言',1600,1},
{'今日种种',1600,1},
{'似水无痕',1600,1},
{'明夕何夕',1600,1},
{'君已陌路',1600,1},
}

--达摩神掌4招
CC.KFMove[173]={
{'亿万小时',3000,1},
{'精心打磨',3000,1},
{'国产绿色',3000,1},
{'休闲单机',3000,1}
}

--阴风刀2招
CC.KFMove[174]={
{'鬼魅魍魉',1200,1},
{'尸鬼封尽',1200,1},
{'阴风阵阵',1200,1},
{'利刃寒锋',1200,1},
}

--烈火剑法1招
CC.KFMove[176]={
{'天灰地烬',2000,1},
{'余烬复燃',2000,1},
{'薪烬火传',2000,1},
}
--追魂压命剑法3招
CC.KFMove[183]={
{'剑一.封喉',2000,1},
{'剑二.追魂',2000,1},
{'剑三.夺命',2000,1}
}

--天道剑势
CC.KFMove[222]={
{'三环套月',1500,1},
{'无我无剑',1500,1},
{'天地无极',1500,1},
{'八荒归元',1500,1},
}

--葵花点穴手
CC.KFMove[226]={
{'势如疾风',1200,1},
{'快如闪电',1200,1},
{'葵藿倾阳',1200,1},
{'拔葵去织',1200,1},
{'葵花向日',1200,1},
}

--五行六合掌
CC.KFMove[234]={
{'利金',1000,1},
{'清水',1000,1},
{'玄木',1000,1},
{'烈火',1000,1},
{'厚土',1000,1},
}
	
--绕指柔剑
CC.KFMove[245]={
{'鱼跃龙门',600,1},
{'白猿献果',600,1},
{'柔月穿空',600,1},
{'轻柔曲折',600,1},
}

--临济十二庄
CC.KFMove[247]={
{'碧波里',1000,1},
{'瑶天地',1000,1},
{'水翠凝',1000,1},
}
--碧海潮生功
CC.KFMove[248]={
{'南岳支天',1200,1},
{'流云落雪',1200,1},
}
--金关玉锁诀
CC.KFMove[249]={
{'一剑落九雁',1200,1},
{'回风破长空',1200,1},
{'神风划天翔',1200,1},
}
--冰火阴阳诀
CC.KFMove[250]={
{'一阴一阳',1200,1},
{'交融汇通',1200,1},
{'阳升阴降，阴阳交汇',1200,1},
}
--奇门遁甲
CC.KFMove[251]={
{'奇门遁甲',1200,1},
}
--无妄神咒
CC.KFMove[252]={
{'天雷无妄',700,1},
{'无妄而得',700,1},
}
--神跌鬼倒
CC.KFMove[253]={
{'右手揪后颈',900,1},
{'左手抓胸口',900,1},
{'左脚一拌',800,1},
}
--伏魔剑法
CC.KFMove[254]={
{'韦陀宝杵',600,1},
{'霞光神兽',600,1},
}
--天长掌法
CC.KFMove[255]={
{'敬捧宝经',500,1},
{'天长地久',500,1},
}
--春蚕掌法
CC.KFMove[256]={
{'春蚕到死丝方尽',900,1},
{'蜡炬成灰泪始干',900,1},
{'相见时难别亦难',800,1},
{'东风无力百花残',800,1},
}
--降魔掌
CC.KFMove[257]={
{'因果报应',700,1},
{'业缘自作',700,1},
{'善恶由心',700,1},
}
--静心守剑
CC.KFMove[258]={
{'静以不动制万动',800,1},
{'静心则清体则凉',800,1},
{'静全由心生',700,1},
}
--古针禅功
CC.KFMove[259]={
{'古针渡劫',800,1},
}
--五大夫剑
CC.KFMove[260]={
{'苍翠相掩',600,1},
{'虬枝斜出',600,1},
{'五大夫松',600,1},
}
--七星落长空
CC.KFMove[261]={
{'来鹤清泉',800,1},
{'石关回马',800,1},
{'长空星落',800,1},
}
--磐罡掌
CC.KFMove[262]={
{'造化神秀',800,1},
{'一览众山',800,1},
{'会当绝顶',800,1},
{'齐鲁青未',800,1},
}
--开山掌
CC.KFMove[263]={
{'愚公移山',500,1},
{'泰山压顶',500,1},
}
--磐石法诀
CC.KFMove[264]={
{'不动明王',700,1},
}
--参合剑气
CC.KFMove[265]={
{'北斗移辰',1500,1},
{'参商永合',1500,1},
{'陨石星浪',1500,1},
{'天幻星辰',1500,1},
{'日月星光',1500,1},
{'乾坤星阵',1500,1},
}
--北斗剑法
CC.KFMove[266]={
{'天枢',700,1},
{'天璇',700,1},
{'天玑',700,1},
{'天权',700,1},
{'玉衡',700,1},
{'开阳',700,1},
{'瑶光',700,1},
}

--降魔刀法
CC.KFMove[267]={
{'戒杀',800,1},
{'破邪',800,1},
{'去妄',800,1},
{'除嗔',800,1},
}
--回风拂柳刀
CC.KFMove[268]={
{'回风剑拂柳',500,1},
{'狂风剑破空',500,1},
{'神风剑卷地',500,1},
}
--八卦游龙掌
CC.KFMove[269]={
{'猛虎伏桩',800,1},
{'游空探爪',800,1},
{'龙盘八卦',800,1},
}
--金刚伏虎刀
CC.KFMove[270]={
{'虎踞龙蟠',700,1},
{'游龙出水',700,1},
{'云起龙骧',700,1},
}
--周公剑法
CC.KFMove[271]={
{'天如穹庐',900,1},
{'白雾茫茫',900,1},
{'斜风细雨',1000,1},
{'暮短夜长',800,1},
}
--大嵩阳掌
CC.KFMove[272]={
{'破山斧',500,1},
{'千掌环',500,1},
{'无影掌',500,1},
{'千斤坠',500,1},
}
--寒冰神掌
CC.KFMove[273]={
{'冰封千里',800,1},
{'天寒地冻',800,1},
{'连绵冰山',800,1},
}
--快慢十八路
CC.KFMove[274]={
{'快剑式',400,1},
{'慢剑式',400,1},
{'拖剑式',400,1},
{'突剑式',400,1},
}
--子午十二剑
CC.KFMove[275]={
{'开门见嵩',900,1},
{'千古人龙',900,1},
{'游剑子午',900,1},
}
--迅雷剑法
CC.KFMove[276]={
{'一字狂雷',900,1},
{'风雷雨急',900,1},
{'心雷万丈',900,1},
}
--雨打飞花剑
CC.KFMove[277]={
{'泛舟听雨',400,1},
{'落雨散花',400,1},
{'乱花覆剑',400,1},
}
--三阴手
CC.KFMove[278]={
{'手三阴',400,1},
{'足三阴',400,1},
{'体三阴',400,1},
}
--落雁掌
CC.KFMove[279]={
{'雁纵如烟',400,1},
{'雁影若墨',400,1},
{'雁翼似刀',400,1},
}
--红砂掌
CC.KFMove[280]={
{'朱笔红砂',600,1},
{'处子红砂',600,1},
{'铸铁红砂',600,1},
}
--同归剑法
CC.KFMove[283]={
{'同归于尽',800,1},
{'生死两茫',800,1},
}
--一气化三清
CC.KFMove[284]={
{'元始',1000,1},
{'灵宝',1000,1},
{'太上',1000,1},
}
--履霜破冰拳
CC.KFMove[285]={
{'可以履霜',1000,1},
{'履霜坚冰',1000,1},
{'履霜行于野',1000,1},
}
--昊天掌
CC.KFMove[286]={
{'肇化荒宇',400,1},
{'阴阳相克',400,1},
{'玄德乾坤',400,1},
{'皇极生玄',400,1},
}
--飘雪穿云掌
CC.KFMove[287]={
{'水拍云崖',400,1},
{'云海明灯',400,1},
{'罡风推云',400,1},
}
--金顶绵掌
CC.KFMove[288]={
{'金顶佛光',500,1},
{'逆流捧沙',500,1},
{'一拍金散',500,1},
}
--四象掌
CC.KFMove[289]={
{'仪生四象',1000,1},
{'象生八卦',1000,1},
}
--佛光普照
CC.KFMove[290]={
{'云开月明',700,1},
{'光芒普照',700,1},
{'佛光盛世',700,1},
}
--金顶九式
CC.KFMove[291]={
{'金三式',700,1},
{'顶三式',700,1},
{'后三式',700,1},
}
--截手九式
CC.KFMove[292]={
{'侧截三式',800,1},
{'反截三式',800,1},
{'正截三式',800,1},
}
--抽髓掌
CC.KFMove[294]={
{'抽骨髓',700,1},
{'抽脑髓',700,1},
{'抽血髓',700,1},
}
--连环腐尸毒
CC.KFMove[295]={
{'腐尸毒',1100,1},
{'炼心弹',1100,1},
{'碧焰滔天',1100,1},
}
--三无三不手
CC.KFMove[298]={
{'无孔不入',800,1},
{'无所不为',800,1},
{'无处不至',800,1},
}
--银拂尘功
CC.KFMove[299]={
{'拂尘扫天',700,1},
{'拂尘扫地',700,1},
{'拂尘扫人',700,1},
}
--宁式一剑
CC.KFMove[302]={
{'无双无对',700,1},
{'宁式一剑',700,1},
}
--玉女十九式
CC.KFMove[303]={
{'玉女穿针',700,1},
{'银光飞舞',700,1},
{'青山隐隐',700,1},
}
--夺命连环三仙剑
CC.KFMove[304]={
{'苍松迎客',1100,1},
{'有凤来仪',1100,1},
{'白虹贯日',1100,1},
}
--劈石破玉拳
CC.KFMove[305]={
	{'一叶扁舟',1000,1},
	{'天外飞龙',1000,1},
{'劈石破玉',1000,1},
}
--混元掌
CC.KFMove[306]={
{'引元归田',700,1},
{'灵元归天',800,1},
{'抱元归一',900,1},
{'元元融金',900,1},
}
--伏虎拳
CC.KFMove[307]={
{'倒扭金钟',600,1},
{'深入虎穴',600,1},
{'左伏右击',600,1},
}
--鹰蛇生死搏
CC.KFMove[308]={
{'鹰抓',900,1},
{'蛇缠',900,1},
{'鹰叼蛇咬',900,1},
}
--泼墨披麻剑法
CC.KFMove[309]={
{'点墨剑式',400,1},
{'泼墨剑式',400,1},
{'沾墨剑式',400,1},
{'游墨剑式',400,1},
}
--七玹无形剑
CC.KFMove[310]={
{'七玹无形音',900,1},
{'七玹黄龙闪',900,1},
{'七玹连环诛',900,1},
}
--丹青破穴
CC.KFMove[311]={
{'截脉点穴',600,1},
{'凌空打穴',600,1},
{'百击破穴',600,1},
}
--段家剑法
CC.KFMove[314]={
{'大理段氏',300,1},
{'思平皇室',300,1},
{'俭魏南诏',300,1},
}
--五罗轻烟掌
CC.KFMove[315]={
{'烟散',400,1},
{'烟起',400,1},
{'烟尽',400,1},
}
--碧海潮生曲
CC.KFMove[316]={
{'碧海无量',800,1},
{'滔滔不绝',800,1},
{'潮起潮落',800,1},
}
--劈空掌
CC.KFMove[318]={
{'醋手浸空',500,1},
{'歪斜不称',500,1},
{'疏疏落落',500,1},
}
--碧波掌
CC.KFMove[319]={
{'掌势如波',300,1},
{'重重递进',300,1},
}
--落英剑法
CC.KFMove[320]={
{'催银箭',500,1},
{'玉漏银壶',500,1},
{'铁关金锁',500,1},
}
--一字电剑
CC.KFMove[321]={
{'如电',300,1},
{'如雷',300,1},
{'如霹',300,1},
}
--十八连环破
CC.KFMove[322]={
{'青字九打',400,1},
{'城字九破',400,1},
{'打破连环',400,1},
}
--雷公轰
CC.KFMove[323]={
{'春雷乍动',700,1},
{'霹雷坠地',700,1},
{'地雷母纲',700,1},
}
--八仙剑法
CC.KFMove[326]={
{'铁拐李',600,1},
{'汉钟离',600,1},
{'张果老',600,1},
{'吕洞宾',600,1},
{'何仙姑',600,1},
{'蓝采和',600,1},
{'韩湘子',600,1},
{'曹国舅',600,1},
}
--天遁剑法
CC.KFMove[327]={
{'一剑相传',1000,1},
{'天地山河',1000,1},
{'六天成尘',1000,1},
{'星辰月遁',1000,1},
}
--摧心掌
CC.KFMove[328]={
{'心力交瘁',1000,1},
{'撕心裂肺',1000,1},
{'呕心沥血',1000,1},
}
--黑沙掌
CC.KFMove[329]={
{'黑沙式',300,1},
{'黑掌式',300,1},
{'毒沙式',300,1},
}
--三蜈五蟆烟
CC.KFMove[332]={
{'三蜈',500,1},
{'五蟆',500,1},
}
--千蛛万毒手
CC.KFMove[334]={
{'百毒侵',700,1},
{'千蛛劫',700,1},
{'万蛊流',700,1},
}
--天刀
CC.KFMove[335]={
{'上下未形，何由考之',1300,1},
{'阴阳三合，何本化无',1300,1},
{'地方九则，何以坟之',1300,1},
{'增城九重，其高几里',1300,1},
{'焉有蛅龙，负熊以游',1300,1},
{'一蛇吞象，厥大何如',1300,1},
{'天式纵横，阳离爰死',1300,1},
{'女娲有体，孰制匠之',1300,1},
{'天命反侧，何罚何佑',1400,1},
}
--上清快剑
CC.KFMove[336]={
{'无尘剑势',500,1},
{'无影剑势',500,1},
{'无意剑势',500,1},
{'无动剑势',500,1},
}
--劈卦刀法
CC.KFMove[337]={
{'大圣劈卦',400,1},
{'二郎举卦',400,1},
{'周公推卦',400,1},
}
--雁行刀
CC.KFMove[338]={
{'云中寄书',500,1},
{'片影相失',500,1},
{'木落南渡',500,1},
{'潇湘月明',500,1},
{'三千雁去',500,1},
}
--华岳三神峰
CC.KFMove[339]={
{'粉石碎玉',900,1},
{'混沌一破',900,1},
{'两拳一刀',900,1},
}
--大九天手
CC.KFMove[340]={
{'中天手',700,1},
{'从天手',700,1},
{'碎天手',700,1},
{'滅天手',700,1},
{'成天手',700,1},
}
--狂风迅雷扇
CC.KFMove[341]={
{'狂风急雷',700,1},
{'狂风疾速',700,1},
{'狂风迅雨',700,1},
}
--大伏魔拳
CC.KFMove[342]={
{'道高一尺',1200,1},
{'魔高一丈',1200,1},
{'群魔乱舞',1200,1},
{'伏魔卫道',1200,1},
}
--阴阳磨掌
CC.KFMove[343]={
{'泽地归元',1000,1},
{'坤仑断岳',1000,1},
{'阴阳磨',1000,1},
}
--飞凤手
CC.KFMove[344]={
{'龙飞凤舞',500,1},
{'凤凰槃涅',500,1},
{'凤舞九天',500,1},
}
--大慈大悲手
CC.KFMove[346]={
{'培元固本',800,1},
{'天王托塔',800,1},
{'四象合一',800,1},
}
--韦陀掌
CC.KFMove[347]={
{'灵山礼佛',300,1},
{'山门护法',300,1},
}
--大阴阳手
CC.KFMove[348]={
{'嵩阳',400,1},
{'嵩寒',400,1},
}
--屠龙刀法
CC.KFMove[349]={
{'神龙斩',1000,1},
{'反龙斩',1000,1},
{'屠龙斩',1000,1},
}
--阿难破戒刀
CC.KFMove[350]={
{'断清净',500,1},
{'落红尘',750,1},
{'积业力',1000,1},
{'引外魔',1250,1},
{'粘因果',1500,1},
}
--金龙鞭法
CC.KFMove[351]={
{'攻敌下盘',400,1},
{'马王神',400,1},
{'需用巧劲',400,1},
}
--碧针清掌
CC.KFMove[352]={
{'松针细叶',700,1},
{'鼓荡松针',700,1},
}
--乾元功
CC.KFMove[353]={
{'昆仑气沌',500,1},
}
--通幽诀
CC.KFMove[354]={
{'幽径通幽',500,1},
}
--抱元诀
CC.KFMove[355]={
{'抱元八仙',500,1},
}
--剑芒
CC.KFMove[356]={
{'剑芒出鞘',700,1},
}
--铁剑诀
CC.KFMove[196]={
{'铁剑风行',500,1},
}
--释迦掷象功
CC.KFMove[357]={
{'释迦掷象',700,1},
}

--天王刀法
CC.KFMove[358]={
{'天王老子',1000,1},
{'托塔天王',1000,1},
}
--蓝砂手
CC.KFMove[359]={
{'蓝鲨毒',600,1},
{'毒砂石',600,1},
}
	--笑傲江湖曲
CC.KFMove[360]={
{'活得精彩',800,1},
{'傲视在俗世上',800,1},
}
--混沌气诀
CC.KFMove[375]={
{'混沌一生',700,1},
}
--昆仑琴剑
CC.KFMove[376]={
{'琴音伤人',700,1},
{'琴剑合一',700,1},
}
--无声无色剑
--[[CC.KFMove[377]={
{'无声',400,1},
{'无色',400,1},
}]]

--离队人员列表: {人员id，离队调用函数}      ----如果有新的离队人员加入，直接在这里增加
CC.PersonExit = {
[1]=100,
[2]=102,
[4]=104,
[9]=106,
[16]=108,
[17]=110,
[25]=112,
[28]=114,
[29]=116,
[30]=118,
[35]=120,
[36]=122,
[37]=124,
[38]=126,
[44]=128,
[45]=130,
[47]=132,
[48]=134,
[49]=136,
[51]=138,
[52]=140,
[53]=142,
[54]=144,
[55]=146,
[56]=148,
[58]=150,
[59]=152,
[61]=4101,
[63]=154,
[66]=156,
[72]=158,
[73]=160,
[74]=162,
[75]=164,
[76]=166,
[77]=168,
[78]=170,
[79]=172,
[80]=174,
[81]=176,
[82]=178,
[83]=180,
[84]=182,
[85]=184,
[86]=186,
[87]=188,
[88]=190,
[89]=192,
[90]=194,
[91]=196,
[92]=198,
[104]=80011,
[105]=80012,
[539]=80013,
[581]=80014,  
[582]=80015,  
[151]=11004,
[154]=11002,
[161]=4183,
[457]=11008,
[523]=11012,
[530]=11009,
[566]=11006,
[569]=11003,
[574]=11005,
[580]=11010,
[589]=8005,  --水笙
[590]=8650,
[601]=4138,
[604]=11001,
[607]=4202,	--焦万尔
[609]=4250,	--赵敏
[626]=4184,	--郭襄
[629]=4200,	--阿九
[631]=4209,	--周芷若
[646]=4249,	--殷离
[738]=1298,
[763]=11015, 
[767]=10110,
[768]=10112,
[769]=10114,
[770]=10116,
[777]=10136,
}

    --所有可加入人员离队需要清除的D*事件，清除后这些人就找不到了。得到神杖时使用
    CC.AllPersonExit={ 
            {1, 5}, 
			{2, 6}, 
			{4, 21}, 
			{9, 17}, 
			{16, 31}, 
			{17, 32}, 
			{25, 28}, 
			{28, 29}, 
			{29, 26}, 
			{30, 13}, 
			{35, 15}, 
			{36, 139},--林平之 
			{37, {7,8}}, 
			{38, {16,58}}, 
			{44, 33}, 
			{45, 12}, 
			{47, 23}, 
			{48, 24}, 
			{49, {10,11}}, 
			{51, 22}, 
			{52, 41}, 
			{53, 9}, 
			{54, 18}, 
			{55, 13}, 
			{56, 14}, 
			{58, 19}, 
			{59, 20}, 
			{63, 30}, 
			{66, 38}, 
			{72, 40}, 
			{73, 35}, 
			{74, 36}, 
			{75, 37}, 
			{76, 27}, 
			{77, 39}, 
			{78, 59}, 
			{79, 42}, 
			{80, 52}, 
			{81, 46}, 
			{82, 54}, 
			{83, 55}, 
			{84, 34}, 
			{85, 47}, 
			{86, 49}, 
			{87, 50}, 
			{88, 43}, 
			{89, 44}, 
			{90, 53}, 
			{91, 51}, 	
			{104, 51}, 	
			{105, 51}, 	
			{539, 51}, 
			{581, 51}, 
			{582, 51}, 
			{92, 1},
			{151, 115},	--文泰来
			{154, 112},	--骆冰
			{161, 99},	--李莫愁
			{457, 114},	--点点
			{530, 116},--神雕
			{566, 117},--袁冠南
			{569, 113},	--李沅芷
			{574, 110},	--李清露
			{580, 135},--陆无双
			{589, 80}, --水笙
			{590, 86}, --李文秀
			{601, 48},	--韦小宝
			{604, 100},	--阿青
			{609, 105},	--赵敏
			{626, 120},	--郭襄
			{629, 51},	--阿九
			{631, 105},	--芷若			
			{646, 106},	--殷离	
			{763, 141},	--顾	
			{767, 136},	
			{768, 143},
			{769, 144},
			{770, 145},					
			};

    CC.BookNum=14;               --天书个数
    CC.BookStart=144;            --14天书起始物品id

    CC.MoneyID=174;              --金钱物品id
    CC.Shemale = {[78] = 1,[93] = 1,[470] = 1}
	CC.BBH= 198045761

	CC.Effect = {
	
	14,   --特效1--(10 -- 23)
	17,   --特效2--(24 -- 40)
	9,   --特效3--(41 -- 49)
	13,   --特效4--(50 -- 62)
	17,   --特效5--(63 -- 79)
	17,   --特效6--(80 -- 96)
	17,   --特效7--(97 -- 113)
	18,   --特效8--(114 -- 131)
	19,   --特效9--(132 -- 150)
	19,   --特效10--(151 -- 169)
	15,   --特效11--(170 -- 184)
	13,   --特效12--(185 -- 197)
	10,   --特效13--(198 -- 207)
	10,   --特效14--(208 -- 217)
	15,   --特效15--(218 -- 232)
	21,   --特效16--(233 -- 253)
	16,   --特效17--(254 -- 269)
	9,   --特效18--(270 -- 278)
	11,   --特效19--(279 -- 289)
	8,   --特效20--(290 -- 297)
	9,   --特效21--(298 -- 306)
	8,   --特效22--(307 -- 314)
	8,   --特效23--(315 -- 322)
	7,   --特效24--(323 -- 329)
	8,   --特效25--(330 -- 337)
	8,   --特效26--(338 -- 345)
	9,   --特效27--(346 -- 354)
	12,   --特效28--(355 -- 366)
	19,   --特效29--(367 -- 385)
	11,   --特效30--(386 -- 396)
	14,   --特效31--(397 -- 410)
	12,   --特效32--(411 -- 422)
	17,   --特效33--(423 -- 439)
	8,   --特效34--(440 -- 447)
	11,   --特效35--(448 -- 458)
	10,   --特效36--(459 -- 468)
	13,   --特效37--(469 -- 481)
	10,   --特效38--(482 -- 491)
	19,   --特效39--(492 -- 510)
	14,   --特效40--(511 -- 524)
	17,   --特效41--(525 -- 541)
	19,   --特效42--(542 -- 560)
	14,   --特效43--(561 -- 574)
	21,   --特效44--(575 -- 595)
	16,   --特效45--(596 -- 611)
	13,   --特效46--(612 -- 624)
	18,   --特效47--(625 -- 642)
	14,   --特效48--(643 -- 656)
	17,   --特效49--(657 -- 673)
	17,   --特效50--(674 -- 690)
	16,   --特效51--(691 -- 706)
	7,   --特效52--(707 -- 713)
	12,   --特效53--(714 -- 725)
	40,   --特效54--(726 -- 765)
	16,   --特效55--(766 -- 781)
	9,   --特效56--(782 -- 790)
	15,   --特效57--(791 -- 805)
	15,   --特效58--(806 -- 820)
	31,   --特效59--(821 -- 851)
	38,   --特效60--(852 -- 889)
	24,   --特效61--(890 -- 913)
	26,   --特效62--(914 -- 939)
	24,   --特效63--(940 -- 963)
	20,   --特效64--(964 -- 983)
	12,   --特效65--(984 -- 995)
	17,   --特效66--(996 -- 1012)
	14,   --特效67--(1013 -- 1026)
	14,   --特效68--(1027 -- 1040)
	10,   --特效69--(1041 -- 1050)
	10,   --特效70--(1051 -- 1060)
	18,   --特效71--(1061 -- 1078)
	31,   --特效72--(1079 -- 1109)
	12,   --特效73--(1110 -- 1121)
	7,   --特效74--(1122 -- 1128)
	6,   --特效75--(1129 -- 1134)
	7,   --特效76--(1135 -- 1141)
	28,   --特效77--(1142 -- 1169)
	16,   --特效78--(1170 -- 1185)
	7,   --特效79--(1186 -- 1192)
	16,   --特效80--(1193 -- 1208)
	20,   --特效81--(1209 -- 1228)
	15,   --特效82--(1229 -- 1243)
	13,   --特效83--(1244 -- 1256)
	15,   --特效84--(1257 -- 1271)
	11,   --特效85--(1272 -- 1282)
	11,   --特效86--(1283 -- 1293)
	11,   --特效87--(1294 -- 1304)
	20,   --特效88--(1305 -- 1324)
	20,   --特效89--(1325 -- 1344)
	20,   --特效90--(1345 -- 1364)
	17,   --特效91--(1365 -- 1381)
	17,   --特效92--(1382 -- 1398)
	17,   --特效93--(1399 -- 1415)
	9,   --特效94--(1416 -- 1424)
	8,   --特效95--(1425 -- 1432)
	8,   --特效96--(1433 -- 1440)
	17,   --特效97--(1441 -- 1457)
	10,   --特效98--(1458 -- 1467)
	11,   --特效99--(1468 -- 1478)
	8,   --特效100--(1479 -- 1486)
	29,   --特效101--(1487 -- 1515)
	6,   --特效102--(1516 -- 1521)
	13,   --特效103--(1522 -- 1534)
	31,   --特效104--(1535 -- 1565)
	14,   --特效105--(1566 -- 1579)
	4,   --特效106--(1580 -- 1583)
	13,   --特效107--(1584 -- 1596)
	13,   --特效108--(1597 -- 1609)
	15,   --特效109--(1610 -- 1624)
	24,   --特效110--(1625 -- 1648)
	20,   --特效111--(1649 -- 1668)
	12,   --特效112--(1669 -- 1680)
	16,   --特效113--(1681 -- 1696)
	18,   --特效114--(1697 -- 1714)
	17,   --特效115--(1715 -- 1731)
	14,   --特效116--(1732 -- 1745)
	12,   --特效117--(1746 -- 1757)
	19,   --特效118--(1758 -- 1776)
	16,   --特效119--(1777 -- 1792)
	12,   --特效120--(1793 -- 1804)
	14,   --特效121--(1805 -- 1818)
	14,   --特效122--(1819 -- 1832)
	6,   --特效123--(1833 -- 1838)
	8,   --特效124--(1839 -- 1846)
	24,   --特效125--(1847 -- 1870)
	19,   --特效126--(1871 -- 1889)
	16,   --特效127--(1890 -- 1905)
	14,   --特效128--(1906 -- 1919)
	20,   --特效129--(1920 -- 1939)
	18,   --特效130--(1940 -- 1957)
	16,   --特效131--(1958 -- 1973)
	13,   --特效132--(1974 -- 1986)
	25,   --特效133--(1987	 -- 2011)
	20,   --特效134--(2012 -- 2031)
	13,   --特效135--(2032 -- 2044)
	22,   --特效136--(2045 -- 2066)
	35,   --特效137--(2067 -- 2101)
	11,   --特效138--(2102 -- 2112)
	17,   --特效139--(2113 -- 2129)
	25,   --特效140--(2130 -- 2154)
	23,   --特效141--(2155 -- 2177)
	16,   --特效142--(2178 -- 2193)
	11,   --特效143--(2194 -- 2204)
	13,   --特效144--(2205 -- 2217)
	7,   --特效145--(2218 -- 2224)
	14,   --特效146--(2225 -- 2238)
	27,   --特效147--(2239 -- 2265)
	16,   --特效148--(2266 -- 2281)
	14,   --特效149--(2282 -- 2295)
	44,   --特效150--(2296 -- 2339)
	12,   --特效151--(2340 -- 2351)
	16,   --特效152--(2352 -- 2367)
	14,   --特效153--(2368 -- 2381)
	18,   --特效154--(2382 -- 2399)
	11,   --特效155--(2400 -- 2410)
	17,   --特效156--(2411 -- 2427)
	12,   --特效157--(2428 -- 2439)
	12,   --特效158--(2440 -- 2451)
	17,   --特效159--(2452 -- 2468)
	14,   --特效160--(2469 -- 2482)
	11,   --特效161--(2483 -- 2493)
	12,   --特效162--(2494 -- 2505)
	13,   --特效163--(2506 -- 2518)
	18,   --特效164--(2519 -- 2536)
	9,   --特效165--(2537 -- 2545)
	21,   --特效166--(2546 -- 2567)
	3,   --特效167--(2567 -- 2569)
	19,   --特效168--(2570 -- 2588)
	28,   --特效169--(2589 -- 2616)
	9,   --特效170--(2617 -- 2625)
	15,   --特效171--(2626 -- 2640)
	17,   --特效172--(2641 -- 2657)
	22,   --特效173--(2658 -- 2679)
	17,   --特效174--(2680 -- 2696)
	19,   --特效175--(2698 -- 2716)
	17,   --特效176--(2716 -- 2734)
	8,   --特效177--(2735 -- 2740)
	10,   --特效178--(2741 -- 2750)
	9,   --特效179--(2751 -- 2760)
	19,   --特效180--(2760 -- 2778)
	8,   --特效181--(2779 -- 2786)
	42,   --特效182--(2787 -- 2828)
	10,   --特效183--(2829 -- 2838)
	12,   --特效184--(2840 -- 2850)
	10,   --特效185--(2851 -- 2860)
	10,   --特效186--(2861 -- 2870)
	7,   --特效187--(2871 -- 2877)
	12,   --特效188--(2878 -- 2889)
	6,   --特效189--(2890 -- 2895)
	11,   --特效190--(2896 -- 2906)
	30	,	--	特效191	2907	--	2936
	27	,	--	特效192	2937	--	2963
	10	,	--	特效193	2964	--	2973
	10	,	--	特效194	2974	--	2983
	18	,	--	特效195	2984	--	3001
	10	,	--	特效196	3002	--	3011
	19	,	--	特效197	3012	--	3030
	20	,	--	特效198	3031	--	3050
	20	,	--	特效199	3051	--	3070
	22	,	--	特效200	3071	--	3092
	19	,	--	特效201	3093	--	3111
	22	,	--	特效202	3112	--	3133
	4 	,	--	特效203	3134	--	3137
	25	,	--	特效204	3138	--	3162
	18	,	--	特效205	3163	--	3180
	17	,	--	特效206	3181	--	3197
	14	,	--	特效207	3198	--	3211
	18	,	--	特效208	3212	--	3229
	15	,	--	特效209	3230	--	3244
	14	,	--	特效210	3245	--	3258
	32	,	--	特效211	3259	--	3290
	11	,	--	特效212	3291	--	3301
	15	,	--	特效213	3302	--	3316
	20	,	--	特效214	3317	--	3336
	16	,	--	特效215	3337	--	3352
	23	,	--	特效216	3353	--	3375
	20	,	--	特效217	3376	--	3395
	15	,	--	特效218	3396	--	3410
	31	,	--	特效219	3411	--	3441
	8	,	--	特效220	3442	--	3449
	13	,	--	特效221	3450	--	3462
	21	,	--	特效222	3463	--	3483
	13	,	--	特效223	3484	--	3496 
	29	,	--	特效224	3497	--	3525  --厨子做菜
	20	,	--	特效225	3526	--	3545  --凤凰浴火重生
	15	,	--	特效226	3546	--	3560  --破尽天下（破）字
	20	,	--	特效227	3561	--	3580  --旋转空间，万剑齐射
	16	,	--	特效228	3581	--	3596  --蓝色气浪散开
	15	,	--	特效229	3597	--	3611  --紫色细微光束
	30	,	--	特效230	3612	--	3641  --蓝色光束汇聚爆炸
	15	,	--	特效231	3642	--	3656  --紫色魂体汇聚
	26	,	--	特效232	3657	--	3682  --紫色鬼手
	22	,	--	特效233	3683	--	3704  --金色重剑坠击
	27	,	--	特效234	3705	--	3731  --蓝色冰封真气
	21	,	--	特效235	3732	--	3752  --地面红黄光
	29	,	--	特效236	3753	--	3781  --地面青藤蔓延@
	21	,	--	特效237	3782	--	3802  --紫环旋转
	20	,	--	特效238	3803	--	3822  
	12	,	--	特效239	3823	--	3834
	20	,	--	特效240	3835	--	3854
	30	,	--	特效241	3855	--	3884
	21	,	--	特效242	3885	--	3905
	12	,	--	特效243	3906	--	3917
	19	,	--	特效244	3918	--	3936
	34	,	--	特效245	3937	--	3970  --蓝色骷髅头飞舞
	18	,	--	特效246	3971	--	3988  --
	21	,	--	特效247	3989	--	4009  --
	11	,	--	特效248	4010	--	4020  --竹简展开
	21	,	--	特效249	4021	--	4041  --绿色气息
	11	,	--	特效250	4042	--	4052  --紫雾虚像 人
	12	,	--	特效251	4053	--	4064  --蓝色喷泉
	26	,	--	特效252	4065	--	4090  --
	14	,	--	特效253	4091	--	4104
	15	,	--	特效254	4105	--	4119
	5	,	--	特效255	4120	--	4124
	5	,	--	特效256	4125	--	4129
	3	,	--	特效257	4130	--	4132
	7	,	--	特效258	4133	--	4139
	4	,	--	特效259	4140	--	4143
	3	,	--	特效260	4144	--	4146
	2	,	--	特效261	4147	--	4148
	2	,	--	特效262	4149	--	4150
	2	,	--	特效263	4151	--	4152
	7	,	--	特效264	4153	--	4159
	2	,	--	特效265	4160	--	4161
	2	,	--	特效266	4162	--	4163
	5	,	--	特效267	4164	--	4168
	6	,	--	特效268	4169	--	4174
	8	,	--	特效269	4175	--	4182
	3	,	--	特效270	4183	--	4185
	3	,	--	特效271	4186	--	4188
	13	,	--	特效272	4189	--	4201
	10	,	--	特效273	4202	--	4211
	6	,	--	特效274	4212	--	4217
	4	,	--	特效275	4218	--	4221
	8	,	--	特效276	4222	--	4229
	3	,	--	特效277	4230	--	4232
	10	,	--	特效278	4233	--	4242
	2	,	--	特效279	4243	--	4244
	7	,	--	特效280	4245	--	4251
	4	,	--	特效281	4252	--	4255
	5	,	--	特效282	4256	--	4260
	7	,	--	特效283	4261	--	4267
	6	,	--	特效284	4268	--	4273
	6	,	--	特效285	4274	--	4279
	6	,	--	特效286	4280	--	4285
	4	,	--	特效287	4286	--	4289
	2	,	--	特效288	4290	--	4291
	3	,	--	特效289	4292	--	4294
	5	,	--	特效290	4295	--	4299
	3	,	--	特效291	4300	--	4302
	23	,	--	特效292	4303	--	4325  --红色气罩爆炸 @
	3	,	--	特效293	4326	--	4328
	6	,	--	特效294	4329	--	4334
	10	,	--	特效295	4335	--	4344
	5	,	--	特效296	4345	--	4349
	5	,	--	特效297	4350	--	4354
	2	,	--	特效298	4355	--	4356
	3	,	--	特效299	4357	--	4359
	3	,	--	特效300	4360	--	4362
	14	,	--	特效301	4363	--	4376
	8	,	--	特效302	4377	--	4384
	15	,	--	特效303	4385	--	4399
	15	,	--	特效304	4400	--	4414
	16	,	--	特效305	4415	--	4430
	30	,	--	特效306	4431	--	4460
	14	,	--	特效307	4461	--	4474
	30	,	--	特效308	4475	--	4504
	98	,	--	特效309	4505	--	4602
	70	,	--	特效310	4603	--	4672
	6	,	--	特效311	4673	--	4678
	4	,	--	特效312	4679	--	4682
	9	,	--	特效313	4683	--	4691
	9	,	--	特效314	4692	--	4700
	16	,	--	特效315	4701	--	4716
	6	,	--	特效316	4717	--	4722
	7	,	--	特效317	4723	--	4729
	7	,	--	特效318	4730	--	4736
	10	,	--	特效319	4737	--	4746
	6	,	--	特效320	4747	--	4752
	6	,	--	特效321	4753	--	4758
	6	,	--	特效322	4759	--	4764
	8	,	--	特效323	4765	--	4772
	6	,	--	特效324	4773	--	4778
	8	,	--	特效325	4779	--	4786
	5	,	--	特效326	4787	--	4791
	7	,	--	特效327	4792	--	4798
	6	,	--	特效328	4799	--	4804
	7	,	--	特效329	4805	--	4811
	7	,	--	特效330	4812	--	4818
	7	,	--	特效331	4819	--	4825
	6	,	--	特效332	4826	--	4831
	7	,	--	特效333	4832	--	4838
	10	,	--	特效334	4839	--	4848
	4	,	--	特效335	4849	--	4852
	4	,	--	特效336	4853	--	4856
	6	,	--	特效337	4857	--	4862
	4	,	--	特效338	4863	--	4866
	6	,	--	特效339	4867	--	4872
	8	,	--	特效340	4873	--	4880
	10	,	--	特效341	4881	--	4890
	7	,	--	特效342	4891	--	4897
	8	,	--	特效343	4898	--	4905
	6	,	--	特效344	4906	--	4911
	15	,	--	特效345	4912	--	4926
	11	,	--	特效346	4927	--	4937
	10	,	--	特效347	4938	--	4947
	14	,	--	特效348	4948	--	4961
	18	,	--	特效349	4962	--	4979
	12	,	--	特效350	4980	--	4991
	12	,	--	特效351	4992	--	5003
	8	,	--	特效352	5004	--	5011
	8	,	--	特效353	5012	--	5019
	8	,	--	特效354	5020	--	5027
	8	,	--	特效355	5028	--	5035
	8	,	--	特效356	5036	--	5043
	8	,	--	特效357	5044	--	5051
	8	,	--	特效358	5052	--	5059
	8	,	--	特效359	5060	--	5067
	8	,	--	特效360	5068	--	5075
	8	,	--	特效361	5076	--	5083
	8	,	--	特效362	5084	--	5091
	8	,	--	特效363	5092	--	5099
	8	,	--	特效364	5100	--	5107
	8	,	--	特效365	5108	--	5115
	8	,	--	特效366	5116	--	5123
	8	,	--	特效367	5124	--	5131
	8	,	--	特效368	5132	--	5139
	8	,	--	特效369	5140	--	5147
	8	,	--	特效370	5148	--	5155
	8	,	--	特效371	5156	--	5163
	26	,	--	特效372	5164	--	5189
	12	,	--	特效373	5190	--	5201
	27	,	--	特效374	5202	--	5228
	13	,	--	特效375	5229	--	5241
	12	,	--	特效376	5242	--	5253
	15	,	--	特效377	5254	--	5268
	12	,	--	特效378	5269	--	5280
	13	,	--	特效379	5281	--	5293
	16	,	--	特效380	5294	--	5309
	7	,	--	特效381	5310	--	5316
	23	,	--	特效382	5317	--	5339
	14	,	--	特效383	5340	--	5353
	15	,	--	特效384	5354	--	5368
	12	,	--	特效385	5369	--	5380
	8	,	--	特效386	5381	--	5388
	16	,	--	特效387	5389	--	5404
	13	,	--	特效388	5405	--	5417
	16	,	--	特效389	5418	--	5433
	16	,	--	特效390	5434	--	5449
	16	,	--	特效391	5450	--	5465
	11	,	--	特效392	5466	--	5476
	13	,	--	特效393	5477	--	5489
	14	,	--	特效394	5490	--	5503--巨剑坠击
	12	,	--	特效395	5504	--	5515--血龙
	18	,	--	特效396	5516	--	5533--红色光柱
	13	,	--	特效397	5534	--	5546--金光爆炸
	10	,	--	特效398	5547	--	5556--金光环绕
	19	,	--	特效399	5557	--	5575--辟邪快剑
	10	,	--	特效400	5576	--	5585--紫气东来
	13	,	--	特效401	5586	--	5598--太极攻击2
	34	,	--	特效402	5599	--	5632--脚采太极图2
	10	,	--	特效403	5633	--	5642--新辟邪剑法特效
	10	,	--	特效404	5643	--	5652--新葵花真气特效
	12	,	--	特效405	5653	--	5664--新降龙
	11	,	--	特效406	5665	--	5675--佛入魔
	13	,	--	特效407	5676	--	5688--佛门出招特效
	10 ,	-- 特效408	5689	--	5698--新先天真气
	10 ,	-- 特效409	5699	--	5708--新长生真气
	16 ,	-- 特效410	5709	--	5724--剑气外放
	12 ,	-- 特效411	5725	--	5736--剑气侵蚀
	18 ,	-- 特效412	5737	--	5754--万剑归宗自身
	10 ,	-- 特效413	5755	--	5764--万剑归宗敌人
	11 ,	-- 特效414	5765	--	5775--极死七夜
	12 ,	-- 特效415	5776	--	5787--蓝色太极图
	12 ,	-- 特效416	5788	--	5799--太极护体
	10 ,	-- 特效417	5800	--	5809--天人化生
	12 ,	-- 特效418	5810	--	5821--葵花真气
	12 ,	-- 特效419	5822	--	5833--辟邪剑气
	10 ,	-- 特效420	5834	--	5843--气剑
	15 ,	-- 特效421	5844	--	5858--吸星护盾
	23 ,	-- 特效422	5858	--	5881--一刀流1
	15 ,	-- 特效423	5882	--	5896--斗转觉醒
	29 ,	-- 特效424	5897	--	5925--一刀流2
	10 ,	-- 特效425	5926	--	5935--一九剑攻击
	12 ,	-- 特效426	5936	--	5947--一九剑暗器反击
	9 ,	    -- 特效427	5948	--	5956--一九剑剑气
	18 ,	-- 特效428	5957	--	5974--一九剑恢复
	15,   -- 特效429  5975 -- 5989  --互搏真谛
	18,   -- 特效430  5990 -- 6007  --新黯然
	16,   -- 特效431  6008 -- 6023  --九阴九阳融合护盾
	30,   -- 特效432  6024 -- 6053  --诸葛武侯七星灯
	24,   -- 特效433  6054 -- 6077  --新奇门遁甲
	35,   -- 特效434  6078 -- 6112  --阿青剑气环绕
	21,   -- 特效435  6113 -- 6133  --越女剑仙行动前
	12,   -- 特效436  6134 -- 6145  --越女剑法攻击特效
	16,   -- 特效437  6146 -- 6161  --瞎米环绕效果
	
	
	
	[0] = 9	--特效0	Tiny heart(when heal)
	}
	
	--[[12;		--特效202 灭剑绝剑
	16;		--特效203 由下往上卷的圆形火焰
	25;		--特效204 灵蛇杖法
	19;		--特效205 蛤蟆功
	14;		--特效206 金色太极
	18;		--特效207山寨降龙
	14;		--特效208山寨黯然掌
	12;		--特效209山寨铁掌]]
	
	--装备对威力的加成
    CC.ExtraOffense = {
			{52, 75, 100},		--鳄嘴剪+大剪刀
			{45, 67, 100},		--冷月宝刀+胡刀
			{43, 349, 500},		--屠龙刀+屠龙刀法
			{202, 67, 100},		--闯王军刀+胡刀
			{37, 41, 100},		--倚天剑+灭剑
			{49, 80, 200},		--打狗棒+打狗棒法
			{44, 63, 200},		--血刀+血刀
			{40, 40, 200},		--金蛇剑+金蛇
			{36, 45, 100},		--玄铁剑+玄铁
			{276, 155, 3000},	--火枪+火枪
			{51, 78, 200},		--金龙鞭+黄沙万里鞭法
			{50, 86, 100},		--伏魔杵+伏魔杖法
			{241, 39, 100},		--君子剑+全真剑法
			{242, 42, 100},		--淑女剑+玉女剑法
			{244, 81, 200},		--西毒蛇杖+灵蛇杖法
			{55, 110, 100},		--神山剑+神山剑法
			{56, 111, 100},		--玄铁菜刀+西瓜刀法
			{57, 112, 100},		--犽月+犽月流空
			{243, 77, 200},		--金刀黑剑+阴阳倒乱刃
			{39, 44, 100},		--白龙剑+苗家剑法
			{236, 46, 100},		--真武剑+太极剑法
			{326,156,200},
			{326,188,200},
			}

    CC.NewPersonName=CONFIG.PlayName;                --新游戏的数据
	
   CC.NewGameSceneID = 70
	CC.NewGameSceneX = 16
	CC.NewGameSceneY = 31
	CC.NewGameEvent = 691
	CC.NewPersonPicM = 2515
	CC.NewPersonPicF = 5015

	CC.PersonAttribMax = {}
	CC.PersonAttribMax["经验"] = 60000
	CC.PersonAttribMax["物品修炼点数"] = 30000
	CC.PersonAttribMax["修炼点数"] = 30000
	CC.PersonAttribMax["生命最大值"] = 9999
	CC.PersonAttribMax["受伤程度"] = 100
	CC.PersonAttribMax["中毒程度"] = 150
	CC.PersonAttribMax["内力最大值"] = 9999
	CC.PersonAttribMax["生命增长"] = 15
	CC.PersonAttribMax["体力"] = 100
	CC.PersonAttribMax["攻击力"] = 1000
	CC.PersonAttribMax["防御力"] = 1000
	CC.PersonAttribMax["轻功"] = 1000
	CC.PersonAttribMax["医疗能力"] = 300
	CC.PersonAttribMax["用毒能力"] = 300
	--CC.PersonAttribMax["解毒能力"] = 300
	CC.PersonAttribMax["抗毒能力"] = 300
	CC.PersonAttribMax["拳掌功夫"] = 999
	CC.PersonAttribMax["指法技巧"] = 999
	CC.PersonAttribMax["御剑能力"] = 999
	CC.PersonAttribMax["耍刀技巧"] = 999
	CC.PersonAttribMax["特殊兵器"] = 999
	CC.PersonAttribMax["暗器技巧"] = 999
	CC.PersonAttribMax["武学常识"] = 500
	CC.PersonAttribMax["品德"] = 120
	CC.PersonAttribMax["资质"] = 100
	CC.PersonAttribMax["攻击带毒"] = 500
	CC.PersonAttribMax["冰封程度"] = 100
	CC.PersonAttribMax["灼烧程度"] = 100
	CC.PersonAttribMax["流血程度"] = 100
	CC.PersonAttribMax["封穴程度"] = 50
    CC.PersonAttribMax["实战"] = 1000
    
    CC.WarDataSize=186;         --战斗数据大小  war.sta数据结构
    CC.WarData_S={};        --战斗数据结构
    CC.WarData_S["代号"]={0,0,2};
    CC.WarData_S["名称"]={2,2,10};
    CC.WarData_S["地图"]={12,0,2};
    CC.WarData_S["经验"]={14,0,2};
    CC.WarData_S["音乐"]={16,0,2};
    for i=1,6 do
        CC.WarData_S["手动选择参战人"  .. i]={18+(i-1)*2,0,2};
        CC.WarData_S["自动选择参战人"  .. i]={30+(i-1)*2,0,2};
        CC.WarData_S["我方X"  .. i]={42+(i-1)*2,0,2};
        CC.WarData_S["我方Y"  .. i]={54+(i-1)*2,0,2};
    end
    for i=1,20 do
        CC.WarData_S["敌人"  .. i]={66+(i-1)*2,0,2};
        CC.WarData_S["敌方X"  .. i]={106+(i-1)*2,0,2};
        CC.WarData_S["敌方Y"  .. i]={146+(i-1)*2,0,2};
    end

    CC.WarWidth=64;        --战斗地图大小
    CC.WarHeight=64;

	--显示主地图和场景地图坐标
	--如果显示坐标，则会增加cpu占用。机器速度慢的话可能会卡。这个在调试时有用。
	CC.ShowXY=1      --0 不显示 1 显示


	--以下为控制显示方式的参数
	CC.MenuBorderPixel=5  -- 菜单四周边框留的像素数，也用于绘制字符串的box四周留得像素

	CC.DefaultFont=math.modf(math.min(CC.ScreenW,CC.ScreenH) / 320 * 14);
	CC.SmallFont = CC.DefaultFont*3/4;
	CC.FontBIG = math.modf(CC.DefaultFont*1.45)
	CC.FontBig = math.modf(CC.DefaultFont*1.3)
	CC.Fontbig = math.modf(CC.DefaultFont*1.15)
	CC.Fontsmall = math.modf(CC.DefaultFont*0.85)
	CC.FontSmall = math.modf(CC.DefaultFont*0.7)
	CC.FontSmall2 = math.modf(CC.DefaultFont*0.65)
	CC.FontSmall3 = math.modf(CC.DefaultFont*0.635)
	CC.FontSmall4 = math.modf(CC.DefaultFont*0.9)
	CC.FontSmall5 = math.modf(CC.DefaultFont*0.92)
	CC.FontSMALL = math.modf(CC.DefaultFont*0.55)
	CC.RowPixel = math.modf(math.min(CC.ScreenW, CC.ScreenH) / 100)

	--CC.StartMenuY= 160       --开始菜单Y坐标
	CC.StartMenuFontSize=CC.DefaultFont  --开始菜单字号

	--CC.NewGameY= 160         --新游戏属性显示Y坐标
	CC.NewGameFontSize =CC.DefaultFont   --新游戏属性选择字号


	CC.MainMenuX=10;         --主菜单开始坐标
	CC.MainMenuY=10;

	CC.GameOverX=90;
	CC.GameOverY=65;

    CC.PersonStateRowPixel= 5;    --显示人物状态行间距像素
    
    --物品显示定义
    CC.ThingFontSize = CC.Fontsmall;
		
	--CC.ThingPicWidth=math.modf(100*CONFIG.Zoom/100);    --物品图片宽高
	CC.ThingPicWidth=100	--物品图片固定尺寸
	CC.ThingPicHeight=CC.ThingPicWidth;

	local n = math.modf(CC.ScreenW/CC.ThingPicWidth-2);			--一行显示几个物品
	if n < 10 then	
		CC.MenuThingXnum = 9;				
	else
		CC.MenuThingXnum = 9
	end
	--周目商店一行显示物品
	if n < 6 then
		CC.MXZM = 5
	else
		CC.MXZM = 5
	end	
	local m = math.modf(CC.ScreenH/CC.ThingPicHeight-2);		--物品显示几列
	if m < 5 then	
		CC.MenuThingYnum = 5;
	else
		CC.MenuThingYnum = 5;
	end

	CC.ThingGapOut=4;		--物品图像显示四周留白
	CC.ThingGapIn=4;		--物品图像显示中间间隔	

    CC.StartMenuY=CC.ScreenH-3*(CC.StartMenuFontSize+CC.RowPixel)-20;
	CC.NewGameY=CC.ScreenH-4*(CC.NewGameFontSize+CC.RowPixel)-10;

	--子菜单的开始坐标
	CC.MainSubMenuX=CC.MainMenuX+2*CC.MenuBorderPixel+2*CC.DefaultFont+5;       --主菜单为两个汉字
	CC.MainSubMenuY=CC.MainMenuY;

	--二级子菜单开始坐标
	CC.MainSubMenuX2=CC.MainSubMenuX+2*CC.MenuBorderPixel+4*CC.DefaultFont+5;   --子菜单为四个字符

	CC.SingleLineHeight=CC.DefaultFont+2*CC.MenuBorderPixel+5;  --带框的单行字符高

	CC.StartThingPic = 0
	
	CC.AutoMoveEvent = {[0]=0};		--鼠标操作时是否触发事件， 第一个位置0未触发， 1触发， 2触发并且能够走到面前， 第二和第三个位置为XY坐标
	CC.MMapAdress = {};				--大地图地址

	--LMSJ = {"少商剑", "商阳剑", "中冲剑", "关冲剑", "少冲剑", "少泽剑"}
	--XL18 = {"亢龙有悔", "见龙在田", "飞龙在天", "双龙出水", "神龙摆尾", "潜龙勿用"}
	XL18JY = {"极意--亢龙·鸿渐於陆", "极意--飞龙·或跃在渊", "极意--潜龙·密雨不云", "极意--神龙·震惊百里", "极意--见龙·利涉大川", "极意--双龙·突如其来", "极意--六龙·履霜冰至", "极意--龙战·损则有孚"}
	TFSSJ = {"·『天道惊雷憾』", "·『点墨山河』", "·『一剑镇神洲』", "·『羽葬煌炎斩』", "·『千机龙绝闪』", "·『化气御九天』", "·『仁者无敌』", "·『八门聚万象』", "·『天人五衰』"}
	ZJTF = {"盖世神拳", "灵犀一指", "剑神一笑", "傲世狂刀", "奇门无双", "绝世天罡", "仁者无敌", "回天圣手", "欲天摩罗", "风月无间",'大千天魔'}
	TFE = {"拳", "指", "剑", "刀", "特", "罡", "仁", "医", "毒", "嫖"}
	--YLJFZS = {"清饮小酌", "浪迹天涯", "举案齐眉", "皓腕玉镯", "冷月窥人", "竹帘临池"}
	--QZJFZS = {"大江似练", "斜风细雨", "星河欲转", "桃花流水"}
	SJHBJFZS = {"双剑合璧--清饮小酌", "双剑合璧--浪迹天涯", "双剑合璧--举案齐眉", "双剑合璧--皓腕玉镯", "双剑合璧--冷月窥人", 
	"双剑合璧--竹帘临池","双剑合璧--大江似练", "双剑合璧--斜风细雨", "双剑合璧--星河欲转", "双剑合璧--桃花流水"}
	--SHSGZS = {"石火电光", "火中取栗", "明火执仗", "引火烧身", "烽火连天", "刀山火海"}
	TSTF = {nil, "影帝"}
	
	
	PSX = {"代号","头像/战斗代号","生命增长","无用","姓名","外号","性别","等级","经验值","生命","生命最大值","受伤程度",
	"中毒程度","体力","物品修炼点数","武器","防具","出招动画帧数","出招动画帧数","出招动画帧数","出招动画帧数",
	"出招动画帧数","出招动画延迟","出招动画延迟","出招动画延迟","出招动画延迟","出招动画延迟","武功音效延迟",
	"武功音效延迟","武功音效延迟","武功音效延迟","武功音效延迟","内力性质",
	"内力","内力最大值","攻击力","轻功","防御力","医疗","用毒","解毒","抗毒","拳掌","指法",
	"御剑","耍刀","特殊兵器","暗器技巧","武学常识","品德","攻击带毒","左右互搏","声望",
	"资质","修练物品","修炼点数","所会武功1","所会武功2","所会武功3","所会武功4","所会武功5",	
	"所会武功6","所会武功7","所会武功8","所会武功9","所会武功10","所会武功11","所会武功12","所会武功13",	
	"所会武功14","所会武功15","所会武功1等级","所会武功2等级","所会武功3等级","所会武功4等级","所会武功5等级",
	"所会武功6等级","所会武功7等级","所会武功8等级","所会武功9等级","所会武功10等级","所会武功11等级",
	"所会武功12等级","所会武功13等级","所会武功14等级","所会武功15等级",
	"携带物品1","携带物品2","携带物品3","携带物品4","携带物品1数量","携带物品2数量","携带物品3数量","携带物品4数量",
	"天赋外功1","天赋外功2","属性点数","武学点数","天赋内功","天赋轻功","实战","出战","命中","主运内功","主运轻功",	
	"六如觉醒","个人觉醒","畅想分阶","外号2","冰封程度","血量翻倍","论剑奖励","灼烧程度","行为模式",	
	"优先使用","是否吃药","生命阈值","内力阈值","体力阈值","禁用自动","特色指令","坐骑","中庸","半身像",	
	"迷踪步","门派","门派位阶","门派技能1","门派技能2","门派技能3","门派技能4","门派技能5","门派技能6",
	"门派技能7","门派技能8","门派技能9","门派技能10","暂时无用"
	}
	
	--邪线记录
	CC.XXJL = 0
	--夜雨楼用变量
	CC.YYLAS1 = {}
	CC.YYLAS2 = {}
	WARSZJY = {3, 2, 5, 2, 20, 15, 5, 5, 5, 5, 5, 5, 5, 5, 3, 2, 2,
	10, 5, 4, 4, 5, 4, 2, 2, 10, 20, 2, 3, 3, 3, 3, 3, 3, 5, 3, 4, 4,
	8, 8, 4, 4, 4, 4, 2, 5, 3, 4, 3, 15, 4, 2, 3, 3, 4, 4, 15, 5, 5,
	15, 3, 15, 3, 15, 10, 2, 8, 3, 15, 7, 8, 3, 3, 3, 4, 2, 2, 2, 2,
	4, 2, 2, 2, 3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 7, 7, 4, 4, 2,
	2, 12, 2, 2, 2, 3, 3, 3, 3, 3, 7, 7, 25, 3, 3, 5, 6, 3, 3, 3, 3,
	3, 3, 3, 3, 3, 3, 10, 3, 3, 3, 3, 3, 3, 3, 2, 3, 2, 35, 2, 2, 2,
	2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3,
	3, 3, 3, 3, 3, 4, 3, 4, 4, 4, 2, 2, 2, 2, 2, 2, 2, 3, 7, 7, 4, 3, 5, 5, 3}
	--称号
	RWWH = {}
	RWWH[1] = "雪山飞狐"
	RWWH[2] = "灵枢素问"
	RWWH[3] = "金面佛"
	RWWH[4] = "雁过拨毛"
	RWWH[5] = "太极宗师"
	RWWH[6] = "灭绝师太"
	RWWH[7] = "铁琴先生"	--何太冲
	RWWH[8] = "崆峒掌门"	--唐文亮
	RWWH[9] = "九阳明尊"
	RWWH[10] = "光明右使"
	RWWH[11] = "光明左使"
	RWWH[12] = "白眉鹰王"
	RWWH[13] = "金毛狮王"
	RWWH[14] = "青翼蝠王"
	RWWH[15] = "紫衫龙王"
	RWWH[16] = "蝶谷医仙"
	RWWH[17] = "蝶谷毒仙"
	RWWH[18] = "混元霹雳手"
	RWWH[19] = "君子剑"
	RWWH[20] = "潇湘夜雨"
	RWWH[21] = "恒山掌门"
	RWWH[22] = "嵩山掌门"
	RWWH[23] = "泰山掌门"
	RWWH[24] = "青城掌门"
	RWWH[25] = "五毒教主"
	RWWH[26] = "日月魔帝"
	RWWH[27] = "风云再起"
	RWWH[28] = "杀人名医"
	RWWH[29] = "万里独行"
	RWWH[30] = "傻小子"
	RWWH[31] = "梅庄四友"
	RWWH[32] = "梅庄四友"
	RWWH[33] = "梅庄四友"
	RWWH[34] = "梅庄四友"
	RWWH[35] = "九剑传人"
	RWWH["35"] = "剑魔再临"
	RWWH[36] = "辟邪剑客"
	RWWH[37] = "真名神照"
	RWWH["38"] = "混沦太玄"
	RWWH[39] = "侠客岛主"
	RWWH[40] = "侠客岛主"
	RWWH[41] = "赏善使者"
	RWWH[42] = "罚恶使者"
	RWWH[43] = "雪山掌门"
	RWWH[44] = "凶神恶煞"
	RWWH[45] = "阎王敌"
	RWWH[46] = "星宿老怪"
	RWWH[47] = "曼珠沙华"
	RWWH[48] = "冰毒怪客"
	RWWH[49] = "小和尚"
	RWWH["49"] = "逍遥掌门"
	RWWH[50] = "狂龙天征"
	RWWH[539] = "狂龙天征"
	RWWH[51] = "姑苏慕容"
	RWWH[52] = "中平神枪"
	RWWH[53] = "六脉真传"
	RWWH[54] = "碧血长风"
	RWWH[55] = "侠之大者"
	RWWH[56] = "兰质蕙心"
	RWWH[57] = "桃花岛主"
	RWWH[58] = "西狂"
	RWWH[59] = "冷若天仙"
	RWWH[60] = "西毒"
	RWWH[61] = "白驼少主"
	RWWH[62] = "元蒙帝师"
	RWWH[63] = "青箫落瑛"
	RWWH[64] = "顽童武痴"
	RWWH[65] = "南僧"
	RWWH[66] = "波斯圣女"
	RWWH[67] = "铁掌帮主"
	RWWH[68] = "长春子"
	RWWH[69] = "北丐"
	RWWH[71] = "神龙教主"
	RWWH[72] = "天龙掌门"
	RWWH[73] = "日月圣姑"
	RWWH[74] = "翠羽黄衫"
 	RWWH[75] = "天池红花"
	RWWH[76] = "琅嬛仙子"
	RWWH[77] = "秀外慧中"
	RWWH[78] = "铁尸魔煞"
	RWWH[79] = "慧中灵剑"
	RWWH[80] = "火手判官"
	RWWH[81] = "雪岭双姝"
	RWWH[82] = "玉面孟尝"
	RWWH[83] = "五毒教主"
	RWWH[84] = "小王爷"
	RWWH[85] = "老谋深算"
	RWWH[86] = "金枝玉叶"
	RWWH[87] = "媚眼如丝"
	RWWH[88] = "酒神"
	RWWH[89] = "食神"
	RWWH[90] = "毓秀灵姝"	
	RWWH[91] = "青青子衿"
	RWWH[92] = "扑朔迷离"
	RWWH[94] = "仁义刀"
	RWWH[95] = "柔云剑"
	RWWH[96] = "冷月剑"
	RWWH[97] = "血刀老祖"
	RWWH[98] = "恶贯满盈"
	RWWH[101] = "笔砚生"
	RWWH[102] = "天龙禅师"
	RWWH[103] = "大轮明王"
	RWWH[104] = "珠落玉盘"
	RWWH[105] = "吴侬软语"
	RWWH[106] = "金刀无敌"
	RWWH[112] = "震天魔狼"
	RWWH[113] = "参合潜龙"
	RWWH[114] = "达摩再世"
	RWWH[115] = "聪辩先生"
	RWWH[116] = "风月无间"
	RWWH[117] = "不老长春"
	RWWH[118] = "秋水无尘"
	RWWH[129] = "中神通"
	RWWH[131] = "妙手书生"
	RWWH[138] = "一指震江南"	--瓦尔拉齐
	RWWH[140] = "剑术通神"		--风清扬
	RWWH[142] = "狂风快剑"
	RWWH[149] = "少林掌门"
	RWWH[153] = "暗器之王"
	RWWH[154] = "鸳鸯刀"
	RWWH[157] = "湘西尸王"
	RWWH[158] = "波斯大贾"
	RWWH[159] = "瑜伽鬼王"
	RWWH[160] = "尊师重道"		--达尔巴
	RWWH[161] = "赤练仙子"
	RWWH[164] = "摩天居士"
	RWWH[171] = "武当儒侠"
	RWWH[185] = "神剑仙猿"
	RWWH[186] = "神拳无敌"
	RWWH[311] = "天山双鹰"
	RWWH[456] = "饕餮"
	RWWH[457] = "赋闲公子"
    RWWH[510] = '曲夕烟隙'
	RWWH[511] = '盗圣'
	RWWH[520] = "剑道宗师"
	RWWH[529] = "慕容家主"
	RWWH[530] = '雕兄'
	RWWH[532] = '武当七侠'
	RWWH[533] = '武当七侠'
	RWWH[534] = '武当七侠'
	RWWH[535] = '武当七侠'
	RWWH[536] = '武当七侠'
	RWWH[537] = '武当七侠'
	RWWH[538] = '武当七侠'
	RWWH[553] = "真田一之兵"
	RWWH[589] = "铃剑侠女"		--水笙
	RWWH[590] = "古道西风"		--李文秀
	RWWH[592] = "无我无剑"		--独孤求败
	RWWH[596] = "一刀流"		--独孤求败
	RWWH[501] = "一刀流"		--独孤求败
	RWWH[597] = "金刚伏魔"		--渡厄
	RWWH[598] = "金刚伏魔"		--渡劫
	RWWH[599] = "金刚伏魔"		--渡难
	RWWH[594] = "铁索横江"		--戚长发
	RWWH[601] = "天魁地宝"		--韦小宝
	RWWH[602] = "阴阳怪气"		--海大富
	RWWH[603] = "满洲勇士"		--鳌拜
	RWWH[604] = "越女剑仙"		--阿青
	RWWH[605] = "姑射仙姿"		--林朝英
	RWWH[606] = "西域战神"		--阿凡提
	RWWH[607] = "乱世浮萍"		--焦宛儿
	RWWH[609] = "绍敏郡主"		--赵敏
	RWWH[616] = "绝情谷主"		--公孙止
	RWWH[617] = "铁掌莲花"		--裘千尺
	RWWH[626] = "小东邪"		--郭襄
	RWWH["626"] = "峨眉祖师"
	RWWH[627] = "王霸之气"		--蒙哥
	RWWH[628] = "雕兄"			--神雕
	RWWH[629] = "长平公主"		--阿九
	RWWH[631] = "谁与争锋"		--周芷若
	RWWH[642] = "精心打磨"		--四大山
	RWWH[646] = "绝色佳人"		--殷离
	RWWH[647] = "玄冥二老"		--鹤笔翁
	RWWH[648] = "玄冥二老"		--鹿杖客
	RWWH[649] = "华山玉女"		--宁中则
	RWWH[650] = "小王爷"		--杨康
	RWWH[651] = "影帝"			--张家辉
	RWWH[636] = "青莲剑仙"	    --李白
	RWWH[652] = "神州大侠"	    --萧秋水
	RWWH[635] = "西昆仑"	    --梁萧
	RWWH[497] = "金刚门人"	    --陆渐
	RWWH[498] = "小李探花"	    --李寻欢
	RWWH[638] = "九阳至尊"	    --斗酒僧
	RWWH[640] = "古墓后人"	    --黄衫女
	RWWH[189] = "晋阳大侠"	    --萧半和
	RWWH[633] = "辽东大侠"	    --胡一刀
	RWWH[500] = "剑神"	    --西门吹雪	
	RWWH[588] = "岛主夫人"	--冯蘅	
	RWWH[587] = "紫衣银鞭"	--袁紫衣		
	RWWH[586] = "昆仑三圣"	    --何足道
	RWWH[584] = "不哭死神"	    --
	RWWH[583] = "小尼姑"		--
	RWWH[582] = "冰川天女"		--	
	RWWH[581] = "丁丁当当"		--
	RWWH[580] = "银弧刀"		--	
	RWWH[579] = "盗王之王"	  --司空摘星	
	RWWH[637] = "九阴至尊"	  --黄赏
	RWWH[578] = "大唐双龙"	  --寇仲
	RWWH[634] = "逍遥祖师"	  --	逍遥子
	RWWH[577] = "禅宗始祖"	  --	达摩
	RWWH[569] = "小魔女"	  --	李沅芷
	RWWH[151] = "奔雷手"	  --	文泰来
	RWWH[574] = "寒露清梦"	  --萧玲
	RWWH[613] = "铁掌神鞭"	  
	RWWH[612] = "铁鞭震八方"
	RWWH[614] = "荒野游龙"	
	RWWH[615] = "玉堂飞燕"	
	RWWH[566] = "白衣书生"	
	RWWH[639] = "金蛇郎君"	--	
	RWWH[499] = "大理太祖"	--
	RWWH[313] = "天佛降世"	--	
	RWWH[658] = "天池怪侠"
	RWWH[657] = "悲天佛怜"	
	RWWH[656] = "天怒红颜"
	RWWH[655] = "红粉骷髅"
	RWWH[567] = "千秋侠烈"	
	RWWH[570] = "棉里针"	
	RWWH[571] = "总舵主"	
	RWWH[573] = "仁阳佛光"	
	RWWH[575] = "神剑仙猿"	
	RWWH[576] = "佛门无双"	
	RWWH[641] = "圣火明尊"		
	RWWH[568] = "精忠报国"	
	RWWH[567] = "千秋侠烈"	
	RWWH[650] = "小王爷"	
	RWWH[505] = "大唐双龙"
	RWWH[504] = "太虚剑主"
	RWWH[507] = "琅琊公子"
    RWWH[508] = "琅琊公子"	
    RWWH[513] = "长风万里"	
	RWWH[721] = "黄河老祖"	
	RWWH[546] = "风中之神"
	RWWH[610] = "妙手仁心"
	RWWH[545] = "望雪颦愁"
	RWWH[722] = "八卦高手"
	RWWH[737] = "八卦高手"
	RWWH[724] = "丐帮帮主"
	RWWH[738] = "冰肌玉骨"
	RWWH[514] = "雪羽宗主"
	RWWH[525] = "南天一霸"
	RWWH[526] = "夜雨剑首"
	RWWH[517] = "夜雨初代楼主"
	RWWH[745] = "大轮萌王"
	RWWH[750] = "夜雨楼主"
	RWWH[754] = "沧海明珠"
	RWWH[761] = "枪剑谜帝"
	RWWH[763] = "花间才女"
	RWWH[771] = "小神龙"
	RWWH[775] = "跑堂之神"
	
	--天赋
	RWTFLB = {}
	RWTFLB[514] = "不归三境"
	RWTFLB[311] = "秃鹰"
	RWTFLB[610] = "流云飞袖"	
	RWTFLB[546] = "入魔"
	RWTFLB[508] = "亘天赤焰"	
	RWTFLB[507] = "江左梅郎"		
	RWTFLB[505] = "九字真言"	
	RWTFLB[650] = "无妄无我"	
	RWTFLB[567] = "傲世神罡"	
	RWTFLB[568] = "决胜千里"		
	RWTFLB[641] = "魔道天行"		
	RWTFLB[576] = "无量禅震"	
	RWTFLB[575] = "闪电惊鸿"			
	RWTFLB[573] = "天域幻音"		
	RWTFLB[657] = "诸法无我"		
	RWTFLB[658] = "博通百家"	
	RWTFLB[313] = "诸行无常"		
	RWTFLB[140] = "无我无剑"		
	RWTFLB[499] = "文韬武略"	
	RWTFLB[27] = "化凰为凤"	      --萧玲		
	RWTFLB[574] = "天仙锁魂"	  --萧玲		
	RWTFLB[151] = "否极泰来"	  --文泰来	
	RWTFLB[68] = "一言止杀"       --丘处机	
	RWTFLB[5] = "通微显化"	      --张三丰
	RWTFLB[577] = "一苇渡江"	  --达摩	
	RWTFLB[634] = "长春不老"	  --逍遥子
	RWTFLB[578] = "兵法入刀"	  --寇仲	
	RWTFLB[637] = "大道归藏"		 --黄赏
	RWTFLB[579] = "千变万幻"		 --司空摘星
	RWTFLB[629] = "浴火凤凰"		--
	RWTFLB[580] = "古墓无双"		--
	RWTFLB[581] = "机灵古怪"		--
	RWTFLB[649] = "娇美人妻"		--宁中则
	RWTFLB[583] = "普善圣心"		--仪琳
	RWTFLB[582] = "雪花神剑"		--白绣
	RWTFLB[1] = "魂系一刀"
	RWTFLB[4] = "跌打医生"
	RWTFLB[9] = "运转乾坤"
    RWTFLB[20] = "七弦无形剑"
	RWTFLB[35] = "灵奇洒脱"
	RWTFLB[37] = "赤心连城"
	RWTFLB[38] = "名相皆无"	
	RWTFLB[48] = "心无所住"
	RWTFLB[49] = "福缘深厚"
	RWTFLB[50] = "奋英雄怒"
	RWTFLB[539] = "奋英雄怒"
	RWTFLB[51] = "离合参商"
	RWTFLB[53] = "磊落仁心"
	RWTFLB[54] = "志垂日月"
	RWTFLB[55] = "大器晚成"
	RWTFLB[56] = "奇门遁甲"
	RWTFLB[58] = "逆流勇进"
	RWTFLB[59] = "一片冰心"
	RWTFLB[60] = "倒行逆施"
	RWTFLB[63] = "外和内刚"
	RWTFLB[64] = "返璞归真"
	RWTFLB[73] = "琴铮盈盈"
	RWTFLB[74] = "巾帼之才"
	RWTFLB[76] = "武中无相"
	RWTFLB[77] = "珠联璧合"
	RWTFLB[80] = "勇猛精进"
	RWTFLB[83] = "纤纤铁手"
	RWTFLB[84] = "龙象之姿"
	RWTFLB[92] = "指挥若定"
	RWTFLB[97] = "借刀杀人"
	RWTFLB[102] = "双树枯荣"
	RWTFLB[112] = "天威奋烈"
	RWTFLB[116] = "北冥极渊"
	RWTFLB[117] = "转瞬红颜"
	RWTFLB[118] = "无相转身"
	RWTFLB[129] = "仙风道骨"	
	RWTFLB[153] = "千臂如来"
	RWTFLB[456] = "暴怒河豚"
	RWTFLB[457] = "剑邪"        --点点
	RWTFLB[458] = "入木三分"
	RWTFLB[520] = "青衣神剑"
	RWTFLB[529] = "幻梦星辰"
	RWTFLB[553] = "赤胆忠魂"
	RWTFLB[565] = "十里坡剑神"	--卓不凡
	RWTFLB[589] = "似水柔情"	--水笙
	RWTFLB[590] = "心秀天铃"		--李文秀
	RWTFLB[592] = "料敌先机"	--独孤求败
	RWTFLB[595] = "一龙一象"	--宝象
	RWTFLB[601] = "机敏无双"	--韦小宝
	RWTFLB[605] = "惊才绝艳"	--林朝英
	RWTFLB[606] = "踏沙无痕"	--阿凡提
	RWTFLB[609] = "机智多谋"	--赵敏
	RWTFLB[631] = "秀若芝兰"	--周芷若
	RWTFLB[642] = "亿万小时"	--四大山
	RWTFLB[636] = "侠客行"	    --李白	
	RWTFLB[652] = "惊天一剑"	--萧秋水
	RWTFLB[635] = "天机神算"	--梁萧
	RWTFLB[497] = "补天劫奴"	--陆渐
	RWTFLB[498] = "惊才绝艳"	--李寻欢	
	RWTFLB[638] = "氤氲紫气"	--斗酒僧
	RWTFLB[640] = "翩若惊鸿"	--黄衫女		
	RWTFLB[189] = "仁者无敌"	--萧半和	
	RWTFLB[633] = "刀剑归真"	--胡一刀	
	RWTFLB[500] = "剑道化身"	--西门吹雪	
	RWTFLB[588] = "过目不忘"	--冯蘅
	RWTFLB[586] = "何足道哉"	--何足道	
	RWTFLB[584] = "麒麟臂"	    --
	RWTFLB[569] = "沅芷澧兰"	--
	RWTFLB[639] = "意假情真"	--	
	RWTFLB[744] = "神州三绝"	--	
	RWTFLB[745] = "神州三绝"	--	
	RWTFLB[754] = "黑道第一美人"	--	
   RWTFLB[759] = "风天传人"	--
	RWTFLB[760] = "人伦枪帝"	-- 	
	RWTFLB[763] = "顾影自怜"	-- 
	RWTFLB[526] = "飘渺神剑"
	RWTFLB[517] = "幻光凭虚"
	RWTFLB[750] = "精益求精"	
	
		
    CC.MP = {
	{"星宿派", nil, 1, "毒鼎"},--1
	{"丐帮", nil, 1, "乞儿"},--2
	{"古墓派", nil, 1, "清心"},--3
	{"武当派", nil, 1, "侠义"},--4
	{"少林寺", nil, 1, "转轮"},--5
	{"密宗", nil, 1, "蛮夷"},	--6
	{"逍遥派", nil, 1, "自在"},--7
	{"白驼山", nil, 1, "奇毒"}, --8武骧金星：开放白驼山
	{"唐门", nil, 1, "诡道"}, --9武骧金星：开放唐门
	{"桃花岛", nil, 1, "遁甲"}, --10沼跃鱼：开放桃花岛
    {"一刀流", nil, 1, "破敌"}, --11豸苗：开放一刀流	
	{"日月神教", nil, 1, "不败"}, --12豸苗：开放日月神教
    {"明教", nil, 1, "焚影"}, --13沼跃鱼：开放明教
	{"五岳剑派", nil, 1, "正气"},--14沼跃鱼：开放五岳剑派
	{"大理", nil, 1, "皇龙"},--15沼跃鱼：开放大理
	{"全真教", nil, 1, "长生"},--16沼跃鱼：开放全真
	{"峨眉派", nil, 1, "金顶"},--17竹风雨滴：开放峨眉派
	{"崆峒派", nil, 1, "迥异"},--18竹风雨滴：开放崆峒派
	{"昆仑派", nil, 1, "玉虚"},--19竹风雨滴＆tony：开放昆仑派
	{"雪羽宗", nil, 1, "风雪"},--20竹风雨滴＆tony：开放昆仑派
	{"花涧派", nil, 1, "风流"},--21竹风雨滴＆tony：开放昆仑派
	{"中华阁", nil, 1, "饮宴"},--22竹风雨滴＆tony：开放中华阁
	{"背嵬军", nil, 1, "壮怀"},--23观止：开放背嵬军
	{"夜雨楼", nil, 1, "血雨"},--24托尼：开放夜雨楼
	{"护龙山庄", nil, 1, "情报"},--25竹风雨滴：开放护龙山庄
	{"云梦涧", nil, 1, "万花"},--26竹风雨滴：云梦涧
	{"兽王庄", nil, 1, "兽尊"},--27观止：开放兽王庄
	{"青城派", nil, 1, "龙虎"},--28竹风雨滴：青城派
	{"五毒教", nil, 1, "五圣"},--29竹风雨滴：五毒教
	{"天机宫", nil, 1, "天机"},--30竹风雨滴：天机宫
	
}

CC.MPAttrib = { --1攻2防3轻，4医5毒6解7暗，8命9内，10 11 12 13四系
	--[0] = {0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0},
	--攻，防，轻，医，毒，解，暗，命，内，四系，四系，四系，四系
	{0.95, 0.95, 1.1, 50, 50, 50, 50, 1, 0.9, 0, 0, 0, 0}, --星宿1
	{1.1, 1, 0.95, 0, 0, 0, 0, 1.1, 0.9, 0, 0, 0, 0}, --丐帮2
	{0.9, 0.9, 1.2, 0, 0, 0, 60, 1, 1, 0, 0, 0, 0}, --古墓3
	{1.05, 1.05, 1.05, 0, 0, 0, 0, 1.1, 1, 0, 0, 0, 0}, --武当4
	{1, 1.1, 0.9, 0, 0, 0, 0, 1, 1.05, 0, 0, 0, 0}, --少林5
	{1.2, 0.9, 1, 0, 0, 0, 0, 0.95, 1.15, 0, 0, 0, 0}, --血刀6
	{0.9, 1, 1.1, 50, 0, 0, 0, 0.9, 1.15, 0, 0, 0, 0}, --逍遥7
	{1, 0.9, 1, 0, 100, 100, 0, 1.05, 1, 0, 0, 0, 0}, --白驼8
	{1, 1, 1, 0, 100, 100, 100, 0.9, 1, 0, 0, 0, 0}, --唐门9
	{0.9, 1, 1.3, 0, 0, 0, 0, 1, 1.1, 0, 0, 0, 0}, --桃花岛10
	{1.2, 0.9, 1.1, 0, 0, 0, 0, 1.05, 1, 0, 0, 0, 0}, --一刀流11
	{1.2, 0.9, 1.2, 0, 0, 0, 100, 1.05, 1, 0, 0, 0, 0}, --日月12
	{0.95, 1.2, 1, 50, 0, 0, 0, 1.1, 1.2, 0, 0, 0, 0}, --明教13
	{1.2, 0.9, 1.1, 0, 0, 0, 0, 1.05, 1.2, 0, 0, 0, 0}, --五岳剑派14
	{1, 1.1, 1.0, 50, 0, 0, 0, 1, 1.2, 0, 0, 0, 0}, --大理15
	{1.05, 1.05, 1.0, 50, 0, 0, 0, 1.1, 1.1, 0, 0, 0, 0}, --全真16
	{1.15, 1.15, 1.15, 100, 100, 100, 0, 1, 1, 0, 0, 0, 0}, --峨眉17
	{1.2, 0.9, 1.0, 0, 0, 0, 0, 1.2, 1, 0, 0, 0, 0}, --崆峒18
	{0.9, 1.2, 1.1, 200, 0, 0, 0, 1, 1.1, 0, 1, 1, 0}, --昆仑19
	{1, 1, 1.2, 0, 0, 100, 0, 1.1, 1, 0, 0, 0, 0}, --雪羽宗20
	{1.1, 1.1, 1.2, 0, 0, 0, 0, 1.1, 1.1, 0, 0, 0, 0}, --花涧派21
	{0.8, 1, 1.3, 0, 0, 0, 0, 1.1, 1.1, 0, 0, 0, 0}, --中华阁22
	{1.05, 1.05, 1.05, 0, 0, 0, 0, 1.05, 0.95, 0, 0, 0, 0}, --背嵬军23
	{1.5, 0.85, 1.3, 0, 0, 0, 200, 0.9, 1, 0, 0, 0, 0}, --夜雨楼24
	{1.2, 0.9, 1.15, 0, 0, 0, 100, 0.95, 1, 1, 1, 1, 0}, --护龙山庄25
	{0.95, 0.9, 1.2, 0, 0, 0, 300, 0.95, 1, 1, 1, 1, 0}, --云梦涧26
	{0.95, 0.9, 1.2, 0, 0, 0, 300, 0.95, 1, 1, 1, 1, 0}, --兽王庄27
	{0.85, 0.9, 1, 100, 0, 0, 0, 1.1, 1.2, 0, 0, 0, 0}, --青城派28
	{0.95, 0.95, 1.1, 100, 100, 100, 100, 0.9, 1.2, 0, 0, 0, 1}, --五毒教29
	{1.1, 0.9, 1.05, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0}, --天机宫30
}

CC.MPAttrib_none = {0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0}

CC.MPINFO = {
	"星宿老仙丁春秋叛出逍遥派后所创。武学以毒为主，让人防不胜防。派中秘传化功大法，源自北冥神功，可化人内力于无形。门下弟子也许不算最强，但绝对最让人胆寒。", 
	"天下第一大帮，凡是叫花子皆属丐帮，除强济弱，重诺守信。嫡传武学打狗棒法千变万化，降龙十八掌刚猛无双。帮中弟子武功博杂不一，以肩负的布袋数量多寡定其辈分高低。",
	"奇女子林朝英与全真祖师王重阳穷尽一生纠缠始终有缘无份。在古墓郁郁而终，叹芳踪孤寂，红颜凋残。武学上剑走偏锋，以快打慢。讲究十二多，十二少，内家养生有术。",
	"一代奇人张三丰在武当山上开宗立派，讲究以静制动，以柔克刚，以短胜长，以慢击快、以意运气，以气运身。武当武学进展缓慢，属万日有成。重于防守，急功进躁乃大忌。",
	"俗话说天下武功出少林，百年基业并非浪得虚名。自达摩祖师以降，历代高僧频出，七十二项绝技名动江湖。武学上攻守兼备，有降龙伏虎之威。传闻寺内有隐藏的绝世高手。",
	"西域密宗，地处边疆，担任各国护国神教，因西域资源匮乏，故座下修炼多以恶劣环境自行磨砺，同时对中原门派敌视甚深，其中以大轮寺与金轮寺为代表，但也有血刀门之类的邪派。",
	"武林中鲜为人知的门派，门下弟子无不面目俊朗，资质聪慧。武学讲究轻灵飘逸、闲雅清隽，威力无穷，得一则能所向披靡。但其内功运行与常道相悖，练之需先散尽原来真气。",
	"五绝之一西毒欧阳锋所创立的门派，位于西域双旗镇北。门人擅长驯养毒蛇，能驱蛇为阵，武功阴险毒辣。独门绝学逆练神功能使经脉倒逆，怪招迭出，疯癫之余却令人心惊。",
	"不知道什么时候冒出来的新兴家族式经营门派，以暗器和毒药雄踞蜀中。唐门弟子行事诡秘，遇事不按常理出牌，但善于设计、发明和使用各种暗器与毒药，威力惊人。",
	"东海黄药师所创，黄药师精通天文地理，奇门遁甲，座下弟子皆天资不凡，可惜弟子稀少，自当年叛徒黑风双煞离开，已多年未曾再收入弟子。",
	"昔日吕纯阳大弟子谢云流遭人算计被迫叛出纯阳宫远赴东瀛，自创一刀流。",
	"雄踞黑木崖，当世二大神教之一，教内教徒来自五湖四海，历任教主皆有一统江湖之志，教内绝学葵花宝典威力无穷，吸星大法可称当时第一魔功。",
	"当世二大魔教之一，相传传自西域，光明顶为明教总坛，易守难攻，教内弟子皆舍身忘死，自前任教主阳顶天失踪后，明教内部争权夺利，多名骨干离开，实力大减，但也不容小视。",
	"以五岳为基础，以日月魔教为仇敌所建立的门派。派中多以练剑为主，但各自为政，被日月魔教压制。现嵩山派正努力整合各派，反攻黑木崖。",
	"自灭南诏国之后成立的白族地方政权，以段家为主要成员与骨干，其中不乏皈依佛门的皇室成员，以一阳指与六脉神剑闻名于中原。",
	"全真教为中原第一道教，前任掌门为五绝之首王重阳，现由全真七子共掌教派。全真绝学先天功，以气为主，世间唯一可气返先天的绝世内功，教内又以天罡北斗阵闻名于世。",
	"大侠郭靖二女儿所创门派，继承郭靖遗志，保家卫国为己任。",
	"高人木灵子创立门派，与少林、武当、峨眉、昆仑并称为武林五大派。",
	"号称道门祖庭，巍峨于西疆雄峰之上。此派源远流长，虽少于中原走动，但昆仑剑法、轻功依然声名赫赫，派中奇人昆仑三圣更曾独闯少林，打下赫赫名声。可惜现今掌门却是碌碌无为。",
	"原为凤凰教三宗（金翅，银翼，雪羽）之一，第三护法杨冰羽袭杀原教主后，凤凰教覆灭，金翅、银翼两护法合攻杨冰羽欲为原教主报仇，不敌。其后三大护法各收旧部，各自立派。",
	"花间词派产生于于晚唐五代时期的前蜀，是中国古代诗词学流派之一，其名得自于后蜀赵崇祚所编词集《花间集》。《花间集》收辑温庭筠、韦庄等十八人的词作，共计500首词。",
	"位居天山脚下，隐居着一群武林中的成名前辈，或武艺高强，或身怀绝技，以匡扶正义为己任。",
	"南宋初年由岳飞领导的抗金军队，纪律严明，训练有素，金人有“撼山易，撼岳家军难”之语。",
	"在短短数月间恶名滔天的杀手组织，手段残忍，惯于在目标居所门前留下绝句诗。四天后，夜雨倾盆，徒留诗句见证了满门血洗的凶威。",
	"皇族成立的情报机构，以收集朝廷文武百官的隐私、情报为主，以防以下犯上撼动皇权。",
	"盘踞于避暑山庄上的新势力，庄内皆为女性，由黑道第一美人创立，被誉为女人的乐园，男人的地狱。",
	"兽王庄是隐世百年的家族，又称万兽山庄，庄中弟子大部分都是庄主收留的孤儿，从小与万兽作伴，能将各个动物的形意融入拳法掌法刀法之中，融会贯通，还能将和自己心性相通的动物的特殊能力，短时间内借为己用。",
	"东汉张天师入川修道所创宗派，以炼气修丹为主，外功为辅。分别与武当派、全真派、崆峒派、昆仑派、峨眉派合称道门六闲。",
	"地处苗疆五毒岭，是个神秘而恐怖的组织。教内众人信奉的原则是利益决定敌友，只要有利可图，就可以为人所用，不管是非、对错、正邪。",
	"位于栖月谷内，为术数大家所建，宫内典籍无所不包，浩如烟海。其目的是保护历朝历代所遗传下来的文化遗产，以守护典籍为己任。",
	}

CC.MPINFO2 = {
	"攻击防御减5%，轻功加10％，医疗用毒解毒暗器能力加50，内力上限减10％",
	"攻击加10％，轻功减5%，生命上限加10％，内力上限减10％",
	"攻击防御减10％，轻功加20％，暗器能力加60",
	"攻击防御轻功加5%，生命上限加10％",
	"防御加10％，轻功减10％，内力上限加5%",
	"攻击加20％，防御减10％，生命上限减5％，内力上限加15％",	
	"攻击减10％，轻功加10％，医疗能力加50，生命上限减10％，内力上限加15％",	
	"防御减10％，用毒解毒能力加100,  生命上限加5%",
	"用毒解毒暗器能力加100,  生命上限减10％",
	"攻击减10％，轻功加30％，内力上限加10％",	
	"攻击加20％，防御减10％，轻功加10％，生命上限加5％",
	"攻击加20％，防御减10％，轻功加20％，暗器能力加100，生命上限加5％",
	"攻击减5%，防御加20％，医疗能力加50，生命上限加10％，内力上限加20％",
	"攻击加20％，防御减10％，轻功加10％，生命上限加5％，内力上限加20％",
	"防御加10％，医疗能力加50，内力上限加20％",
	"攻击加5％，防御加5％，生命上限加10％，内力上限加10％",
	"攻击、防御、轻功加15％，医疗用毒解毒能力加100",
	"攻击加20％，防御减10％，生命上限加20％",
	"防御加20％，轻功加10％，内力上限加10％，医疗能力增加200",
	"轻功加20％，生命上限加10％，解毒能力加100",
	"攻击加10％，防御加10％，轻功加20％，生命上限加10％，内力上限加10％",
	"攻击减20％，防御加10％，轻功加30％",
	"攻击加5％，防御加5％，轻功加5％，生命上限加5％，内力上限减5％",
	"攻击加10％，防御减10％，轻功加10％，暗器能力加200",
	"攻击加20％，防御减10％，轻功加15％，暗器能力加100",
	"攻击减5％，防御减10％，轻功加20％，暗器能力加300，内力上限减5％",
	"攻击加10％，防御加10％，轻功加10％，生命上限加10％，内力上限加10％",
	"攻击减15％，防御减10％，生命上限加10％，内力上限加20％，医疗能力增加100",
	"攻击减5％，防御减5％，用毒、医疗能力增加100",
	"攻击加10％，防御减10％，轻功加5％",
}

CC.MPDJ = {
	{"入门弟子", "高级弟子", "掌门"},--星宿1
	{"五袋弟子", "八袋弟子", "长老", "帮主"},--丐帮2
	{"入门弟子", "高级弟子", "掌门"},--古墓3
	{"入门弟子", "普通弟子", "高级弟子", "亲传弟子", "掌门"},--武当4
	{"入门弟子", "普通弟子", "高级弟子", "掌院", "方丈"},--少林5
	{"喇嘛", "僧正", "法王"},--密宗6
	{"入门弟子", "正式弟子", "长老", "掌门", "祖师"}, --逍遥7
	{"弟子", "少主", "庄主"},--白驼8
	{"入门弟子", "内门弟子", "长老", "堡主"},--唐门9
    {"记名弟子", "入室弟子", "岛主"},--桃花岛10
	{"入门弟子", "正式弟子", "宗主"},--一刀流11
	{"教众", "护法", "长老", "副教主", "教主"},--日月12
	{"普通弟子", "核心弟子", "四大法王", "光明使者", "教主"},--明教13
	{"普通弟子", "亲传弟子", "长老", "掌门", "盟主","真传盟主"},--五岳剑派14
	{"侍卫", "贵族", "皇族", "高僧"},--大理15
	{"四代弟子", "三代弟子", "二代弟子", "太上长老", "掌教"}, --全真16
	{"弟子", "掌门", "使者", "祖师"}, --峨眉17
	{"入门弟子", "内门弟子", "堂主", "长老", "掌派"}, --崆峒18
	{"普通弟子", "峰主", "掌门", "前代掌门", "太上长老"}, --昆仑19
	{"试炼弟子", "羽卫", "羽长", "宗主"}, --雪羽宗20
	{"如烟", "如雾", "如尘", "花涧掌门"}, --花涧派21
	{"跑堂", "厨子", "账房", "掌柜","老板"}, --中华阁22
	{"兵卒", "百长", "翎卫", "将军","元帅"}, --朝廷23
	{"青衣杀手", "赭衫杀手", "玄袍杀手", "副楼主","楼主"}, --夜雨楼24
	{"侍卫", "档头", "密探", "军师", "庄主"}, --护龙山庄25
	{"佳人", "名珠", "仙子", "仙姬"}, --云梦涧26
	{"万兽学徒", "万兽教头", "万兽尊者", "万兽之主"}, --兽王庄27
	{"弟子", "道长", "掌门", "天师"}, --青城派28
	{"弟子", "护法", "长老", "副教主","教主"}, --五毒教29
	{"弟子", "堂主", "长老", "宫主"}, --天机宫30
}

CC.PSKILL = {
	{"以身饲毒", "毒心血脉", "淬毒"},
	{"妙手", "污衣", "打狗棍阵"},
	{"玉蜂针", "寒玉", "素心"},
	{"乾坤", "八卦", "无极"},
	{"金钟罩", "铁布衫", "袈裟伏魔"},
	{"铁臂", "钢躯", "神威"},	
	{"北冥", "无相", "白虹"},
	{"玄蛇", "玉蟾", "逆运"},
	{"自动防御", "模式切换", "灵犀七打", "千魂弄巧"}, --武骧金星：取消暗器回收
	{"落英", "怒涛", "通晓"},
	{"致命", "切返", "居合"}, --武骧金星：暂定
	{"雄锋", "霸道", "魔威"}, --武骧金星：暂定
	{"焚躯", "天佑", "同袍"},--武骧金星：暂定
    {"剑宗", "浩然", "剑意"},--武骧金星：暂定
    {"阳炎", "铁指寸劲", "气疗"},--武骧金星：暂定
	{"七星", "金雁", "长生"},
	{"动静", "太虚", "普度"},
	{"飞鸿印雪", "冰魂雪魄", "傲雪凌霜"},
	{"雾里看花", "落叶知秋", "闭月羞花"},
	{"健步如飞", "山珍海味", "金玉满堂"},
	{"金戈", "铁马", "满江红"}, --朝廷
	{"无明夜","飘零雨","血满楼"},
	{"天地玄黄","日月盈昃","寒来暑往"},
	{"紫竹","莲花","牡丹"},
	{"虎痴","鹰翔","游龙"},
	{"演化","归一","虚无"},
	{"金蟾","木蛛","水蝎"},
	{"天地","日月","星辰"},
	--{"上清", "合离", "颠倒"}
}

CC.ASKILL = {
	{"口蜜腹剑", "三笑逍遥散"},
	{"锁喉擒拿手", "莲花落", "醉八仙"},
	{"道玄通曲", "巧笑倩兮"},
	{"以柔克刚", "以静制动"},
	{"点化", "金刚不坏体", "佛门狮子吼"},
	{"金刚乘", "无想转生"},	
	{"无争", "凌波", "真·白虹"},	
	{"集毒", "蟾息"},	
	{"满天花雨", "千机"},	
	{"九花玉露", "碧海幻境"},
    {"秘剑·切返", "斩流·切返"},	
	{"三尸脑神丹", "逆杀"}, --武骧金星：暂定
	{"以身殉教", "光明裁决"},--武骧金星：暂定
    {"连环三仙剑", "冰封天地"},--武骧金星：暂定
    {"秘孔战术", "转龙呼吸"},--武骧金星：暂定
	{"重阳遗剑", "气返先天"},
	{"南明离火", "三阳归一"},
    {"分光两仪", "九天都录"},
	{"微尘阵", "大静神"},
	{"雪漫天地", "雪落无声"},
	{"花开见佛", "飞花逐蝶"},
	{"苦尽甘来", "运筹帷幄"},
	{"不屈", "续战"},
	{"夜雨满秋池", "断命四绝句"},
	{"丹书铁券", "尚方宝剑"},
	{"魔岭玫瑰", "曼陀妖姬"},
	{"驭兽妙法","兽血沸腾","八荒兽形"},
	{"虎辟", "龙棘"},
	{"火蜈", "土蛇"},
	{"天地之变", "日月之行"},
}
--[[CC.ZCMP = {
	{CONFIG.WoMPName,nil,1},
	{1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0}, --
	'由小村传人自创的门派，武道极强',
	'全能力衡平，无特别加成',
	{'普通弟子','内门弟子','执事','副掌门','掌门'},
	{},--CC.PSKILL
	{},--CC.SKILLNAME
	
	
}]]
CC.SKILLNAME = {
	{"以身饲毒", "毒心血脉", "淬毒", "口蜜腹剑", "三笑逍遥散"},
	{"妙手", "污衣", "打狗棍阵", "锁喉擒拿手", "莲花落", "醉八仙"},
	{"玉蜂针", "寒玉", "素心", "道玄通曲", "巧笑倩兮"},
	{"乾坤", "八卦", "无极", "以柔克刚", "以静制动"},
	{"金钟罩", "铁布衫", "袈裟伏魔", "点化", "金刚不坏体", "佛门狮子吼"},
	{"铁臂", "钢躯", "神威", "金刚乘", "无想转生"},
	{"北冥", "无相", "白虹", "无争", "凌波", "真·白虹"},
	{"玄蛇", "玉蟾", "逆运", "集毒", "蟾息"},
	{"满天花雨", "千机", "灵犀七打", "千魂弄巧"}, --武骧金星：取消暗器回收
	{"落英", "怒涛", "通晓", "九花玉露", "碧海幻境"},
    {"致命", "切返", "居合", "秘剑·切返", "斩流·切返"},	
	{"雄锋", "霸道", "魔威", "三尸脑神丹", "逆杀"},
    {"焚躯", "天佑", "同袍", "以身殉教", "光明裁决"},
	{"剑宗", "浩然", "剑意", "连环三仙剑", "冰封天地"},	
	{"阳炎", "铁指寸劲", "气疗", "秘孔战术", "转龙呼吸"},	
	{"七星", "金雁", "长生", "重阳遗剑", "气返先天"},
	{"动静", "太虚", "普度", "南明离火", "三阳归一"},
	{"上清", "合离", "颠倒", "分光两仪", "九天都录"},
	{"法自然", "道祖庭", "巍峨身", "微尘阵", "大静神"},
	{"飞鸿印雪", "冰魂雪魄", "傲雪凌霜","雪漫天地", "雪落无声"},
	{"雾里看花", "红花天梦", "闭月羞花","花开见佛", "飞花逐蝶"},
	{"健步如飞", "山珍海味", "金玉满堂","苦尽甘来", "运筹帷幄", "中华傲诀", "镜花水月", "踏雪无痕", "偷天换日"},
	{"金戈", "铁马", "满江红","不屈", "续战"},
	{"无明夜","飘零雨","血满楼","夜雨满秋池", "断命四绝句"},
    {"天地玄黄", "日月盈昃", "寒来暑往", "丹书铁券", "尚方宝剑"},
	{"紫竹","莲花","牡丹","魔岭玫瑰", "曼陀妖姬"},
	{"虎痴","鹰翔","游龙","驭兽妙法","兽血沸腾","八荒兽形"},
	{"演化","归一","虚无","虎辟","龙棘"},
	{"金蟾","木蛛","水蝎","火蜈","土蛇"},
	{"天地","日月","星辰","天地之变","日月星辰"},
}

CC.MPMENU = {"门派介绍", "传授技能"}
CC.RMTJ = {
	
}
CC.MPSUBMENU = {
	"入门条件 :　品德 <= 30 ,用毒能力 >= 100 (星宿派招募员)", --星宿
	"入门条件 :　品德 >= 95 (丐帮招募员)", --丐帮
	"入门条件 :　品德 >= 85 , 轻功 >= 350 (古墓招募员)", --古墓
	"入门条件 :　品德 >=95，御剑能力 >= 100 ,拳掌功夫 >= 100 (武当招募员)", --武当
	"入门条件 :　品德 >= 90 (少林招募员)", --少林
	"入门条件 :　耍刀技巧 >= 150,内力最大值 >= 4500 (河络客栈招募员)", --密宗
	"入门条件 :　品德 >= 85 (擂鼓山招募员)", --逍遥
	"入门条件 :　用毒能力 >= 100,内力最大值 >= 3500 (高升客栈招募员)", --白驼
	"入门条件 :　品德 >= 85", --唐门
	"入门条件 :　资质 >= 80,御剑能力 >= 80 ,拳掌功夫 >= 80 , 指法技巧 >= 80 (桃花岛招募员)", --桃花岛
	"入门条件 :　品德 >= 85", --一刀流
	"入门条件 :　品德 <= 30,内力值 >= 4500 (日月神教招募员)", --日月
	"入门条件 :　耍刀技巧 >= 200 ,内力最大值 >= 4000 (明教招募员)", --明教
	"入门条件 :　御剑能力 > 150 ,品德 >= 70 (嵩山招募员)", --五岳剑派
	"入门条件 :　指法技巧 >=100, 内力最大值>=5000 (天龙寺招募员)", --大理
	"入门条件 :　品德 >= 80 , 内力最大值 >= 5000 (全真招募员)", --全真
	"入门条件 :　品德 >= 85 (峨眉招募员)", --峨眉
	"入门条件 :　拳掌功夫 >= 200 ,内力最大值 >= 5000 (崆峒招募员)", --崆峒
	"入门条件 :　御剑能力 >= 200 , 内力最大值 >= 5000 (昆仑招募员)", --昆仑
	"入门条件 :　道德 >= 80 轻功 >= 350 (雪羽宗杨冰羽)", --雪羽宗
	"入门条件 :　资质 >= 31 轻功 >= 350 * ,20000大洋,而且为女性 (盛京风流和尚)", --花涧派入门条件: 资质 >= 31 * ,20000大洋,而且为女性
	"入门条件 :　品德 >= 85",--中华阁
	"入门条件 :　实战 >= 50,三围之和大于800",--背嵬军
	"入门条件 :  品德 <= 5",
	"入门条件 :  拳掌功夫 >= 150,指法技巧 >= 150,御剑能力 >= 150,耍刀技巧 >= 150,特殊兵器能力 >= 150",
	"入门条件 :  女性，轻功 >= 500,特殊兵器能力 >= 200",
	"入门条件 :  实战 >= 100,拳掌功夫 >= 200,耍刀技巧 >= 200", --兽王庄
	"入门条件 :  实战 >= 60,御剑能力 >= 100,拳掌功夫 >= 100,内力最大值 >= 3500", --青城派
	"入门条件 :  实战 >= 50,用毒能力 >= 100", --五毒教
	"入门条件 :  拳掌功夫 >= 200,御剑能力 >= 200,耍刀技巧 >= 200,", --天机宫
}

CC.SKILLINFO = {
	{--星宿
	"效果：被攻击时自身中毒程度增加，中毒越深集气速度越快条件：被动技能",
	"效果：攻击时自身中毒加基础伤害被攻击时自身中毒减基础伤害*条件：被动技能",
	"效果：攻击时几率追加伤害，伤害值与自身和目标的中毒程度有关*条件：被动技能",
	"效果：一定几率周围四格敌人怒气值清零且中毒程度增加*消耗：体力20点",
	"效果：一定几率周围三格内普通小兵三次行动后即死*消耗：体力20点内力200点"
	},
	{--丐帮
	"效果：攻击时高几率窃取敌人物品一件条件：被动技能",
	"效果：增加50-150的伤害条件：被动技能",
	"效果：增加集气速度+10条件：被动技能",
	"效果：自身和周围一格内敌人停止集气五十时序，免疫杀气消耗：体力15点",
	"效果：自身和周围一格内己方内伤清零消耗：体力30点",
	"效果：自身八次行动内攻击和防御加倍，免疫杀气，内力消耗加倍条件：包里有酒消耗：体力15点",
	},
	{--古墓
	"效果：被攻击后几率反击条件：被动技能",
	"效果：攻击时30%概率附加冰封和灼烧条件：被动技能",
	"效果：攻击附加气攻1200点条件：被动技能",
	"效果：场上所有人物怒气减半消耗：体力20点",
	"效果：几率使任意目标敌人叛变一定时序消耗：体力25点",
	},	
	{--武当
	"效果：被攻击时伤害减低15%条件：被动技能",
	"效果：被攻击时存储伤害值，下次攻击时追加伤害，最多存储800条件：被动技能",
	"效果：被攻击时减30-100点伤害条件：被动技能，门派等级2以上",
	"效果：自身怒气清零，目标敌人怒气减半且一定时序内集气速减半消耗：体力25点",
	"效果：立刻进入防御状态无法行动，免疫杀气，一定时序后集气全满，攻击时把自身的异常状态加诸于敌人身上，自身状态全清，攻击效果双倍消耗：体力20点内力500点",
	},		
	{--少林
	"效果：被攻击时几率进入防御状态条件：被动技能",
	"效果：防御值增加80-150点条件：被动技能",
	"效果：攻击50%概率附加灼烧越高条件：被动技能",
	"效果：低几率使任意目标敌人退出战场，几率与自身品德有关条件：品德50以上，敌方非少林寺、血量低于1/2消耗：体力25点",
	"效果：一定时序内以内力代替伤害，停止集气条件：保持内力1000点以上*消耗：体力20点内力200点",
	"效果：全体敌人如果内力小于自身则集气槽后退，效果与现有内力成正比条件：内力3000点以上消耗：体力30点与现有内力值的一半",
	},			
	{--血刀
	"效果：攻击额外增加伤害暴击、蓄力攻击伤害增加效果随等级提高增加条件：被动技能",
	"效果：减少受到的伤害50-120点条件：被动技能",
	"效果：蓄力满后大幅杀集气效果附加混乱效果条件：被动技能，僧正以上发动效果",
	"效果：怒气持续爆发条件：保持生命为生命最大值的一半以上消耗：体力15点，每时序减5点血 备注：爆发状态中回血武功失效",--*
	"效果：按现有生命与最大生命值的百分比值与任意敌人交换血量；一场战斗限一次条件：生命超过生命最大值的一半消耗：体力25点",
	},			
	{--逍遥
	"效果：被攻击时24%几率发闪避条件：被动技能",
	"效果：攻击时无视敌我兵器值系数差伤害增加；被攻击时无视敌我兵器值系数差伤害减少条件：被动技能",
	"效果：攻击附加3-5冻结效果条件：被动技能",
	"效果：场上所有人物下次行动无法进行攻击消耗：体力15点内力300点",
	"效果：接下来受到的三次攻击中可以预先进行移动避开消耗：体力20点",
	"效果：战斗场景，无障碍移动消耗：体力10点",
	},	
	{--白驼
	"效果：攻击时无视毒抗上毒，并机率上剧毒条件：被动技能",
	"效果：蛤蟆功储气效率上升，蟾震九天增幅气攻、伤害*条件：被动技能",
	"效果：被攻击时机率免疫封穴条件：被动技能",
	"效果：使用后己方全体中毒清零，下次攻击额外增加伤害消耗：体力30点内力300点",
	"效果：使用后进行蓄力和防御，效果上升消耗：体力20点",
	},		
	{--唐门
	--"效果：战场上几率得到随机暗器*条件：被动技能", 武骧金星：取消暗器回收
	"效果：对自身十格内敌人随机使用暗器攻击十次条件：体力50以上内力5000以上消耗：体力25点内力1000点", --，消耗暗器一个
	"效果：惊羽决与天罗诡道来回切换条件：被动技能", --暗器能力提升三点*      
	"效果：攻击时几率封穴及流血实战越高几率越高条件：被动技能",
	"效果：使用暗器致死时可控制敌方一定时序后敌方自动死亡，实战越高控制时序越长条件：被动技能，体力50以上每控制一人体力减5",
	 --*      暗器十个
	--"效果：切换攻击方式*消耗 暗器十个", --*      暗器十个
	},		
	{--桃花岛
	"效果：发动桃花绝技效果可同时触发，不需学全增加集气速度效果随等级提高与碧海潮声曲增加条件：被动技能",
	"效果：第一击可发动真传·碧海怒涛效果随等级提高与碧海潮生曲增加条件：被动技能",
	"效果：可以切换1格子武学为桃花三绝：主动技能",
	"效果：使用后己方全体内伤清零下次被攻击额外减少伤害消耗：体力30点内力300点",
	"效果：接下来受到的三次攻击中可完全闪避消耗：体力20点",
	},
	{--一刀流
	--"效果：暂定"
	"效果：攻击伤害必定增加50%，几率增加100%几率随门派等级提升条件：被动技能", 
	"效果：被攻击几率打断目标攻击，且自身下回合连击次数增加一次，最多增加三次几率随门派等级提升条件：被动技能",     
	"效果：攻击时无视目标一部分防御效果每级无视6%的所有防御效果条件：被动技能",
	"效果：四个回合内必定发动秘剑·切返消耗：体力15点",
	"效果：四个回合内必定至少三连击且几率增加连击次数，最高连击次数六次消耗：体力20点",
	},	
	{--日月
	--"效果：暂定"
	"效果：攻击时附加盲目状态,敌人20%概率攻击无效条件：被动技能", 
	"效果：提高暴击率，连击率，连击伤害随门派等级提升而提升条件：被动技能",     
	"效果：提高吸星大法效果；被攻击时30%开启星吸护盾吸收伤害*条件：被动技能，护法等级以上生效",
	"效果：每场战斗限用一次，目标100时序内暴怒敌我不分，时序结束后死亡消耗：体力25点",
	"效果：自身4格范围敌方50时序内持续掉血，掉血量增加且无法恢复无法造成杀气消耗：体力25点",
	},
	{--明教
	--"效果：暂定", 武骧金星：取消暗器回收
	"效果：被攻击时机率使敌人减少生命并造成灼烧和内伤效果随等级提高与光明裁决而增加条件：被动技能",
	"效果：攻击效果随四系系数增加而提高防御效果随现有内力变化而变化*条件：被动技能",
	"效果：每回合开始30%清除不良状态条件：被动技能，弟子以上发动效果",
	"效果：暴怒时以全身内力攻击敌人使用后自身奄奄一息消耗：体力50点",
	"效果：标定一个敌人为异教徒己方攻击时有伤害加成与生命收益全局可标定十次消耗：体力25点内力500点",
	},
    {--五岳剑派
	"效果：用剑法伤害增加，攻击后增加回气，效果随门派等级增加条件：被动技能",
	"效果：被连击时伤害降低。效果随等级提高增加条件：被动技能",
	"效果：不需学满也能使用五岳剑法可以同时触发条件：被动技能，核心弟子以上发动效果",
	"效果：本次攻击必然三连击消耗：体力30点内力1000点",
	"效果：本次攻击必然全屏攻击并且造成所有敌方寒冰消耗：体力25点内力1500点",
	},
	{--大理
	"效果：攻击时根据内力强上灼烧条件：被动技能",
	"效果：攻击气攻效果随拳系指数升高效果随等级提高增加条件：被动技能",
	"效果：被攻击24%概率闪避一次条件：被动技能",
	"效果：本次攻击附加特殊点穴效果低几率致死攻击消耗：体力30点内力1000点",
	"效果：使用后100时序内被攻击机率转为治疗效果，一灯有隐藏特效消耗：体力25点内力1500点",
	},
	{--全真
	"效果：多于一名人组成天罡北斗阵气攻气防与闪避几率上升效果随等级提高增加条件：被动技能",
	"效果：内力提高集气速度提高移动距离效果随等级提高增加条件：被动技能",
	"效果：时序恢复生命并清除内伤被攻击后恢复生命条件：被动技能",
	"效果：将内力灌注于伤害与气攻中发出强烈一击攻击者防御力与气防消失消耗：体力30点内力1000点",
	"效果：通过内力转换将自己的生命恢复到最大值清除所有队友的内伤消耗：体力25点",
	},
	{--峨眉
	"效果：攻击伤害增加；条件：被动技能",
	"效果：攻击次数增加条件：被动技能",
	"效果：被攻击几率闪避条件：被动技能",
	"效果：当前1/2内力值让全体敌人集气后退*消耗：体力20点",
	"效果：我方队友内伤清零*消耗：体力20点",
	},
	{--崆峒
	"效果：攻击伤害随系数增加*条件：被动技能",
	"效果：系数增高，自身受到伤害降低*条件：被动技能",
	"效果：攻击值几率追加伤害*条件：被动技能",
	"效果：将自身拳系、内力加成伤害攻击敌人*消耗：体力20点内力2000点",
	"效果：消耗自身内力、体力抵挡伤害*消耗：体力20点内力2000点",
	},
	{--昆仑
	"效果：攻击伤害增加100-200点*条件：被动技能",
	"效果：回合结束后机率回复部分生命，上限3000点*条件：被动技能",
	"效果：被攻击时,15%概率免伤一次（真实伤害无法免除）*条件：被动技能",
	"效果：直接展开「两仪微尘阵」一定时序*消耗：体力20点内力2500点",
	"效果：一定时序享受「随遇而安」印信效果*消耗：内力1000点战意10点",
	},
	{--雪羽宗
	"效果：移动力+2，攻击后可移动（格数为移动4）*条件：被动技能",
	"效果：战场轻功二倍，集气速度上限突破为99*条件：被动技能",
	"效果：根据怒气值增加伤害（怒气/200）%*条件：被动技能",
	"效果：本次攻击附加全屏冻结10时序*消耗：消耗2000内力20体力",
	"效果：解除自身负面状态，获得霸体一回合*消耗：消耗3000内力30体力",
	},
	
	{--花涧派
	"效果：攻击范围+2,附加冰封效果*条件：被动技能",
	"效果：攻击附加吸血效果*条件：被动技能",
	"效果：集气速度+5,20%概率闪避一次*条件：被动技能",
	"效果：每次行动前清除异常状态*条件：被动技能",
	"效果：武功特效+5*条件：被动技能",
	},
	
	{--中华阁
	"效果：集气增加15%*条件：被动技能",
	"效果：时序恢复生命和内力*条件：被动技能",
	"效果：战斗后可获得银两*条件：被动技能",
	"效果：消耗自身内力恢复体力*消耗：消耗1000内力",
	"效果：消耗自身内力和体力恢复生命*条件：消耗2000内力20体力",
	"效果：满战意时以全身内力攻击敌人使用后自身奄奄一息消耗：体力50点",
	"效果：制造一个分身，一切效果和本体挂钩：2000内力10体力",
	"效果：使用后可移开被攻击范围。消耗：2000内力10体力",
	"效果：指定一名队友集气1000：2500内力25体力",
	},
	{--背嵬军
	"效果：移动距离不会小于8，攻击破防30%*条件：被动技能",
	"效果：行动后获得一层“铁马连环”，被攻击时可以免疫本次伤害，上限3层*条件：被动技能",
	"效果：当生命值低于30%时，强制行动，恢复自身状态，并为敌人附加“威慑”。（一场只能触发一次，需要门派等级4）*条件：被动技能",
	"效果：使用后进入战意爆发状态一回合*消耗：消耗1000内力10体力",
	"效果：使用后自身20时序内免疫基础异常，时序恢复受损生命内力*条件：消耗1000内力10体力",
	},
	{--夜雨楼
	"效果：根据门派等级决定，行动后距离敌方一定距离时，机率免疫所有伤害一定时序。条件：被动技能",
	"效果：战斗中，轻功特效无视称号限制，轻功值满即可触发主运轻功效果。条件：被动技能",
	"效果：若攻击敌方背后，则使全场敌方强制流血(仅第一击生效)、撕裂。被攻击者扣除等同于流血值的生命，条件：被动技能",
	"效果：使用后可立刻瞬移到15格内任何一处，并一定时序内进入高速回血、清除中级异常状态。消耗：2000内力10体力",
	"效果：标记一名敌人，该敌人行动四次后，损失当前血量90％。条件：命大于2000；内大于2000；体大于30。消耗：自身血量、内力、体力的80％",
	},
	{--护龙山庄
	"效果：根据五系增加攻击力。条件：被动技能",
	"效果：根据基础负面状态增加伤害。条件：被动技能",
	"效果：攻击后恢复基础负面状态。条件：被动技能",
	"效果：30时序内处于闪避状态：1500内力15体力",
	"效果：根据自身内力最大值、攻击力触发高额攻击。条件：3000内力20体力",
	},
	{--云梦涧
	"效果：根据自身特系增加攻击力。条件：被动技能",
	"效果：集气可超过上限。条件：被动技能",
	"效果：攻击时可魅惑敌人。条件：被动技能",
	"效果：使任意目标敌人叛变500时序。消耗：4000内力90体力",
	"效果：最多可制造6个幻影分身。消耗：1500内力体力15点",
	},
	{--兽王庄
	"效果：攻击时根据自身战场攻击力概率蓄力。条件：被动技能",
	"效果：行动后根据自身战场轻功值概率进入时序闪避。条件：被动技能",
	"效果：受击时根据自身战场防御值概率断连击后移动。条件：被动技能",
	"效果：召唤一头自身培养的兽王上场（暂未实装）。消耗：1000内力10体力",
	"效果：本次攻击附加消耗生命值的伤害，被反弹时不会致死。消耗：当自身生命值大于50%时可以使用，消耗自身当前血量的75％",
	"效果：根据自身状态，进入对应御兽形态（暂未实装）。消耗：2000内力10体力",
	},
	{--青城派
	"效果：根据自身现有内力增加集气速度。条件：被动技能",
	"效果：根据自身现有内力增加伤害。条件：被动技能",
	"效果：根据自身现有内力增加防御。条件：被动技能",
	"效果：15时序内无视受到任意伤害：体力20点",
	"效果：将自身内力攻击敌人集气位置*消耗：体力20点内力2000点",
	},
	{--五毒教
	"效果：攻击时附加毒伤。条件：被动技能",
	"效果：根据用毒增加伤害。条件：被动技能",
	"效果：攻击时增加时序毒伤。条件：被动技能",
	"效果：周围4格敌人中毒值100点。*消耗：体力20点",
	"效果：自身和周围1格内敌人集气紊乱20时序。*消耗：体力20点内力2000点",
	},
	{--天机宫
	"效果：攻击时根据自身拳、剑、刀系增加伤害。条件：被动技能",
	"效果：被攻击时可体现躲避伤害。条件：被动技能",
	"效果：攻击时可触发范围攻击。条件：被动技能",
	"效果：无视敌人60%防御，附加敌全体生命损失1500点。*消耗：体力20点",
	"效果：消耗4000内力转化为2000点生命，基础负面清除。*消耗：体力25点内力4000点",
	},
}

	--天赋介绍
   TFJS = {}
 	ZL = {}
	FY = {}
	BOSSZT = {}
	--拳王
	TFJS['拳'] = {"Ｄ盖世神拳",
	"Ｗ每修炼一个拳法到极，受伤害降低5%（上限7个）",
	"Ｎ",
	"Ｄ降龙极意",
	"Ｗ使用降龙十八掌，40%几率发动极意",
	"Ｎ",
	"Ｄ黯然极意",
	"Ｗ血量低于70%或内伤大于30时，使用黯然销魂掌有几率触发极意",
	"Ｗ血量越低，内伤越高，几率越高，满足条件时暴怒必定触发",
	"Ｗ触发黯然极意必定连击",
	"Ｎ",
	"Ｚ绝技：天道惊雷撼",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，拳掌系数>=120，使用拳掌武功攻击几率触发",
	"Ｗ资质越高，触发几率越高",
	"Ｗ攻击无误伤，攻击效果提升33.3%，大幅提高封穴几率，追加1200气攻",
	"Ｎ"
	}
	FY['拳'] = {"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}
	TFJS['指'] = {"Ｄ灵犀一指",
	"Ｗ每修炼一个指法武功到极，破防几率提高5%（上限7个）",
	"Ｗ使用六脉神剑的内力消耗减半",
	"Ｎ",
	"Ｚ绝技：点墨山河",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，指法系数>=120，使用指法武功攻击几率触发",
	"Ｗ资质越高，触发几率越高",
	"Ｗ攻击无误伤，不造成怒气，同时清除敌方一半怒气，追加1100气攻",
	"Ｎ"
	}
	FY['指'] = {"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}
	TFJS['剑'] = {"Ｄ剑神一笑", 
	"Ｗ每修炼一个剑法到极，集气速度+2（上限7个）",
	"Ｗ使用玄铁剑法时，有几率发动重剑真传",
	"Ｗ可无视自宫需求修炼葵花宝典、辟邪剑法",
	"Ｎ",
	"Ｚ绝技：一剑镇神州",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，御剑系数>=120，使用剑系武功攻击几率触发",
	"Ｗ资质越高，触发几率越高",
	"Ｗ攻击无误伤，锁定攻击战场上大范围敌方目标，追加1500气攻",
	"Ｎ"
	}
	FY['剑'] = {"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}
	TFJS['刀'] = {"Ｄ傲世狂刀", 
	"Ｗ每修炼一个刀法到极，伤害增加5%（上限7个）",
	"Ｗ使用胡家刀法有40%几率触发极意，暴怒必触发",
	"Ｗ使用火焰刀法和沧溟刀法时，特效触发几率追加二次判定",
	"Ｎ",
	"Ｚ绝技：羽葬煌炎斩",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，耍刀系数>=120，使用刀系武功攻击几率触发",
	"Ｗ资质越高，触发几率越高",
	"Ｗ攻击无误伤，无视绝对气防，追加1500气攻，行动后自身怒气恢复25点（可叠加）",
	"Ｎ"
	}
	FY['刀'] = {"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}
	TFJS['奇'] = {"Ｄ奇门无双", 
	"Ｗ初始自带15%闪避",
	"Ｗ每修炼一个奇门武功到极，闪避率提高5%（上限7个）",
	"Ｗ打狗棒法『天下无狗』的触发几率提高，追加二次判定",
	"Ｎ",
	"Ｚ绝技：千机龙绝闪",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，奇门系数>=120，使用奇门武功攻击几率触发",
	"Ｗ资质越高，触发几率越高",
	"Ｗ攻击无误伤，必定造成流血及封穴，追加1000气攻",
	"Ｎ"
	}
	FY['奇'] = {"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}
	TFJS['罡'] = {"Ｄ绝世天罡", 
	"Ｗ内力属性为天罡，同时拥有阴、阳、调和三种内力属性的特性",
	"Ｗ可使用内功攻击，内功可修炼至极",
	"Ｗ斗转反击时，无视兵器值需求必定发动离合参商",
	"Ｎ",
	"Ｄ天罡真气",
	"Ｗ使用内功攻击时50%几率触发天罡真气，提升气攻",
	"Ｎ",
	"Ｚ天赋内功",
	"Ｗ学会天赋内功后，进入战斗会自动运行",
	"Ｗ天赋内功不影响正常运功，即可同时运行两种内功",
	"Ｗ手动选择运功时，无法选择九阴/九阳/易筋",
	"Ｗ三神功真气只能触发天赋内功选择的",	
	"Ｎ",
	"Ｚ绝技：化气御九天",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，任意武功攻击40%几率触发————【化气御九天】：攻击无误伤，伤害提高30%，兵器值判定必定优势，无视绝对气防，追加1300气攻；",
	"Ｎ"
    }
    FY['罡'] = {"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}
	TFJS['仁'] = {"Ｄ仁者无敌", 
	"Ｗ特效机率+10",
	"Ｗ道德值大于100增加（道德-100）/100伤害",
	"Ｗ道德值大于100减少（道德-100）/100伤害",
	"Ｎ",
	"Ｄ善恶有报	",
    "Ｗ攻击（道德-40）概率1.3倍伤害",
	"Ｗ被攻击（道德-40）概率0.7倍伤害",
	"Ｎ",
	"Ｚ绝技：仁者无敌",
	"Ｗ华山后山挑战谢云流后领悟",
	"Ｎ"
	}
	FY['仁'] = {"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}	
	TFJS['医'] = {"Ｄ回天圣手", 
	"Ｗ初始医疗200，解毒200，用毒200；医疗上限400，用毒上限400，解毒上限400",
	"Ｗ医疗范围提升至7×7方阵",
	"Ｗ每时序随机恢复自身生命、内力、中毒、内伤",
	"Ｎ",
	"Ｚ绝技：八门聚万象",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，体力大于50点，行动结束后几率触发",
	"Ｗ资质越高，触发几率越高",
	"Ｗ发动之后立即获得再次行动机会，需消耗10点体力",
	"Ｎ"
	}
	FY['医'] = {"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}
	TFJS['毒'] = {"Ｄ欲天摩罗",
	"Ｗ初始解毒300，用毒300；用毒上限500，解毒上限500",
	"Ｗ上毒范围提升至7×7方阵，可以给自己上毒",
	"Ｗ每时序随机增加自身中毒程度",
	"Ｗ自身中毒越深，能力反而越强",
    "Ｎ",
	"Ｚ绝技：天人五衰",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ至少修炼9个武功，自身中毒100点，攻击时几率触发",
	"Ｗ资质越高，触发几率越高",
	"Ｗ攻击无误伤，本次攻击必定附加五种异常状态",
	"Ｎ"
	}
	FY['毒'] = {"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}
	TFJS['嫖'] = {"Ｄ风月无间",
	"Ｗ可带女性、人妖队友去妓院白嫖，获得女性队友一条天赋，初始2次白嫖次数，每本天书增加1次白嫖次数", --ok
	"Ｗ主运混元功时任意攻击带灼烧加冰冻+紊乱",													--ok	
	"Ｗ被男性敌人攻击，降低20%伤害",														--ok
	"Ｗ被女性、人妖敌人攻击，回复5%内力和体力",												--ok
    "Ｎ",
	"Ｚ绝技：白嫖",
	"Ｗ华山后山一觉领悟“风月无间”、二觉领悟“强人锁男”，小村木桩三觉领悟“嫖如雷震”",
	"Ｗ风月无间——被女性、人妖敌人攻击临时获得对方天赋两回合；对女性、人妖敌人造成伤害时回复5%内力和体力",				--ok
	--"Ｗ对女性、人妖敌人造成伤害时回复5%内力和体力",										  --ok
	"Ｗ强人锁男——被男性敌人攻击额外降低15%伤害，敌方下回合无法行动；对男性敌人造成伤害时回复5%最大生命值",				--ok
	"Ｗ嫖如雷震——概率增加一次连击",									--ok
	"Ｎ"
	}
	FY['魔'] = {"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\"；完成倚天邪线，并打赢摩尼后，可领悟天赋魔道天行"
	}
	--[[
	1. 不限资质学习天魔功
	2. 
	3. 走完4条邪线可学会王霸之气，走完七条邪线可学魔道天行
	4. 觉醒后开启魔道光环：敌方道德越低，攻击力、防御力、集气速度衰减越大；己方队友道德越低，攻击力、防御力、集气速度加成越大。
	5. 觉醒并拥有魔道天行天赋时，主运天魔功时天魔功视为第二天内。
	]]
	TFJS['魔'] = {"Ｄ大千天魔",
	"Ｗ初始道德为0",
	"Ｗ根据道德值计算特效触发机率，道德越低机率越高（基础5%，额外增加（120-自己道德）/15）点机率", --ok
	"Ｗ不限资质学习天魔功",													--ok	
	"Ｗ魔之甲：固定机率15%，被攻击时触发，伤害强制减少99%并免疫杀气。",														--ok												--ok
    "Ｎ",
	"Ｚ绝技：魔之共主",
	"Ｗ华山后山觉醒后，激发魔主光环，全场敌方道德越低实力越弱；全场己方道德越低实力越强",
	"Ｗ华山后山觉醒后，主运天魔功时，若有魔道天行天赋，则天魔功视为天赋内功。",				--ok									--ok
	"Ｎ"
	}
	FY['嫖'] = {"Ｇ福缘际遇",
	"Ｗ觉醒后可以花一万银两在云岭洞学习\"迷踪步\""
	}
	--张家辉
	TFJS[651] = {"Ｒ人物介绍",
	"Ｗ大扎好，我系渣渣辉，探挽懒月，介四里没有挽过的船新版本，挤需体验三番钟，",
	"Ｗ里造会干我一样，爱象节款游戏。",
	"Ｎ",
	"Ｌ人物特性",
	"Ｗ自带四件传奇饰品，拥有极强大的特效",
	"Ｎ"
	}
	------------------以上為標主
	
	
	--聂风
	 TFJS[546] = {"Ｄ风中之神",
	 "Ｗ轻功成长加倍，装备附加的轻功和集气加成双倍。",
	"Ｎ"	
     }   
     
	--梅长苏
	TFJS[507] = {"Ｄ琅琊公子",
	"Ｗ战斗中系数必然不低于对方",
	"Ｗ战斗中可以自由切换林殊/梅长苏两个身份",	
	"Ｎ",
	"Ｌ冠绝江左",
	"Ｗ敌方每5点冰封值减少攻击伤害1%",
	"Ｗ自带特技“麒麟不动”：每本天书可以幻化敌方的一门武功",
	"Ｗ进战100点封值，100点灼烧值，每次行动后自身增加10点冰封值，5点灼烧值",
	"Ｗ当冰封值与灼烧值为0时“火寒毒发作，”发动“偷天换日”：",
	"Ｗ恢复生命/内力到最大值，冰封值增加100，灼烧值增加50，",
	"Ｗ其它状态清零。每100时序发动一次",
	"Ｎ"
    }	
    
	--林殊
	TFJS[508] = {"Ｄ琅琊公子",
	"Ｗ战斗中系数必然不低于对方",
	"Ｗ战斗中可以自由切换林殊/梅长苏两个身份",	
	"Ｎ",
	"Ｌ亘天赤焰",
	"Ｗ攻击必发动赤焰给敌方造成灼烧，小概率直接点燃，每点灼烧值减少敌方防御1%",
	"Ｗ免疫流血，敌方人数越多，自身三围，五系越高",
	"Ｎ"
    }	
	--杨无心
	TFJS[514] = {"Ｄ雪羽宗主",
	"Ｗ内力9999，无视内属修炼武功。",
	"Ｗ自运易水寒诀，易水值的累积有额外加成。",
	"Ｎ",
    }
	
	FY[514] = {"Ｇ福缘奇遇",
	"Ｗ得到寒冰真气，洗第二格為易水寒訣；得到飞天神行，洗第三格為風吟步"
	}
	ZL[514] = {"Ｒ特色指令：招生",
	"Ｗ把目标忽悠成自己的学生",	
	}
	--风流和尚
	TFJS[515] = {
	"Ｌ大威天龙",
	"Ｗ自带666点气攻气防",
	"Ｎ",
	--"Ｌ蛇妖，我要你助我修行",
	--"Ｗ攻击女性队友提升三围，被女性队友攻击提升五系",
    }
	--百损道人
	TFJS[523] = {"Ｄ雪冷心寒",
	"Ｗ自带玄冥神掌全部组合特效",
	"Ｎ",
    }
	--百损道人
	TFJS[528] = {"Ｄ雪冷心寒",
	"Ｗ自带玄冥神掌全部组合特效",
	"Ｎ",
    }
	--葵花尊者
	TFJS[608] = {"Ｄ葵花尊者",
	"Ｗ攻击防御1.5倍",
	"Ｗ攻击必发动葵花刺目",
	"Ｗ受到普通暗器攻击必定反击",
	"Ｗ葵花移形/真葵花移形/葵花概率提升",	
    "Ｗ可以装备绣花针",	
    "Ｎ",
	"Ｌ定心圆气",
	"Ｗ时序回复气血/内力/体力，并额外回复冰封/灼烧/流血1点/时序",
	"Ｎ"
    }	
    
	--酒神
	TFJS[721] = {"Ｄ酒神",
	"Ｗ初始暗器200，暗器必定1倍伤害",
	"Ｗ拥有华丽的头像",	
	"Ｗ喝酒buff有特殊攻击特效",	
	"Ｗ休息时必定蓄力防御",		
	"Ｎ"
	}	
    FY[721] = {
	"Ｇ福缘奇遇",
	"Ｗ得到辟邪剑谱，第一格洗辟邪剑法一级，并洗天外x笑傲正邪打败东方不败 第二格洗葵花宝典一级，并洗天内x可装备绣花针（必须接受惩罚）",	
    }
	--杨康
	--TFJS[650] = {"Ｄ小王爷",
	--"Ｗ每个武功到极减少3%所受伤害与杀气。最多减少21%",
	--"Ｌ无妄无我",
	--"Ｗ受到伤害为75%~125%。",
	--"Ｗ攻击伤害为75%~125%。",	
    --}	
    	
	--觉远
	--TFJS[573] = {"Ｄ仁阳佛光",
	--"Ｗ内力上限9999",
	--"Ｗ可使用九阳神功攻击",	
    --"Ｎ",
	--"Ｌ天域幻音",
	--"Ｗ本方行动后清除流血、中毒、冰封、灼烧、内伤，并回复生命值",
   -- }	
    
	--白猿
	TFJS[575] = {"Ｄ仙剑神猿",
	"Ｗ使用剑系武功攻击时，敌方御剑系数减半",
	"Ｗ可装备白猿,猿公剑法威力+500",	
    "Ｎ",
	"Ｌ闪电惊鸿",
	"Ｗ初始集气值1000，每次攻击后自身集气+200，连击率+50%",
	"Ｗ每学会一种剑法,伤害提升5%",	
	"Ｎ"
    }	
    	
	--玄澄
	TFJS[576] = {"Ｄ菩提金身",
	"Ｗ受到的伤害减少30%",
    "Ｎ",
	"Ｌ无量禅震",
	"Ｗ使用伏魔杖法必定暴击",
	"Ｗ攻击如被闪避则追加一次攻击",	
	"Ｗ伏魔伏法必暴击，追加内伤，并追加内伤值伤害",		
    "Ｎ",
	"Ｌ佛门无双",
	"Ｗ所有少林武功无条件学习",	
    }	
   
	--摩尼
	TFJS[641] = {"Ｄ圣火明尊",
	"Ｗ攻击必灼烧，灼烧大于25点必点燃",
	"Ｗ点燃后会造成小范围伤害",
	"Ｎ",
	"Ｌ魔道天行",
	"Ｗ我方全体攻击伤害×120％，敌方全体攻击伤害×90％；主运天魔功就可触发组合特效",
   "Ｎ",
	"Ｌ逆转乾坤",
	"Ｗ乾坤大挪移可同时反弹给两个人（学会乾坤大挪移后）反弹伤害50%",			
	"Ｗ免疫暗器",	
	}	
	
	--岳云
	TFJS[568] = {"Ｄ精忠报国",
	"Ｗ生命低于50%减伤50%，生命低于25%减伤75%",
	"Ｗ岳家枪法攻击必命中，必连击",	
	"Ｗ岳王散手攻击必暴击，必封穴",		
    "Ｎ",
	--"Ｌ决胜千里",
	--"Ｗ 每回合50％几率触发，敌方集气-150，本方集气+150",
	}
    
	--上官剑南
	TFJS[567] = {"Ｄ千秋侠烈",
	"Ｗ生命值低于50%，伤害1.5倍，低于25%伤害2倍。",
	"Ｗ被攻击伤害90%",	
    "Ｎ",
	--"Ｌ傲世神罡",
	--"Ｗ攻击必暴击",
	--"Ｗ拳掌武功必破防30%",
    }
    		
	--袁士宵
	TFJS[658] = {"Ｄ天池怪侠",
	"Ｗ被攻击时概率转移杀气值给攻击者",
	"Ｗ攻击系数只算拳法",	
	"Ｗ百花错拳威力+600",	
    "Ｎ"
	}	
	
	--陈正德
	TFJS[311] = {"Ｄ天山双鹰",
	"Ｗ三分剑法必定三连，伤害变为三分之一",
	"Ｌ秃鹰",
	"Ｗ鹰爪功追加内伤，并追加内伤值伤害",
	"Ｎ"
    }	
    
	--天镜
	TFJS[313] = {"Ｄ天佛降世",
	"Ｗ学会金刚不坏神功必定触发“金刚不坏”特效",
	"Ｗ战斗中可以复活一次，复活后免疫内伤，免疫暴击伤害，",	
	"Ｎ",
	"Ｌ诸行无常",
	"Ｗ可使用内功攻击，武功范围+1。",
    }
	TFJS[499] = {"Ｄ剑绝天南",
	"Ｗ使用六脉神剑触发四种特效几率随实战的增加每100实战增加5％.）",
	"Ｗ剑逆天光：无视敌方气防 且必破防50%（初始出招几率10％）。",	
	"Ｗ剑煌镜影：增加一次连击 附带灼烧效果（初始出招几率8％）。",
	"Ｗ南柯万剑：必暴击,且暴击攻击加成提升至200％（初始出招几率6％）。",
	"Ｗ皇玺剑印：对目标造成随机造成眩晕/虚弱/定身。（初始出招几率6％）",
	"Ｎ",
	"Ｌ六脉玄机",
	"Ｗ使用六脉神剑必触发【剑气碧烟横】，内力上限9999。",
	"Ｎ"	
    }	
	FY[499] = {"Ｇ福缘奇遇",
	"Ｗ去天龙寺书架有六脉神剑特殊剧情。战胜第一格洗六脉神剑",
	}		
	--袁冠南
	TFJS[566] = {"Ｄ白驹过隙",
	"Ｗ15%概率闪避攻击，生命越低，闪避率越高，最高35%闪避率",
	"Ｗ闪避后反击敌方",		
	"Ｎ",
	"Ｌ白衣书生",
	"Ｗ萧中慧在场，攻防提各提升100。",
	"Ｗ夫妻刀法威力增加300。",	
	"Ｎ"
	}				
	
	TFJS[517] = {"Ｄ夜雨楼主",
    "Ｗ享有全部轻功特效",	
    "Ｗ自带狂风迅雷功组合特效",
	"Ｎ",
	}
	--南子
	TFJS[525] = {"Ｄ南天一霸",
    "Ｗ自带燎原百击组合特效",
	"Ｌ烈焰燎原",
	"Ｗ时序增加灼烧，免疫一切灼烧带来的负面影响，当生命值低于一半时根据自身灼烧恢复生命",
	"Ｌ九阳枪王",
	"Ｗ获得九阳护盾时，时序根据自身灼烧扩大焚烧范围，并根据自身灼烧恢复内力范围内敌人持续增加灼烧，并根据自身灼烧值损失内力；当范围内敌人冰封灼烧均大于50时，进入冰火两重天状态，被攻击会根据灼烧冰封损失生命内力，附加无明业火",
	"Ｎ",
	}
	--喵姐
	TFJS[526] = {"Ｄ夜雨剑首",
    "Ｗ使用任何剑法，都自带玉女素心剑、越女剑组合特效",	
	"Ｎ",
	}
	FY[526] = {"Ｇ福缘奇遇",
	"Ｗ开局即为副楼主",
	}
	
	--李沅芷
	TFJS[569] = {"Ｄ小魔女",
	"Ｗ敌方气攻伤害减少20%",
	"Ｗ敌方命中减10%",	
	"Ｎ",
	"Ｌ芙蓉金针",
	"Ｗ攻击附带暗器系数的伤害",	
	"Ｎ",	
	}
	
	FY[569] = {"Ｇ福缘奇遇",
	"Ｗ获得柔云剑法/无极玄功拳，第一/二格洗对应武功；获得纯阳无极功第三格洗梯云纵，天轻洗梯云纵",
	}
		
    
	--夏雪宜
	TFJS[639] = {"Ｄ金蛇郎君",
	"Ｗ金蛇剑法威力1.5倍。",
	"Ｗ金蛇锥3~5倍伤害。",	
	"Ｗ暴怒使用金蛇剑法必出金蛇奥义。",
	"Ｎ",
	--"Ｌ意假情真",
	--"Ｗ暴怒后攻击怒气值概率只减少10~40。",	
	}		
	--天虹
	TFJS[657] = {"Ｄ悲天佛怜",
	"Ｗ生命值低于50%，拥有绝对气防",
	"Ｗ般若掌攻击范围变为点，威力增加50%。",	
	}
				
	--萧玲
	TFJS[574] = {"Ｄ寒露清梦",
	"Ｗ攻击与被攻击无视敌方系数",
	"Ｗ攻击概率无视敌方防御30%",	
	"Ｎ",
	"Ｌ天仙锁魂",
	"Ｗ敌方每回合30%几率附加虚弱状态2回合。",
	"Ｗ增加x(敌方人数)伤害，最多增加60%。",	
	"Ｎ",
		
	}
	ZL[574] = {"Ｒ特色指令：云梦",
	"Ｗ效果：可自由切换第一格武功为寒袖拂穴/白虹掌力",
	}
	FY[574] = {"Ｇ福缘奇遇",
	"Ｗ灵鹫宫获得小无相功第三格洗小无相功。天内洗小无相功；灵鹫宫获得八荒六合功第四格洗八荒六合功。可以选择天内是否洗八荒六合功",	
	}
	--达摩
	TFJS[577] = {"Ｄ一苇渡江",
    "Ｗ一苇渡江轻功自动运功",	
    "Ｗ拥有绝对气防",	
	"Ｎ",
	}
	BOSSZT[577] = {"Ｇ万佛朝宗",
	"Ｗ攻击时概率触发万佛朝宗附加目标当前生命值10%的伤害，并减少内力20%。；Ｇ五蕴皆空：Ｗ受想行识：被攻击时概率触发，把受到的伤害完全反弹给攻击方（包括暗器）；亦复如是：行动前触发，为敌人附加各种debuff。Ｇ毗婆舍那：Ｗ达摩受到攻击不会产生怒气，但每时序增加1点怒气。达摩攻击会减少目标的最大生命值。每攻击一次减少2%达摩每回合行动前内力、体力、怒气，生命只要其中一项恢复到满状态，生命、内力、体力恢复到满状态。"
    }

	TFJS[589] = {"Ｄ似水柔情",
	"Ｗ误伤队友时恢复其血量",
	"Ｎ",
	"Ｌ铃剑侠女",
	"Ｗ使用连城剑法高连击",
	"Ｎ",
    }
    
	TFJS[594] = {"Ｄ铁索横江",
	"Ｗ【闭气离墙.起死回生】，战斗中可以复活一次",
	"Ｗ自带“铁索横江”：自身范围内一格25%概率免受攻击。",
	"Ｗ基础连击率大幅度提高",
	"Ｎ",
    }

	--周维信
	TFJS[612] = {"Ｄ铁鞭震八方",
	"Ｗ呼延十八鞭2~5倍威力。",
	"Ｎ",	
	}		
	--卓天雄
	TFJS[613] = {"Ｄ铁掌神鞭",
	"Ｗ震天铁掌威力翻倍，呼延十八鞭威力三倍。",	
	"Ｗ使用震天铁掌10%概率直接震晕目标",
	"Ｗ使用呼延十八鞭大概率造成封穴",
	"Ｎ",	
	}		
	--林玉龙
	TFJS[614] = {"Ｄ荒野游龙",
	--"Ｗ每行动一次，减伤增加5%，增伤5%，最高减伤增加40%。",
	--"Ｎ",
	"Ｌ欢喜冤家",
	"Ｗ任飞燕在场，攻防提各提升100。",
	"Ｎ",
    }	
    	
	--任飞燕
	TFJS[615] = {"Ｄ玉堂飞燕",
	"Ｗ攻击附带轻功值2倍的杀气值",	
	"Ｗ被攻击附带轻功值2倍的气防值",
	"Ｗ使用夫妻刀法攻击附加（轻功值/2）的固定伤害。",
	"Ｎ",
	"Ｌ欢喜冤家",	
	"Ｗ与林玉龙同时在场，攻防轻增加50",
	"Ｎ",	
    }

	TFJS[1] = {"Ｄ魂系一刀",
	"Ｗ使用胡家刀法有50%几率触发极意，暴怒必触发",
	"Ｎ",
	"Ｌ雪山飞狐",
	"Ｗ集气速度提升10点",
	"Ｎ",
	
	}
	ZL[1] = {"Ｒ特色指令：飞狐",
	"Ｗ效果：无视障碍物移动，在战场上来去自如",
	}
	FY[1] = {"Ｇ福缘际遇",
	"Ｗ得到《雪山飞狐》后，找苗人凤可洗第二格武功"
    }
    
	TFJS[2] = {"Ｄ灵枢素问",
	"Ｗ医疗能力上限400",
	"Ｗ用毒能力上限500",
	"Ｗ攻击时附带【七心海棠】，敌方全体中毒77点，损失当血内7%，损失7点体力，给已方全体随机上一种药品BUFF",
	"Ｗ攻击时即使杀死敌方，也不会中断连击",
	"Ｎ",
    }
    
	TFJS[3] = {"Ｄ金面佛",
	"Ｗ攻击时高几率附带灼烧",
	"Ｗ每100点御剑系数增加剑法攻击范围1格",
	"Ｎ",
	
    }
	ZL[3] = {"Ｒ特色指令：破军",
	"Ｗ效果：攻击敌方附加散状态，时序掉内。",}
	FY[3] = {"Ｇ福缘际遇",
	"Ｗ雪山飞狐闯王宝藏剧情，可选择洗第二格武功及天赋轻功"}
	
	TFJS[4] = {"Ｄ跌打医生",
	"Ｗ医疗能力上限300",
	"Ｗ用毒能力上限300",
	"Ｎ",
	"Ｌ雁过拔毛",
	"Ｗ击退敌方后可获得银两",
	"Ｗ让田归农的攻击中附加带毒",
	"Ｎ",
    }
	ZL[4] = {"Ｒ特色指令：虚弱",
	"Ｗ用毒药侵蚀一名敌人的神经，使其在40时序内造成的伤害杀气减半"}
	
	TFJS[5] = {"Ｄ太极宗师",
	"Ｗ连击伤害杀气借力打力不减",	
	"Ｗ太极拳连击时亦享受借力打力效果",
	"Ｗ太极奥义发动几率无视资质固定为85%",
	"Ｗ太极神功蓄力只清除50%",	
	"Ｗ太极神功蓄力每时序增加10点",
	"Ｗ纯阳无极功、太极神功自动运功",
	--"Ｌ通微显化",
	--"Ｗ被攻击发动无根无形减伤30%",
	"Ｗ攻击时几率发动万法自然，下回合集气+500",
	"Ｗ移动格数至少为8格",
	"Ｗ蓄力效果增加",	
	"Ｗ攻击时几率触发化朽为奇，追加武功威力的气攻",
	"Ｎ",
    }
	TFJS[6] = {"Ｄ灭绝师太",
	"Ｗ使用任何武功高连击，必暴击",
	"Ｗ移动格数+3",
	"Ｎ",
	
	}
	ZL[6] = {"Ｒ特色指令：俱焚",
	"Ｗ开启后100时序，自身造成和受到的伤害皆提高50%，不消耗回合"
	}
	
	TFJS[7] = {"Ｄ铁琴先生",
	"Ｗ攻击时，有60%几率给敌方附加1-3层琴音状态",
	"Ｗ每层琴音状态降低敌方1%集气速度",
	"Ｗ琴音状态叠加上限为20层",
	"Ｎ",
	}
	ZL[7] = {"Ｒ特色指令：铁琴",
	"Ｗ使全场敌人受到其身上琴音层数×50点伤害，并清除其身上的琴音状态"
	}
	
	TFJS[8] = {"Ｄ崆峒掌门",
	"Ｌ七伤大成",
	"Ｗ使用七伤拳恢复生命、内力",
	"Ｎ",
	}
	TFJS[9] = {"Ｄ运转乾坤",
	"Ｗ乾坤大挪移反弹效果 强化至反弹40%伤害",
	"Ｗ乾坤大挪移可同时反弹给两个人,乾坤大挪移自动运功",
	"Ｎ",
	"Ｌ特技：逆转乾坤（畅想主角专属）",
	"Ｄ学会乾坤后，被攻击时，有（35+天书数）%的几率触发，可以选择",
	"ＷA.在两格范围内对敌方的攻击落点进行挪移（消耗300点内力）",
	"ＷB.按ESC键取消挪移，本次被攻击必定发动乾坤反弹50%伤害",
	"Ｚ触发『逆转乾坤』后，敌方的误伤伤害将大幅提高，并且对误伤者有杀气效果",
	"Ｚ主角处于爆豆状态时，『逆转乾坤』触发几率提升10%",	
	"Ｎ",
	"Ｌ九阳明尊",
	"Ｗ可使用九阳神功攻击",
	"Ｗ未触发内功加力，护体时，补偿九阳神功加力，护体",
	"Ｎ"
	}
	ZL[9] = {"Ｒ特色指令：挪移",
	"Ｗ将八格范围内的我方任一队友挪移到指定位置",	
	}
	FY[9] = {"Ｇ福缘际遇",
	"Ｗ朱府剧情后洗第一格武功；光明顶领悟仁阳佛光；光明顶密道拿到乾坤时，洗第二格武功；灵蛇岛剧情领悟圣火明尊；武当山见张三丰，洗第三、四格武功",	
	}
	
	TFJS[10] = {"Ｄ光明右使",
	"Ｗ每次受到攻击，增加自身1%的减伤，上限20%",
	"Ｎ"
	}
	TFJS[11] = {"Ｄ光明左使",
	"Ｗ每次攻击，使敌方受到的伤害提高1%，上限20%",
	"Ｎ"
	}
	TFJS[12] = {"Ｄ白眉鹰王",
	"Ｗ华山观武后，鹰爪功威力增加50%",
	"Ｗ自带“鹰王真气”，提供额外的气攻气防",
	"Ｎ"
	}
	TFJS[13] = {"Ｄ金毛狮王",
	"Ｗ狮子吼发动条件放宽为敌方内力低于自身即可",
	"Ｗ七伤拳一震七伤发动几率100%，且一震七伤额外造成7点内伤",
	"Ｗ受到的伤害减少15%",
	"Ｎ",
	}
	ZL[13] = {"Ｒ特色指令：咆哮",
	"Ｗ使全场敌人进入混乱状态20时序，此状态下敌人行动时的敌我关系为随机；不会全部随机到我方，以免出现直接获胜的情况"}
	
	TFJS[14] = {"Ｄ青翼蝠王",
	"Ｗ集气速度提升10点",
	"Ｗ华山观武后，寒冰绵掌威力增加50%",
	"Ｎ",
	--"Ｌ吸血蝙蝠",
	--"Ｗ攻击时，恢复造成伤害10%的血量（单次攻击吸血上限100点）"
	}
	TFJS[15] = {"Ｄ紫衫龙王",
	"Ｗ每次行动都有20%几率魅惑敌人一回合",
	"Ｎ",
	}
	ZL[15] = {"Ｒ特色指令：倾国",
	"Ｗ开启后，接下来受到的前6次攻击将折射给在场随机第三方人物"
	}
	TFJS[16] = {"Ｄ蝶谷医仙",
	"Ｗ医疗上限500点",
	"Ｗ可向队友用药",
	"Ｗ全场友军使用药品效果上升30%",
	"Ｎ",
	
	}
	ZL[16] = {"Ｒ特色指令：群疗",
	"Ｗ周围五格范围内的队友时序回内伤并按比例回血，持续20时序",
	}
	TFJS[17] = {"Ｄ蝶谷毒仙",
	"Ｗ用毒能力上限500",
	"Ｎ",
	"Ｒ特色指令：施毒",
	"Ｗ周围五格范围内的敌人时序中毒，持续50时序"
	}
	
	
	TFJS[18] = {"Ｄ混元霹雳手",
	"Ｗ自带混元霹雳功加力、护体，大概600威力，可叠加,几率与实战及天书数量有关",
	"Ｗ集气速度+10点",
	"Ｗ使用任何武功高几率连击",
	"Ｗ使用任何武功高几率封穴",
	"Ｎ",
	}
    FY[18] = {"Ｇ福缘际遇",
	"Ｗ光明顶剧情领悟鸡你太美"
	}
	
	TFJS[19] = {"Ｄ君子剑",
	"Ｗ华山觉醒后自带五岳剑诀",
	"Ｎ",
	}
	FY[19] = {"Ｇ福缘际遇",
	"Ｗ笑傲福威镖局选择正邪剧情，洗第一、三格武功"
	}
	
	TFJS[21] = {"Ｄ恒山掌门",
	"Ｗ华山觉醒后自带五岳剑诀",
	"Ｎ",
	}
	TFJS[22] = {"Ｄ嵩山掌门",
	"Ｗ华山觉醒后自带五岳剑诀",
	"Ｗ攻击时高几率附带冰封",
	"Ｗ自带“寒冰真气”加力、护体，500威力，可叠加（几率与天书数、实战相关）",
	"Ｎ",
	}
	TFJS[23] = {"Ｄ泰山掌门",
	"Ｗ华山觉醒后自带五岳剑诀",
	"Ｗ攻击时高几率附带灼烧",
	"Ｎ",
	}
	TFJS[24] = {"Ｄ青城掌门",
	"Ｗ松风剑法威力翻倍",
	"Ｌ松风剑神",
	"Ｗ华山觉醒后松风剑法威力翻倍，必连击，必暴击",
	"Ｎ",
	}
	TFJS[25] = {"Ｄ五毒教主",
	"Ｗ攻击效果提升10%",
	"Ｗ用毒能力上限400",
	"Ｎ",
    }
    
	TFJS[26] = {"Ｄ日月魔帝",
	"Ｗ吸星大法吸体力效果提高",
	"Ｗ自带加力护体（600威力，可叠加）几率与天书数、实战有关",
	"Ｗ使用任何武功高暴击",
    "Ｗ攻击时高几率造成封穴",
	"Ｎ",
	}
	BOSSZT[26] = {"Ｇ吸星魔帝",
	"Ｗ每3时序恢复1点内伤；距离越远所受到的伤害与杀气越低（与原距离伤害衰减叠加）；敌方与自身距离越近，集气速度越低（最远距离10格，超出10格则不受影响）；攻击与被攻击时必定触发吸星大法，吸星大法效果固定增加500，当敌方内力不足时，则造成损失内力一半的生命损失；当自身满内时，吸收的内力的一半则化作真气护体，上限为自身最大生命30%",
    }
    
	TFJS[27] = {"Ｄ风云再起",
	"Ｗ葵花神功自动运功",	
	"Ｗ攻击无误伤",
	"Ｗ集气速度提升6点",
	"Ｗ必连击，50机率追加一次连击(暴怒必追加",
	"Ｗ连击时伤害、气攻不减",	
	"Ｗ自带绣花针，真.葵花移形概率30%",	
	
	--"Ｌ葵花点穴手",
	--"Ｗ攻击时几率追加1000气攻，且必定造成封穴",
	--"Ｎ",
	--"Ｌ葵花秘法·化凤为凰",
	"Ｗ暴怒时触发，直至暴怒解除前无法被杀气",
	"Ｎ",
	}
	TFJS[28] = {"Ｄ杀人名医",
	"Ｗ每击退一名敌人集气速度+3点、医疗能力+50（最多5个有效）",
	"Ｗ医疗能力上限500",
	"Ｎ",
	}
	TFJS[29] = {"Ｄ采花大盗",
	"Ｗ攻击女性时吸取内力体力",
	"Ｎ",
	}
	TFJS[31] = {"Ｄ江南四友",
	"Ｗ华山观武后倚天屠龙功威力翻倍",
	"Ｗ江南四友每多一人在场、气防+500",
	"Ｎ",
	}
	TFJS[32] = {"Ｄ江南四友",
	"Ｗ华山观武后妙笔丹青威力翻倍",
	"Ｗ江南四友每多一人在场、气防+500",
	"Ｎ",
	}
	TFJS[33] = {"Ｄ江南四友",
	"Ｗ华山观武后棋盘招式威力翻倍",
	"Ｗ江南四友每多一人在场、气防+500",
	"Ｎ",
	}
	TFJS[34] = {"Ｄ江南四友",
	"Ｗ华山观武后持摇琴威力翻倍",
	"Ｗ江南四友每多一人在场、气防+500",
	"Ｎ",
	}
	TFJS[35] = {"Ｄ九剑传人",
	"Ｗ移动格数+3",
	"Ｗ被风清扬指点后，进入战斗初始集气值1000",
	"Ｚ九剑真传（独孤剑冢剧情后）",
	"Ｗ连击率大幅提升",
	"Ｗ使用独孤九剑攻击无误伤",
	"Ｗ攻击时有几率发动『九剑真传』特效",
	"Ｎ"
	}
	FY[35] = {"Ｇ福缘际遇",
	"Ｗ笑傲思过崖剧情，洗第一格武功，天赋外功洗为独孤九剑；笑傲梅庄地牢剧情，洗第二格武功，天赋内功洗为吸星大法"
	}
	TFJS[36] = {"Ｄ辟邪剑客",
	"Ｗ初始集气位置900",
	"Ｗ可使用葵花神功攻击",
	"Ｚ特技：血海飘香（杀余沧海后领悟）",
	"Ｗ根据本轮造成的伤害提高下一轮的集气位置，上限800",
	"Ｗ根据本轮造成的伤害提高自身行动后集气速度",
	"Ｗ攻击额外追加自身集气速度的真实伤害，暴怒翻倍",
	"Ｎ",
    }
	FY[36] = {"Ｇ福缘际遇",
	"Ｗ笑傲福威镖局选择正邪剧情，洗第一、二格武功；天赋内功洗为葵花神功"
	}
	
	TFJS[37] = {"Ｄ赤心连城",
	"Ｗ使用连城剑法高连击",
	"Ｗ修炼血刀大法无惩罚，不会降低生命上限",
	"Ｗ如本次攻击造成伤害低于500，则追加一次连击（一轮追加上限5次）",
	"Ｚ真名神照",
	"Ｗ学会神照功时拥有绝对气防",
	"Ｗ神照功复活效果强化，回复百分比为100%，并且立即行动，无需运功",
	"Ｗ可使用神照功攻击，并追加800点气攻",
	"Ｗ神照功等级修炼至极，轻功+20",
	"Ｎ",
    }
	FY[37] = {"Ｇ福缘际遇",
	"Ｗ连城诀雪山剧情，洗第二、三格武功"
	}

	TFJS[38] = {"Ｄ名相皆无",
	"Ｗ计算加力/护体/出招几率时必定开启二次判定",
	"Ｗ学有罗汉伏魔功，攻击时必出【罗汉伏魔】特效",
	"Ｗ【罗汉伏魔】特效效果增强10%（包括伤害和杀气）",
	"Ｗ内力上限9999",
	"Ｗ觉醒后享受以下特效：",
	"Ｚ混沦太玄",
	"Ｗ可使用太玄神功攻击，并可选择招式",
	"Ｗ太玄神功耗内降低50%（与天赋外功效果叠加，降低75%内力消耗）",
	"Ｗ被攻击时，有50%几率触发太玄反震，对攻击方造成10点封穴",
	"Ｗ被攻击时，有30%几率将受到的伤害转化为减半回血",
	"Ｎ",
	}
	FY[38] = {"Ｇ福缘际遇",
	"Ｗ侠客正线挑战岛主剧情，洗第二格武功，天赋内功洗为太玄神功；太玄神功自动运功"
	}
	

	TFJS[39] = {"Ｄ侠客岛主",
	"Ｗ攻击效果提升20%",
	"Ｗ使用任何武功高几率造成封穴",
	"Ｗ主运太玄神功不会触发太玄之重",
	"Ｎ",
	}
	TFJS[40] = {"Ｄ侠客岛主",
	"Ｗ防御效果提升20%",
	"Ｗ主运太玄神功不会触发太玄之轻",
	"Ｎ",
	}
	TFJS[41] = {"Ｄ赏善使者",
	"Ｗ道德高于59，行动后对周身五格范围内队友治疗",
	"Ｗ攻击时高几率附带灼烧",
	"Ｎ",
	}
	TFJS[42] = {"Ｄ罚恶使者",
	"Ｗ道德低于61，行动后对周身五格范围内敌人施毒",
	"Ｗ攻击时高几率附带冰封",
	"Ｎ",
	}
	TFJS[43] = {"Ｄ雪山掌门",
	"Ｗ攻击必冰封，冰封超过50冻结目标",	
	"Ｗ追加冰封值的真实伤害，自身免疫冰封",
	"Ｎ",
	}

	TFJS[44] = {"Ｄ凶神恶煞",
	"Ｗ暴击攻击加成提升至200%",
	"Ｚ南海鳄神",
	"Ｗ暴怒时大剪刀附带撕裂效果",
	"Ｎ",
    }
    
	TFJS[45] = {"Ｄ阎王敌",
	"Ｗ医疗上限500点",
	"Ｗ战斗中满血复活自己或者同伴一次",
	"Ｎ",
    }
    
	TFJS[46] = {"Ｄ星宿老怪",
	"Ｗ连环腐尸毒必出极意，引爆目标身上毒素",
	"Ｗ攻击时，追加等同于敌方中毒量的伤害",
	"Ｚ三笑销魂散",
	"Ｗ回合结束时按中毒量3倍扣除敌方生命",
	"Ｎ",
    }
    
	TFJS[47] = {"Ｄ曼珠沙华",
	"Ｗ每击退一个敌方，自身气攻气防提高200点",
	"Ｎ",
	
    }
	ZL[47] = {"Ｒ特色指令：禁药",
	"Ｗ使用禁药刺激神经，自身每时序损失1%最大血量；此状态下自身血量越低，伤害/集气越高，不消耗回合"
	}
    
	TFJS[48] = {"Ｄ冰毒怪客",
	"Ｗ攻击带毒340点",
	"Ｚ千年冰蚕",
	"Ｗ攻击随机附加1~8层“冰冻状态”，每层减缓1%集气速度，上限50层",
	"Ｗ攻击时，如敌方身上的冰封大于50，则有60%几率将其冻结10时序",
	"Ｎ",
    }
    
	TFJS[49] = {"Ｄ福缘深厚",
	"Ｗ攻击时50%几率触发【福泽加护】，下回合集气+200",
	--"Ｎ",
	"Ｚ逍遥掌门",
	"Ｗ擂鼓山剧情后，自带北冥真气护体",
	"Ｗ学会八荒六合功后，使用天山六阳掌/天山折梅手攻击可触发【生死符】",
	"Ｗ生死符追加1000气攻，对被生死符击中的敌人，可使用【催符】指令",
	"Ｗ面板上每多一个武功到极，天山折梅手威力+50",
	"Ｗ天山折梅手修炼到极，资质变为50",
	"Ｎ",
    }
	ZL[49] = {"Ｒ特色指令：催符",
	"Ｗ催动敌人身上的生死符，使其封穴25时序",
	}
	FY[49] = {"Ｇ福缘际遇",
	"Ｗ擂鼓山支线剧情，洗第一、二格武功；灵鹫宫拿八荒时，第三格洗为八荒六合功；灵鹫宫拿折梅时第五格洗为天山折梅手"
	}
	
	TFJS[50] = {"Ｄ奋英雄怒",
	"Ｗ攻击时必定造成暴击并有红字特效",
	"Ｗ集气速度+10",
	"Ｚ狂龙天征",
	"Ｗ自带“擒龙功”加力、护体，1000威力，可叠加（几率与天书数、实战相关）",
	"Ｗ使用降龙十八掌，必定发动【降龙.极意】",
	"Ｗ使用降龙十八掌，40%几率发动【降龙.三叠浪】，暴怒时必定发动",
	"Ｗ使用降龙十八掌攻击无误伤",
	"Ｗ降龙十八掌耗内降低50%（与天赋外功效果叠加，降低75%内力消耗）",
	"Ｎ",
    }
	FY[50] = {"Ｇ福缘际遇",
	"Ｗ天龙八部正线挑战扫地老僧胜利后，可获得专属武器"
	}
	TFJS[539] = {"Ｄ奋英雄怒",
	"Ｗ攻击时必定造成暴击并有红字特效",
	"Ｗ集气速度+10",
	"Ｚ狂龙天征",
	"Ｗ自带“擒龙功”加力、护体，1000威力，可叠加（几率与天书数、实战相关）",
	"Ｗ使用降龙十八掌，必定发动【降龙.极意】",
	"Ｗ使用降龙十八掌，40%几率发动【降龙.三叠浪】，暴怒时必定发动",
	"Ｗ使用降龙十八掌攻击无误伤",
	"Ｗ降龙十八掌耗内降低50%（与天赋外功效果叠加，降低75%内力消耗）",
	"Ｎ",
    }
	FY[539] = {"Ｇ福缘际遇",
	"Ｗ天龙八部正线挑战扫地老僧胜利后，可获得专属武器"
	}
	
	TFJS[51] = {"Ｄ离合参商",
	"Ｗ斗转反击时，无视兵器值需求必定发动离合参商",
	"Ｗ斗转星移发动几率100%",
	--"Ｎ",
	"Ｚ姑苏慕容",
	"Ｗ可使用斗转星移进行攻击",
	"Ｎ",
	}
	ZL[51] = {"Ｒ特色指令：幻梦",
	"Ｗ至该角色下次行动为止，被攻击必定发动幻梦星辰反击",
	}
	FY[51] = {"Ｇ福缘际遇",
	"Ｗ天龙八部邪线挑战扫地老僧胜利后第二格以及天赋内功洗易筋经，领悟黑级浮屠"
   }
   TFJS[679] = {"Ｄ离合参商",
	"Ｗ斗转反击时，无视兵器值需求必定发动离合参商",
	"Ｗ斗转星移发动几率100%",
	--"Ｎ",
	"Ｚ姑苏慕容",
	"Ｗ可使用斗转星移进行攻击",
	"Ｎ",
	}
	ZL[679] = {"Ｒ特色指令：幻梦",
	"Ｗ至该角色下次行动为止，被攻击必定发动幻梦星辰反击",
	}
	FY[679] = {"Ｇ福缘际遇",
	"Ｗ天龙八部邪线挑战扫地老僧胜利后第二格以及天赋内功洗易筋经，领悟黑级浮屠"
   }

	TFJS[52] = {"Ｄ中平神枪",
	"Ｗ使用中平枪法时，气攻+1000",
	"Ｚ畅想主角专属",
	"Ｗ苦练七十二变",
	"Ｗ行动前随机变化一个形象，获得相应天赋和第一格武功",
	"Ｗ笑对八十一难",
	"Ｗ行动后集气速度提高一点，上限八十一点",
	"Ｎ",
	}

	TFJS[53] = {"Ｄ磊落仁心",
	"Ｗ内力上限9999",
	--"Ｎ",
	"Ｚ六脉真传",
	"Ｗ六脉神剑出招式几率追加二次判定",
	"Ｗ六脉神剑耗内降低50%（与天赋外功效果叠加，降低75%内力消耗）",
	"Ｎ",
    }
	ZL[53] = {"Ｒ特色指令：凌波",
	"Ｗ至该角色下次行动为止，被攻击有50%几率闪避",
	}
	FY[53] = {"Ｇ福缘际遇",
	"Ｗ无量山洞剧情，第一格洗北冥、第二格洗凌波微步；天龙寺剧情，第三格洗六脉神剑"
	}
    
	TFJS[54] = {"Ｄ志垂日月",
	"Ｗ基础暴击率提升",
	"Ｗ暴击效果随天书数量提升（仅我方有效）上限1.5",
	"Ｗ学会混元功高概率三连击",
	--"Ｎ",
	"Ｚ碧血长风（畅想主角专属）",
	"Ｗ本次行动如击退至少一名敌方，则可再次行动",
	--"Ｎ",
	"Ｚ金蛇传人",
	"Ｗ使用暗器金蛇锥必定造成3倍伤害",
	"Ｗ觉醒后触发以下特效：",
	"Ｚ长平公主的眷恋",
	"Ｗ神行百变闪避/减伤几率提高",
	"Ｗ生命值低于30%时，可触发金蛇奥义",
	"Ｎ",
	}
	
	
	TFJS[55] = {"Ｄ大器晚成",
	"Ｗ左右互搏发动几率固定为80%",
	"Ｗ作为队友时，最后10级的升级属性提高",
	"Ｚ侠之大者",
	"Ｗ使用降龙十八掌，40%几率发动【降龙.极意】",
	"Ｗ使用降龙十八掌发动连击时，在第二击附加随机多重后劲，额外增加伤害和杀气",
	"Ｗ后劲上限随天书数而增加，最多13道；后劲超过11道时，无视敌方绝对气防",
	"Ｗ每道后劲增加8%的高优先级伤害和150点气攻，NPC郭靖上限固定为10道后劲",
	"Ｎ",
	}
	FY[55] ={"Ｇ福缘际遇",
	"Ｗ射雕桃花岛招亲剧情，洗第一、二、三格武功；射雕正线桃花岛收郭靖时，可重新选择内力属性"
	}
	TFJS[56] = {"Ｄ奇门遁甲",
	"Ｗ战斗开始前可布置奇阵，不同颜色的地面有不同效果:",
	"Ｗ红色——造成的伤害提高20%",
	"Ｗ绿色——受到的伤害减少20%",
	"Ｗ蓝色——攻击时追加400点气攻",
	"Ｗ紫色——被攻击时有30%几率闪避",
	"Ｎ",
	"Ｚ兰质蕙心",
	"Ｗ修炼武功秘籍时，兵器值成长翻倍",
	"Ｚ带刺玫瑰",	
	"Ｗ被攻击减伤200，反弹20%受到的攻击伤害",
	"Ｎ",
    }
    FY[56] = {"Ｇ福缘际遇",
	"Ｗ射雕明霞岛剧情，洗第一、二格武功"
	}
	
	TFJS[57] = {"Ｄ东邪",
    "Ｗ攻击时高几率造成封穴",
    "Ｗ被攻击时触发“奇门五转”降低25%伤害",
	"Ｗ奇门遁甲自动运功",
    "Ｗ集气速度+10",
	"Ｚ魔音·碧海潮生曲",
	"Ｗ攻击时发动碧海潮生曲,第一击100%概率杀全体敌人内力500，连击时发动概率40%",
	"Ｗ30%概率造成敌方全体集气紊乱20时序",
	"Ｚ奇门五行",
	"Ｗ自身在场时，敌方人物25%概率随机移动",
	"Ｗ敌方移动步数-2",
	"Ｎ",
    }
	
	TFJS[58] = {"Ｄ逆流勇进",
	"Ｗ生命值低于50%时暴击率两倍，生命值低于25%时暴击率三倍",
	"Ｗ当生命值50%时，生命值每再降低1%，下回合集气位置+10点",
	"Ｚ西狂",
	"Ｗ使用玄铁剑法时，有几率发动重剑真传",
	"Ｗ使用黯然销魂掌击中生命敌于50%的目标概率直接击退(概率跟敌人血量有关)",		
	"Ｗ攻击时附带“西狂之怒啸”，敌方全体集气倒退100点",
	"Ｗ战斗中，当小龙女被击退时，杨过立即出手并发动【西狂之震怒·雷霆狂啸】",
	"Ｚ黯然极意",
	"Ｗ资质高于30，触发黯然极意必出三叠浪",
	"Ｗ资质低于30，触发黯然极意必定连击",
	"Ｎ",
	}
	FY[58] = {"Ｇ福缘际遇",
	"Ｗ作为畅想主角时，有大量专属剧情；独孤剑冢拿玄铁剑法时，洗第一格武功，解锁剑魔再临；神雕重阳宫大战后，洗第三格武功，可选择洗天赋内功；神雕百花谷剧情后，洗第二格武功；射雕牛家村支线，可选择洗第三格武功和天赋内功；Ｗ华山绝顶支线剧情，可选择洗第五格武功"
	}
	
	TFJS[59] = {"Ｄ一片冰心",
	"Ｗ左右互搏发动几率70%",
	"Ｚ冷若天仙",
	"Ｗ使用玉女素心剑法高几率连击",
	"Ｎ",
	}
	FY[59] = {"Ｇ福缘奇遇",
	"Ｗ蜘蛛洞剧情过后学会左右互搏。"
	}
	
	TFJS[60] = {"Ｄ西毒",
	"Ｗ所有攻击无误伤",
	"Ｗ攻击时无视敌方毒抗强制上毒30点",
	"Ｗ蛤蟆功自动运功,蟾震九天效果加强，会根据蓄力值追加伤害",
	"Ｚ倒行逆施",
	"Ｗ集气时有小概率跳跃（集气值随机增加）",
	"Ｗ学会逆运后，被攻击必定进入【真.逆运经脉-走火入魔】状态",
	"Ｗ走火状态攻击/防御效果提高10%，加力/护体/出招几率大幅提高",
	"Ｗ走火状态无法休息，如体力低于20点，则停止走火",
	"Ｎ",
	
	}
	FY[60] = {"Ｇ福缘际遇",
	"Ｗ射雕明霞岛剧情后，洗第二格武功，天赋内功洗为逆运经脉；华山绝顶支线剧情，洗第三格武功"
	}
	
	TFJS[61] = {"Ｄ白驼少主",
	"Ｗ暴怒时，使用雪山白驼掌可触发灵蛇拳，击中的敌人集气进入波动状态20时序",
	"Ｎ",
	}
	
	TFJS[62] = {"Ｄ元蒙帝师",
	"Ｗ任何攻击追加2000点气攻",
	"Ｎ",
	}
	ZL[62] = {"Ｒ特色指令：龙象",
	"Ｗ使用后自动执行蓄力，并使下一次的攻击附加昏迷效果；昏迷的敌人将丧失一次行动机会",
	}
	FY[62] = {"Ｇ福缘际遇",
	"Ｗ神雕重阳宫大战，领悟龙象般若，第二格洗五轮大转；神正最终战，领悟十龙十象，第五格洗金刚不坏，第六格洗铁布衫"
	}
	
	TFJS[63] = {"Ｄ外和内刚",
	"Ｗ生命值低于50%时，攻击效果提升20%",
	"Ｚ青箫落瑛",
	"Ｗ使用玉箫剑法攻击，可杀敌内力300点",
	"Ｎ",
	
	}
	FY[63] = {"Ｇ福缘际遇",
	"Ｗ射雕正线牛家村剧情，洗第二、三格武功"
	}
	
	TFJS[64] = {"Ｄ返璞归真",
	"Ｗ左右互搏发动几率100%",
	"Ｚ顽童武痴",
	"Ｗ每行动一次，攻击效果提升10%",
	"Ｚ空明之武道",
	"Ｗ攻击时，有(25+实战/20)%几率使敌方无法触发内功护体",
	"Ｚ左右补偿（畅想主角专属）",
	"Ｗ发动左右互搏后，会根据资质补偿一次额外的左右机会",
	"Ｎ",
	}
	
	TFJS[65] = {"Ｄ南僧",
	"Ｗ使用一阳指，给敌方追加“无明业火”状态，持续30时序",
	"Ｗ处于“无明业火”状态的人攻击时，会损失50%内力消耗量的生命",
	"Ｗ攻击时高几率造成封穴",
	"Ｚ先天一阳",
	"Ｗ战斗中首次被击退可复活一次",
	"Ｗ回复70%生命值，部分状态，并立即行动",
	"Ｗ复活后，集气速度+5",
	"Ｚ不动明王",
	"Ｗ复活后，完全免疫敌方连击的伤害",
	"Ｎ",
	}
	
	TFJS[66] = {"Ｄ波斯圣女",
	"Ｗ敌全体移动减三格",
	"Ｗ可使用圣火神功攻击，并追加1200点气攻",
	"Ｎ",
	}
	ZL[66] = {"Ｒ特色指令：影步",
	"Ｗ标记自身周围一点，被攻击则移动至该处"
	}
	
	TFJS[67] = {"Ｄ铁掌帮主",
	"Ｗ使用任何武功高连击，高暴击",
	"Ｚ铁腿水上飘",
	"Ｗ移动步数+5",
	"Ｎ",
	}
	
	TFJS[68] = {"Ｄ长春子",
	"Ｗ华山观武后全真剑法威力翻倍",
	"Ｗ畅想专属，提高10%集齐速度",
	"Ｗ主运先天功，全真剑法概率变化七星剑法 增加150点伤害",
	"Ｚ天罡北斗阵·七星聚会",
	"Ｗ七子每存活一人集气速度+1",
	"Ｗ每行动一次，提升全真七子10%伤害减伤（七子每存活一人上限+10%）",
	"Ｎ",
	}	

	ZL[68] = {"Ｒ特色指令：止杀",
	"Ｗ每三个回合可发动一次；身边10格内敌人不可攻击一回合",
	}

	TFJS[69] = {"Ｄ北丐",
	"Ｗ使用降龙十八掌，40%几率发动【降龙.极意】",
	"Ｗ使用降龙十八掌攻击无误伤",
	"Ｗ自带“丐王真气”加力、护体，600威力，可叠加（几率与天书数、实战相关）",
	"Ｎ",
	}
	FY[69] = {"Ｇ福缘际遇",
	"Ｗ华山绝顶支线剧情，洗第三格武功，天赋内功洗为九阴神功，内力属性转为阴内"
	}
	TFJS[70] = {"Ｄ一空到底",
	"Ｗ暴怒时使用掌法攻击使敌我双方集气倒退10时序",
	"Ｎ",
    }
	TFJS[71] = {"Ｄ神龙教主",
	"Ｗ使用任何武功高连击，高暴击",
	"Ｚ豹胎易筋丸",
	"Ｗ在敌方要服用的药品中加入豹胎易筋丸，使其加血效果变为减血",
	"Ｎ",
	}
    
	TFJS[72] = {"Ｄ天龙掌门",
	"Ｗ无视兵器值需求装备『闯王军刀』",
	"Ｗ装备『闯王军刀』，攻击时必定附加流血效果",
	"Ｎ",
    }
	FY[72] = {"Ｇ福缘际遇",
	"Ｗ飞狐邪线杀苗人凤后，洗第一、二格武功，天赋外功洗为胡刀苗剑"}

	TFJS[73] = {"Ｄ琴铮盈盈",
	"Ｗ使用持瑶琴，必定发动“七弦无形剑气”，对敌方全体造成50+难度X10的伤害",
	"Ｚ日月圣姑",
	"Ｗ每时序回复自身5点中毒",
	"Ｎ",
	}
	TFJS[74] = {"Ｄ巾帼之才",
	"Ｗ我方全体防御效果提高10%",
	"Ｗ我方全体攻击效果提高10%",
	"Ｚ翠羽黄衫",
	"Ｗ自身增加我方存活人数X100的防御",
	"Ｎ",
	}
	ZL[74] = {"Ｒ特色指令：指挥",
	"Ｗ每二个回合可使用一次指挥指令，我方全体集气+500，并获得减伤＆增伤BUFF 50 时序，减伤效果为我方存活人数X5%",
	}
	
	TFJS[75] = {"Ｄ天池红花",
	"Ｗ升级时兵器值大幅提高",
	"Ｚ特技：庖丁解牛（畅想主角专属）",
	"Ｗ攻击时有50%几率无视敌方30%防御",
	"Ｚ香魂",
	"Ｗ被女性攻击伤害×150%，对女性攻击伤害×80%",
	"Ｎ",
	}
	
	TFJS[76] = {"Ｄ武中无相",
	"Ｗ无视限制条件修炼武学秘籍",
	"Ｗ初始自带100点武常",
	"Ｚ琅嬛仙子",
	"Ｗ作为主角时，初始五系兵器值提升至30点",
	"Ｚ妙法无形",
	"Ｗ在场时，我方全体攻击范围增加一格",
	"Ｚ御法绝尘",
	"Ｗ☆需要自身五系兵器值之和大于等于500",
	"Ｗ在场时，敌方全体攻击时不会出招式",
	"Ｎ",
    }
	FY[76] = {"Ｇ福缘际遇",
	"Ｗ获得凌波微步后，天赋轻功洗为凌波微步"
	}
	TFJS[77] = {"Ｄ珠联璧合",
	"Ｗ使用夫妻刀法无误伤",
	"Ｗ可装备专属武器鸯刀",
	"Ｚ秀外慧中",
	"Ｗ修炼武功秘籍时，兵器值成长翻倍",
	"Ｎ",
	
    }
	FY[77] = {"Ｇ福缘际遇",
	"Ｗ获得夫妻刀法，洗第一格武功"
	}
	
	TFJS[78] = {"Ｄ铁尸魔煞",
	"Ｗ华山观武后，九阴白骨爪威力增加50%",
	"Ｎ",
	}
	TFJS[79] = {"Ｄ慧中灵剑",
	"Ｗ每修炼一门剑法，攻击效果提升15%",
	"Ｗ每修炼一门剑法，初始集气+150",
	"Ｗ每修炼一门剑法，行动后回气+150",
	"Ｗ觉醒后使用剑法攻击，随机触发五岳神剑单系招式",
	"Ｎ",
	
	}
	FY[79] = {"Ｇ福缘际遇",
	"Ｗ笑傲福威镖局选择正邪剧情，洗第一、二、三格武功",
	}
	TFJS[80] = {"Ｄ勇猛精进",
	"Ｗ我方全体攻击效果提高10%",
	"Ｚ火手判官",
	"Ｗ攻击必定内伤，所造成内伤效果加倍",
	"Ｎ",
	}
	FY[80] = {"Ｇ福缘际遇",
	"Ｗ武当山偷太极三宝支线，洗第二、三格武功"
	}
	
	TFJS[81] = {"Ｄ雪岭双姝",
	"Ｗ战场上可发现食材",
	"Ｎ",
	}
	TFJS[82] = {"Ｄ玉面孟尝",
	"Ｗ战场上我方女性角色越多其攻击效果越高",
	"Ｎ",
	}
    
	TFJS[83] = {"Ｄ纤纤铁手",
	"Ｗ使用五毒神掌攻击，随机2-5倍威力",
	"Ｗ自带“红袖拂风”加力、护体，500威力，可叠加（几率与天书数、实战相关）",
	"Ｚ五毒教主",
	"Ｗ被攻击无视毒抗使攻击者中毒45~50点",
	"Ｗ用毒能力上限500",
	"Ｚ特技：含沙射影",
	"Ｗ暗器攻击范围提升至7×7方阵",
	"Ｎ",
	}
	TFJS[84] = {"Ｄ龙象之姿",
	"Ｗ觉醒后，面板上有龙象般若功，则自动运行龙象般若功",
	}
	TFJS[85] = {"Ｄ老谋深算",
	"Ｗ每过199时序，自动回满血内体并解除自身异常状态",
	"Ｚ妙手回春",
	"Ｗ被攻击时，有15%几率将受到的伤害转化为回血",
	"Ｗ医疗能力上限400",
	"Ｎ",
	
	}
	FY[85] = {"Ｇ福缘际遇",
	"Ｗ侠客邪线挑战石破天剧情，洗第二格武功，天赋内功洗为易筋经"
	}
	
	TFJS[86] = {"Ｄ金枝玉叶",
	"Ｗ敌方全体防御效果降低10%",
	"Ｎ",
	}
	TFJS[87] = {"Ｄ媚眼如丝",
	"Ｗ敌方全体攻击效果降低10%",
	"Ｎ",
	}
	TFJS[88] = {"Ｄ酒神",
	"Ｗ被攻击时有30%几率发动\"酒神秘踪步\"闪避",
	"Ｎ",
	
	}
	ZL[88] = {"Ｒ特色指令：传功",
	"Ｗ将五格范围内我方任一队友当前集气提升500点"
	}
	TFJS[89] = {"Ｄ食神",
	"Ｗ攻击不消耗体力",
	"Ｎ",
	}
	ZL[89] = {"Ｒ特色指令：气补",
	"Ｗ回复指定邻接队友体力50点"
	}
	
	TFJS[90] = {"Ｄ毓秀灵姝",
	"Ｗ攻击时必定造成流血",
	"Ｎ"
    }
	ZL[90] = {"Ｒ特色指令：灵貂",
	"Ｗ☆找到闪电貂后可激活；偷窃敌方携带的物品，并对其强制上毒50点",
	}
	FY[90] = {"Ｇ福缘际遇",
	"Ｗ天龙正线收段誉，洗第一格武功，天赋外功洗为六脉神剑"
	}
	TFJS[91] = {"Ｄ青青子衿",
	"Ｗ使用雷震剑法或金蛇剑法，附加怒气值X10的气攻",
	"Ｚ雷霆万钧",
	"Ｗ被攻击时30%几率对周身九格范围内敌人释放雷电并终止连击",
	"Ｗ根据自身御剑提升雷电伤害",
	"Ｎ",
	}
	FY[91] = {"Ｇ福缘际遇",
	"Ｗ金蛇山洞拔出金蛇剑，洗第一格武功"
	}
	--喵太极
	TFJS[92] = {"Ｄ指挥若定",
	"Ｗ在队伍中时，可以在战斗开始前布阵",
	"Ｚ扑朔迷离",
	"Ｗ所有攻击无误伤",
	"Ｗ与主角同时在场时，主角集气速度增加2点",
	"Ｗ战斗开始后的前三次被攻击不受伤害（需主角7书觉醒后）",
	"Ｗ时序恢复生命内力怒气、清除部分时停效果",
	"Ｗ行动前给敌人附加陷阱效果，自带葵花套",
	"Ｗ被攻击时根据自身御剑值减伤，恢复生命内力",
	"Ｗ被攻击时识破敌人行动，概率弹反敌人",
	"Ｗ怒气爆发时攻击概率斩杀敌人",
	"Ｎ",
	}
	FY[92] = {"Ｒ特色指令：换装",
	"Ｗ使用后改变自身外形，并将获得不同的内功"
	}
	
	TFJS[94] = {"Ｄ仁义刀",
	"Ｌ仁义无双",
	"Ｗ使用刀法必定单击，根据道德追加伤害",
	"Ｎ",
    }
    
	TFJS[95] = {"Ｄ柔云剑",
	"Ｌ以柔克刚",
	"Ｗ被攻击时，将一半杀气转化为回血",
	"Ｎ",
    }
    
	TFJS[96] = {"Ｄ冷月剑",
	"Ｌ两仪守护",
	"Ｗ被攻击时，降低64点伤害、降低640点气攻",
	"Ｎ",
    }
    
	TFJS[97] = {"Ｄ借刀杀人",
	"Ｗ血刀老祖在场全场误伤",
	"Ｚ诡谲",
	"Ｗ初始集气位置900，且移动+3格",
	"Ｚ血刀老祖",
	"Ｗ基础暴击率大幅度提高",
	"Ｎ",
    }

	TFJS[98] = {"Ｄ恶贯满盈",
	"Ｗ暴击攻击加成提升至200%",
	"Ｚ我被推了",
	"Ｗ自带“化子邋遢，观音长发”加力、护体，666威力，可叠加（几率与天书数、实战相关）",
	"Ｚ我当爹了",
	"Ｗ攻击/防御效果提高10%，加力/护体/出招几率大幅提高",
	"Ｗ无法休息",
	"Ｎ",
	}
	
	TFJS[99] = {"Ｄ无恶不作",
	"Ｗ暴击攻击加成提升至200%",
	"Ｚ带头大嫂",
	"Ｗ使用黄沙万里鞭必双击，伤害提升30%",
	"Ｎ",
	}
	TFJS[100] = {"Ｄ穷凶极恶",
	"Ｗ暴击攻击加成提升至200%",
	"Ｚ采阴补阳",
	"Ｗ攻击女性时，恢复造成伤害10%的血量（单次攻击吸血上限100点）",
	"Ｎ",
	}

	TFJS[101] = {"Ｄ笔砚生",
	"Ｗ自带“人生若只如初见”加力，300威力，可叠加（几率与天书数、实战相关）",
	"Ｗ自带“何事秋风悲画扇”护体，300威力，可叠加（几率与天书数、实战相关）",
	"Ｎ",
	}
	TFJS[102] = {"Ｄ双树枯荣",
	"Ｗ灼烧恢复能力加倍（时序恢复2点灼烧）",
	"Ｗ自带“枯荣真气”护体，600威力，可叠加（几率与天书数、实战相关）",
	"Ｗ攻击时几率追加600气攻，可叠加（几率与天书数、实战相关）",
	"Ｚ天龙禅师",
	"Ｗ使用一阳指高几率连击",
	"Ｎ",
	}
	TFJS[103] = {"Ｄ大轮明王",
	"Ｗ火焰刀法【大轮密宗·火焰刀】发动几率100%",
	"Ｗ自带“明王真气”加力、护体，600威力，可叠加（几率与天书数、实战相关）",
	"Ｎ",
	}
	ZL[103] = {"Ｒ特色指令：幻化",
	"Ｗ使用小无相功模拟天下武学，必须要拥有对应的秘籍"
	}
	TFJS[104] = {"Ｄ珠落玉盘",
	"Ｗ行动后提升我方全体100集气",
	"Ｎ",
	}
	TFJS[105] = {"Ｄ吴侬软语",
	"Ｗ行动前提升我方全体100集气",
	"Ｎ",
	}
	TFJS[106] = {"Ｄ金刀无敌",
	"Ｗ "
	}
	TFJS[107] = {"Ｄ华山门人",
	"Ｗ "
	}
	TFJS[108] = {"Ｄ华山门人",
	"Ｗ "
	}
	TFJS[109] = {"Ｄ华山门人",
	"Ｗ "
	}
	TFJS[110] = {"Ｄ聚贤庄主",
	"Ｗ "
	}
	TFJS[111] = {"Ｄ聚贤庄主",
	"Ｗ "
	}
	TFJS[112] = {"Ｄ天威奋烈",
	"Ｗ开场进入杀破狼状态",
	"Ｚ杀破狼",
	"Ｗ前三回合不会退出暴怒，基础攻防轻提高50%，杀气提高2000",
	--"Ｚ走火入魔",	
	"Ｚ怒火冲天",
	"Ｗ无视怒气上限，行动后怒气降低50点",
	"Ｎ",
	}
	TFJS[113] = {"Ｄ参合潜龙",
	"Ｗ斗转反击时，无视兵器值需求必定发动离合参商反击两次",
	"Ｗ自带“参合真气”加力、护体，600威力，可叠加（几率与天书数、实战相关）",
	--"Ｚ走火入魔",		
	"Ｚ蛇欲吞象",
	"Ｗ攻击时附带敌人陷入混乱",
	"Ｎ",
	}
	TFJS[114] = {"Ｄ达摩再世",
	"Ｗ内力上限9999，攻击无误伤",
	"Ｗ被攻击100%触发【天地独尊】，完全免疫杀气",
    "Ｗ攻击时被攻击时系数必然不低于敌人。",	
    "Ｚ化气无形",
    "Ｗ攻击时无视敌方50%气防",
	"Ｗ触发不动如山时，额外的伤害将转化为护盾",
	"Ｚ天佛化生",
    "Ｗ攻击时30%的概率触发【放下屠刀】降低目标伤害30%，持续一回合，无法叠加",
    "Ｗ暴怒攻击时触发【立地成佛】根据敌方当前怒气，造成封穴和内伤，清除敌方怒气",
	"Ｗ被攻击时触发【天佛化生·金刚护体】降低受到的伤害30%",
	"Ｎ",
    }
    
	TFJS[115] = {"Ｄ聪辩先生",
	"Ｗ无条件触发琴棋书画组合",
	"Ｎ",
	}
	TFJS[116] = {"Ｄ北冥极渊",
	"Ｗ内力上限9999",
	"Ｗ被攻击时必定发动北冥真气护体",
	"Ｚ畅想主角专属",
	"Ｗ作为畅想主角时变更为年轻时期潇洒容颜",
	"Ｗ主动攻击触发北冥神功吸内时，增加自身属性",
	"Ｚ风月无间",
	"Ｗ对男性伤害提高20%，被女性伤害减少20%",
	"Ｚ逍遥三老",
	"Ｗ面板上每多一个武功到极，天山折梅手威力+50",
	"Ｎ",
	}
	TFJS[117] = {"Ｄ转瞬红颜",
	"Ｗ每过99时序，自动回满血内体并解除自身异常状态",
	"Ｚ不老长春",
	"Ｗ被攻击时恢复80点生命",
	"Ｚ逍遥三老",
	"Ｗ面板上每多一个武功到极，天山折梅手威力+50",
	"Ｎ",
	}
	TFJS[118] = {"Ｄ无相转身（畅想主角专属）",
	"Ｗ被攻击时几率触发，免疫本次攻击并获得一次移动机会",
	"Ｗ移动后会在自身位置留下一个幻象",
	"Ｗ幻象生命为1点，且无法攻击",
	"Ｗ幻象消失前，不会再次触发无相转身",
	"Ｚ秋水无尘",
	"Ｗ自身集气速度不受异常状态影响",
	"Ｚ逍遥三老",
	"Ｗ面板上每多一个武功到极，天山折梅手威力+50",
	"Ｎ",
	}
	TFJS[119] = {"Ｄ渔",
	"Ｗ一灯在场时由师父承担一半伤害",
	"Ｎ",
	}
	TFJS[120] = {"Ｄ樵",
	"Ｗ一灯在场时由师父承担一半伤害",
	"Ｎ",
	}
	TFJS[121] = {"Ｄ耕",
	"Ｗ一灯在场时由师父承担一半伤害",
	"Ｎ",
	}
	TFJS[122] = {"Ｄ读",
	"Ｗ一灯在场时由师父承担一半伤害",
	"Ｎ",
	}
	TFJS[123] = {"Ｄ丹阳子",
	"Ｗ华山观武后全真剑法威力翻倍",
	"Ｗ畅想专属，提高10%集齐速度",
	"Ｗ先天功气血、内力回复翻倍",
	"Ｚ天罡北斗阵·七星聚会",
	"Ｗ七子每存活一人集气速度+1",
	"Ｗ每行动一次，提升全真七子10%伤害减伤（七子每存活一人上限+10%）",
	"Ｎ",
	}
	TFJS[124] = {"Ｄ长真子",
	"Ｗ华山观武后全真剑法威力翻倍",
	"Ｚ天罡北斗阵·七星聚会",
	"Ｗ七子每存活一人集气速度+1",
	"Ｗ每行动一次，提升全真七子10%伤害减伤（七子每存活一人上限+10%）",
	"Ｎ",
	}
	TFJS[125] = {"Ｄ长生子",
	"Ｗ华山观武后全真剑法威力翻倍",
	"Ｚ天罡北斗阵·七星聚会",
	"Ｗ七子每存活一人集气速度+1",
	"Ｗ每行动一次，提升全真七子10%伤害减伤（七子每存活一人上限+10%）",
	"Ｎ",
	}
	TFJS[126] = {"Ｄ玉阳子",
	"Ｗ华山观武后全真剑法威力翻倍",
	"Ｚ天罡北斗阵·七星聚会",
	"Ｗ七子每存活一人集气速度+1",
	"Ｗ每行动一次，提升全真七子10%伤害减伤（七子每存活一人上限+10%）",
	"Ｎ",
	}
	TFJS[127] = {"Ｄ广宁子",
	"Ｗ华山观武后全真剑法威力翻倍",
	"Ｚ天罡北斗阵·七星聚会",
	"Ｗ七子每存活一人集气速度+1",
	"Ｗ每行动一次，提升全真七子10%伤害减伤（七子每存活一人上限+10%）",
	"Ｎ",
	}
	TFJS[128] = {"Ｄ清净散人",
	"Ｗ华山观武后全真剑法威力翻倍",
	"Ｚ天罡北斗阵·七星聚会",
	"Ｗ七子每存活一人集气速度+1",
	"Ｗ每行动一次，提升全真七子10%伤害减伤（七子每存活一人上限+10%）",
	"Ｎ",
	}
	
	TFJS[129] = {"Ｄ中神通",
	"Ｗ华山观武后，全真剑法威力翻倍",
	"Ｗ使用全真剑法，60%几率发动重阳剑气，追加777气攻",
	"Ｗ攻击时高几率造成封穴",
	"Ｗ先天功自动运功",
	"Ｚ神通技·重阳再现",
	"Ｗ战斗中首次被击退可复活一次",
	"Ｗ回复70%生命值，部分状态，并立即行动",
	"Ｗ复活后，集气速度+5",
	"Ｚ神通技·北斗七闪",
	"Ｗ发动重阳再现后，自身进入北斗真打状态",
	"Ｗ获得两本天书后习得第一层效果之后每获得两本天书增加一层，共七层",
	"Ｗ层数即代表可维持真打状态的轮数",
	"Ｗ自身每行动一次减少一层，耗完即消去真打状态",	
	"Ｗ在真打状态下，全程怒气爆发",	
	"Ｗ必定发动内功加力且气攻值增幅",		
	"Ｚ神通技·一气化三清",
	"Ｗ攻击时机率发动“中神通.一气化三清” 1.2倍伤害",
	"Ｚ神通技·同归剑法",
	"Ｗ攻击时40%发动“同归剑法”为对方添加一个回合“同归”BUFF，",
	"Ｗ处于“同归”状态的人攻击时，会损失伤害同等的生命",
	"Ｎ",
	}
	TFJS[130] = {"Ｄ飞天蝙蝠",
	"Ｗ自动主运飞天神行",
	"Ｚ同生共死",
	"Ｗ被攻击时由江南七怪共同承担伤害",
	"Ｗ江南七怪每多一人在场，气防加400",
	"Ｎ",
	}
	TFJS[131] = {"Ｄ妙手书生",
	"Ｗ使用妙手空空攻击，可盗取敌方身上携带的物品",
	"Ｌ同生共死",
	"Ｗ被攻击时由江南七怪共同承担伤害",
	"Ｗ江南七怪每多一人在场，气防加400",
	"Ｎ",
	}
	TFJS[132] = {"Ｄ马王神",
	"Ｌ同生共死",
	"Ｗ被攻击时由江南七怪共同承担伤害",
	"Ｗ江南七怪每多一人在场，气防加400",
	"Ｎ",
	}
	TFJS[133] = {"Ｄ南山樵子",
	"Ｌ同生共死",
	"Ｗ被攻击时由江南七怪共同承担伤害",
	"Ｗ江南七怪每多一人在场，气防加400",
	"Ｎ",
	}
	TFJS[134] = {"Ｄ笑弥陀",
	"Ｌ同生共死",
	"Ｗ被攻击时由江南七怪共同承担伤害",
	"Ｗ江南七怪每多一人在场，气防加400",
	"Ｎ",
	}
	TFJS[135] = {"Ｄ闹市侠隐",
	"Ｌ同生共死",
	"Ｗ被攻击时由江南七怪共同承担伤害",
	"Ｗ江南七怪每多一人在场，气防加400",
	"Ｎ",
	}
	TFJS[136] = {"Ｄ越女剑",
	"Ｌ同生共死",
	"Ｗ被攻击时由江南七怪共同承担伤害",
	"Ｗ江南七怪每多一人在场，气防加400",
	"Ｎ",
	}
	
	TFJS[137] = {"Ｄ青蟒剑",
	"Ｗ金蛇剑法伤害降低25%",
	"Ｎ",
	}
	TFJS[138] = {"Ｄ一指镇江南",
	"Ｗ指系武功威力随天书提高",
	"Ｎ",
	}
	
	TFJS[139] = {"Ｄ延平郡王",
	"Ｗ "
	}

	TFJS[140] = {"Ｄ剑术通神",
	"Ｗ攻击和被攻击时，无论任何系，均按敌我御剑系数计算加成",
	"Ｚ无招胜有招",
	"Ｗ暴怒时，使用独孤九剑攻击，追加1000点气攻，和10时序的静止状态，可叠加",
	"Ｚ无我无剑",
	"Ｗ自带100武常。",	
	"Ｗ初始集气1000。",
	"Ｗ被攻击先手反击。",
	"Ｚ九剑真传",
	"Ｗ被攻击与攻击触发九剑真传。",
	"Ｎ",
	}
	
	
	TFJS[141] = {"Ｄ夺命三仙",
	"Ｗ使用剑法连击时变为三连击",
	"Ｎ",
	}
	TFJS[142] = {"Ｄ狂风快剑",
	"Ｗ使用剑法攻击，下回合集气+100",
	"Ｎ",
	}
	TFJS[143] = {"Ｄ桃谷六仙",
	"Ｗ "
	}
	TFJS[144] = {"Ｄ桃谷六仙",
	"Ｗ "
	}
	TFJS[145] = {"Ｄ桃谷六仙",
	"Ｗ "
	}
	TFJS[146] = {"Ｄ桃谷六仙",
	"Ｗ "
	}
	TFJS[147] = {"Ｄ桃谷六仙",
	"Ｗ "
	}
	TFJS[148] = {"Ｄ桃谷六仙",
	"Ｗ "
	}
	TFJS[149] = {"Ｄ少林掌门",
	"Ｗ无视限制条件修炼金刚不坏体",
	"Ｚ特技：千手如来掌",
	"Ｗ使用拳法攻击时，攻击范围增加一格",
	"Ｗ使用般若掌法即可触发金刚般若特效",
	"Ｚ特技：易筋经大成",
	"Ｗ免疫敌方三大吸功的吸内效果",
	"Ｗ少林铜人宝箱战斗胜利后觉醒，易筋自动运功",
	"Ｗ洗第三格为易筋经",
	"Ｎ",
	}
	TFJS[150] = {"Ｄ一剑无血",
	"Ｗ攻击不会造成流血",
	"Ｎ",
    }
    
	--文泰来
	TFJS[151] = {"Ｄ奔雷手",
	"Ｗ暴怒攻击概率触发雷动九天，为目标添加一层雷音BUFF，对大于等三层雷音BUFF的目标击晕一回合",
	"Ｚ否极泰来",
	"Ｗ每过50时序激活一次【否极泰来】，免疫死亡伤害20时序",
	"Ｗ生命越低防御跟伤害越高，怒气回复越快",
	"Ｎ",	
    }	
	
	TFJS[152] = {"Ｄ追魂夺命剑",
	"Ｗ生命值低于50%时连击率两倍，生命值低于25%时连击率三倍",
	"Ｚ连环迷踪腿",
	"Ｗ行动后50%几率使用“连环迷踪腿”攻击周身五格敌人，根据自身腿法造成伤害",
	"Ｚ自断一臂",
	"Ｗ无法学会左右互博",
	"Ｎ",
	}
	TFJS[153] = {"Ｄ千臂如来",
	"Ｗ初始暗器值200点",
	"Ｚ暗器之王",
	"Ｗ战斗胜利后随机获得暗器",
	"Ｎ",
	}
	TFJS[154] = {"Ｄ鸳鸯刀",
	"Ｗ战场上我方男性角色越多其攻击效果越高",
	"Ｎ",
	}
	TFJS[155] = {"Ｄ黑无常",
	"Ｗ攻击时伤害随机增加1%~25%",
	"Ｎ",
	}
	TFJS[156] = {"Ｄ白无常",
	"Ｗ被攻击时受到伤害随机减少1%~25%",
	"Ｎ",
	}
	
	TFJS[157] = {"Ｄ湘西尸王",
	"Ｗ华山观武后鹤蛇八打威力翻倍",
	"Ｎ",
	}
	TFJS[158] = {"Ｄ波斯大贾",
	"Ｗ作为畅想主角时开局获得一万银两",
	"Ｎ",
	}
	TFJS[159] = {"Ｄ释迦掷象功",
	"Ｗ必定单击，伤害永久提高1.5倍（天赋外功与如雷的额外连击有效）",
	"Ｎ",
	}
	TFJS[160] = {"Ｄ尊师重道",
	"Ｗ连击数越低，暴击率与暴击伤害越高",
	"Ｎ",
	}
	ZL[160] = {"Ｒ特色指令：死战",
	"Ｗ锁定一名敌人，至其死亡之前，达尔巴对其的攻击效果提高50%，且必定命中，在目标死亡之前无法更换目标"
	}
	
	TFJS[161] = {"Ｄ赤练仙子",
	"Ｗ五毒神掌变为赤练神掌，追加70点伤害，并强制上毒20点，引爆目标身上毒素",
	"Ｗ对男性增伤10%",	
	"Ｚ情为何物",
	"Ｗ每隔50时序，随机向敌人发射三枚冰魄银针",
	"Ｎ",
	}
	FY[161] = {"Ｇ福缘际遇",
	"Ｗ神雕邪线古墓密道剧情，洗第二、三格武功，天赋内功洗为玉女心经"
	}
	
	TFJS[162] = {"Ｄ一日不过三",
	"Ｗ敌方全体集气-3",
	"Ｚ不三不四",
	"Ｗ丁不三丁不四同时在场，敌方全体集气-10",
	"Ｎ",
	}
	TFJS[163] = {"Ｄ一日不过四",
	"Ｗ敌方全体集气-4",
	"Ｚ不三不四",
	"Ｗ丁不三丁不四同时在场，敌方全体集气-10",
	"Ｎ",
	}
	TFJS[164] = {"Ｄ摩天居士",
	"Ｗ自带“摩天居士”护体（500威力，可叠加）几率与天书数、实战有关",
	"Ｚ亦正亦邪",
	"Ｗ道德高于59，攻击效果提高20%",
	"Ｗ道德低于61，防御效果提高20%",
	"Ｚ碧针清掌",
	"Ｗ行动后使用“碧针清掌”攻击周身七格敌人，造成拳掌系数/5的伤害",	
	"Ｗ敌方全体集气-10",
	"Ｎ",
	}
	TFJS[165] = {"Ｄ子柳传人",
	"Ｗ "
	}
	TFJS[166] = {"Ｄ太上掌门",
	"Ｗ "
	}
	TFJS[167] = {"Ｄ崆峒五老",
	"Ｗ使用七伤拳必定内伤，追加777点伤害和杀气，扣除自身7%生命内力",
	"Ｎ",
	}
	TFJS[168] = {"Ｄ崆峒五老",
	"Ｗ使用七伤拳必定内伤，追加777点伤害和杀气，扣除自身7%生命内力",
	"Ｎ",
	}
	TFJS[169] = {"Ｄ四大神僧",
	"Ｗ使用般若掌时自动进入蓄力状态",
	"Ｎ",
	}
	TFJS[170] = {"Ｄ四大神僧",
	"Ｗ使用大力金刚指或龙爪手时自动进入等待状态",
	"Ｎ",
	}
	TFJS[766] = {"Ｄ四大神僧",
	"Ｗ使用大力金刚掌后进入防御状态",
	"Ｎ",
	}

	TFJS[171] = {"Ｄ武当儒侠",
	"Ｗ使用太极拳或太极剑攻击后自动进入防御状态",
	"Ｚ鸡飞蛋打",
	"Ｗ暴怒时使用虎爪绝户手触发奥义，对男性造成毁灭性创伤",
	"Ｎ",
	}
	TFJS[172] = {"Ｄ武当七侠",
	"Ｗ",
	"Ｎ",
	--"Ｌ天赋内功",
	--"Ｗ修炼纯阳无极功与九阳神功一脉相承后，天赋内功变为九阳神功"
	}
	TFJS[173] = {"Ｄ波斯风使",
	"Ｗ集气时有40%几率集气值增加20",
	"Ｎ",
	}
	TFJS[174] = {"Ｄ波斯云使",
	"Ｗ集气时有40%几率集气值增加20",
	"Ｎ",
	}
    TFJS[175] = {"Ｄ波斯月使",
	"Ｗ集气时有40%几率集气值增加20",
	"Ｎ",
	}
	
	TFJS[176] = {"Ｄ五毒教姑",
	"Ｗ被攻击使攻击者中毒20点，降低攻击者5点体力，200点内力",
	"Ｎ",
	}
	TFJS[182] = {"Ｄ五丁手",
	"Ｗ "
	}
	TFJS[183] = {"Ｄ没影子",
	"Ｗ使用剑法攻击追加100点真实伤害，如装备武器，则此加成减半",
	"Ｎ",
	}
	TFJS[184] = {"Ｄ护国真人",
	"Ｚ铁血大旗门(畅想专享)",
	"Ｗ在迷之少女处修炼铁剑铁掌到极，领悟嫁衣神功，人物等级变为一级",
	"Ｎ",
	}
	TFJS[185] = {"Ｄ神剑仙猿",
	"Ｗ攻击时高几率造成封穴",
	"Ｗ等待时自动蓄力（无法触发龙象蓄力等效果）",
	"Ｎ",
	}
	TFJS[186] = {"Ｄ神拳无敌",
	"Ｗ使用拳法攻击追加100点真实伤害，如未装备武器，则此加成翻倍",
	"Ｎ",
	}
	TFJS[187] = {"Ｄ八面威风",
	"Ｗ "
	}
	TFJS[188] = {"Ｄ铜笔铁算盘",
	"Ｗ "
	}
	TFJS[189] = {"Ｄ晋阳大侠",
	"Ｗ连击率与暴击率+50%。",
	"Ｗ攻击时必触发“混元一气”造成敌全体内伤。增加1000气功",
	"Ｚ混元炁",
	"Ｗ混元功自动运功，混元功范围+1",
	"Ｚ仁者无敌",
	"Ｗ拥有仁者二次判定，特效+10。 ",  
	"Ｚ半和太监",
	"Ｗ修炼葵花宝典没有惩罚，可以使用葵花神功攻击 。",	
	"Ｗ笑邪击败葵花尊者天内洗葵花神功，",
	"Ｎ",
	}
    --"致命", "切返", "居合", "秘剑·切返", "斩流·切返"
	TFJS[596] = {"Ｄ一刀流少主",
	"Ｗ无距境：触发剑步前15时序无视一切集气压制效果",  
	}
	TFJS[501] = {"Ｄ一刀流宗主",
	"Ｗ不坏身：触发剑步前15时序无敌，不吃任何削减生命、内力、体力效果", 
	}
	
	TFJS[592] = {"Ｄ料敌先机",
	"Ｗ进入战斗的初始集气位置为1000，自身移动步数锁定为10格，免疫暗器",
	"Ｚ剑道神话",
	"Ｗ使用剑法攻击与被攻击必触发<剑魔再临>/<九剑真传>特效。",
    "Ｗ战斗中，个人武常计算结果必定不会低于敌方，集气速度锁定全场最高",	
	"Ｎ",
	}
	BOSSZT[592] = {"Ｇ剑魔",
	"Ｗ每次攻击自身剑势增加一层，最大十层，攻击人数随剑势而变化，每层剑势增加5%伤害和10%减伤（BOSS状态无减伤上限）；被攻击时无法被连击，同一类型的武功无法重复造成伤害；被攻击时需按照指破拳、剑破指、刀破剑、奇破刀、拳破奇的顺序攻击，破招后造成的伤害增加20%，剑势降低一层，反之增加一层剑势；剑势十层时，攻击后恢复500生命，1000内力，50内伤，50中毒",
	}
	TFJS[510] = {"Ｄ曲夕烟隙",
	"Ｗ30%概率触发“曲夕烟隙”混乱目标，使目标随机移动",
	"Ｚ曲径通幽",
	"Ｗ持瑶琴威力翻倍，攻击时30%概率触发“曲径通幽”必中",
	"Ｎ",
	}
	
	TFJS[511] = {"Ｄ盗圣",
	"Ｗ攻击时随机窃取敌方一项可用状态，若为通用状态则可转给自身",
	"Ｗ拥有龟息功全部效果",
	"Ｚ隔空点穴",
	"Ｗ造成封穴时，封穴增加10点，被攻击时对目标造成10点封穴",
	"Ｚ踏雪无痕",
	"Ｗ移动距离增加2格",
	"Ｎ",
	}

	TFJS[532] = {"Ｄ武当七侠",
	"Ｚ真武七截阵·龟蛇二将",
	"Ｗ七侠每存活一人集气速度+1",
	"Ｗ每行动一次，提升武当七侠10%伤害减伤（七侠每存活一人上限+10%）",
	"Ｎ",
	}
	TFJS[533] = {"Ｄ武当七侠",
	"Ｚ真武七截阵·龟蛇二将",
	"Ｗ七侠每存活一人集气速度+1",
	"Ｗ每行动一次，提升武当七侠10%伤害减伤（七侠每存活一人上限+10%）",
	"Ｎ",
	}
	TFJS[534] = {"Ｄ武当七侠",
	"Ｚ真武七截阵·龟蛇二将",
	"Ｗ七侠每存活一人集气速度+1",
	"Ｗ每行动一次，提升武当七侠10%伤害减伤（七侠每存活一人上限+10%）",
	"Ｎ",
	}
	TFJS[535] = {"Ｄ武当七侠",
	"Ｚ真武七截阵·龟蛇二将",
	"Ｗ七侠每存活一人集气速度+1",
	"Ｗ每行动一次，提升武当七侠10%伤害减伤（七侠每存活一人上限+10%）",
	"Ｎ",
	}
	TFJS[536] = {"Ｄ武当七侠",
	"Ｚ真武七截阵·龟蛇二将",
	"Ｗ七侠每存活一人集气速度+1",
	"Ｗ每行动一次，提升武当七侠10%伤害减伤（七侠每存活一人上限+10%）",
	"Ｎ",
	}
	TFJS[537] = {"Ｄ武当七侠",
	"Ｚ真武七截阵·龟蛇二将",
	"Ｗ七侠每存活一人集气速度+1",
	"Ｗ每行动一次，提升武当七侠10%伤害减伤（七侠每存活一人上限+10%）",
	"Ｎ",
	}
	TFJS[538] = {"Ｄ武当七侠",
	"Ｚ真武七截阵·龟蛇二将",
	"Ｗ七侠每存活一人集气速度+1",
	"Ｗ每行动一次，提升武当七侠10%伤害减伤（七侠每存活一人上限+10%）",
	"Ｎ",
	}
	--解风
	TFJS[458] = {"Ｄ入木三分",
	"Ｗ指系武功必破防30%",
	"Ｎ",
	}
	--陆菲青
	TFJS[570] = {"Ｄ绵里针",
	"Ｗ被攻击时20%几率通过四两拨千斤化解，并用暗器反击敌人",
	"Ｎ",
	}
	--卓不凡
	TFJS[565] = {"Ｄ十里坡剑神",
	"Ｗ每行动一次，攻击效果提升2%",
	"Ｎ",
	}
	--观止
	TFJS[456] = {"Ｄ暴怒河豚",
	"Ｗ自带海量反弹，华山后山学会大山毒阵",
	"Ｚ飞翔的荷兰人",
	"Ｗ御气纵横触发特效缩短为9时序一次",
	"Ｗ飞的太快了时序损失最大生命值9%",
	"Ｚ九命猫",
	"Ｗ每99时序向天借命一次",
	"Ｗ身负暗疾，攻击时会损失当前三分之一",
	"Ｎ",
	}
	--点点
	TFJS[457] = {"Ｄ剑邪",
	"Ｚ剑道尘心",
	"Ｗ自带破尽天下，30%概率触发破尽范围免疫攻击",
	"Ｗ自带极死·七夜被攻击为敌人附加时序流血，再次被攻击引爆造成伤害",
	"Ｚ剑之道",
	"Ｗ笑傲邪线华山剧情后觉醒五岳神剑精髓",
	"Ｗ笑傲邪线剧情后觉醒剑界剑步及剑煞，主运葵花即可触发葵花组合特效",
	"Ｗ玉笔锋与独孤论剑后，觉醒剑荡十方，学会剑荡十方后攻击自带玄铁剑劲",
	"Ｗ武当后殿与张三丰论剑后，觉醒太极剑体",
	"Ｗ天上人间与黄药师论剑后，觉醒玉箫剑意",
	"Ｗ昆仑仙境对战阿青后，阿青传授碧落九重剑",
	"Ｗ武道大会后赋闲书架领悟空之境界",
	"Ｎ",
	}
	FY[457] = {"Ｇ福缘际遇",
	"Ｗ笑傲邪线福威镖局剧情后，洗一格武功及天外;笑傲邪线击败东方不败，洗二、三格武功及天内、轻;避暑山庄vip区踩地板观察对话有惊喜;后期日月神教、夜雨楼特殊剧情二选一（尚未完善）"
	}
	
	--云灏
	TFJS[748] = {"Ｄ独孤求胜",
	"Ｗ天地玄黄四大神探收养的少年，四大神探每人传授云灏一招绝学",
	"Ｚ天上有敌",
	"Ｗ云灏行动前随机劈下一道敌我不分的惊雷，造成云灏最大生命值的20%伤害",
	"Ｚ地府之下",
	"Ｗ行动后都会均衡自身的生命、内力、体力，将自己三项较低的部分趋向最高的部分",
	"Ｚ玄之又玄",
	"Ｗ当该次受到的伤害大于云灏当前生命时，云灏有一半的固定概率免疫非阴间部分伤害，并反弹一半伤害",
	"Ｚ黄金万两",
	"Ｗ云灏初始自带三枚商会令牌，击杀敌人获得银两",
	"Ｎ",
	}

	--慕容龙城
	TFJS[529] = {"Ｄ幻梦星辰",
	"Ｗ自带慕容家绝学",
	"Ｚ畅想主角专属",
	"Ｗ天龙邪线，获得天书后，带小慕容击败扫地僧后，寻回失去的记忆",
	"Ｎ",
	}
	TFJS[590] = {"Ｄ心秀天铃",
	"Ｗ使用奇门武功，有（天书数x2+实战/25）%的几率发动“心秀天铃·星月争辉”，追加800点气攻，如已有14本天书，则触发此特效必破气防",
	"Ｚ古道西风",
	"Ｗ装备白马时的集气加成效果翻倍",
	"Ｚ畅想主角专属",
	"Ｗ每修炼一个奇门武功到极，集气速度+2（上限7个）",
	"Ｎ",
	}
	--宝象
	TFJS[595] = {"Ｄ一龙一象",
	"Ｗ提升10%伤害，降低10%承受伤害",
	"Ｎ",
	}
	--渡厄
	TFJS[597] = {"Ｄ金刚伏魔",
	"Ｗ三渡每多一人在场，额外提升1000点气防",
	"Ｗ三渡每多一人在场，额外追加200点伤害",
	"Ｗ移动步数变为一格",
	"Ｎ",
	}
	--渡劫
	TFJS[598] = {"Ｄ金刚伏魔",
	"Ｗ三渡每多一人在场，额外提升1000点气防",
	"Ｗ三渡每多一人在场，额外追加200点伤害",
	"Ｗ移动步数变为一格",
	"Ｎ",
	}
	--渡难
	TFJS[599] = {"Ｄ金刚伏魔",
	"Ｗ三渡每多一人在场，额外提升1000点气防",
	"Ｗ三渡每多一人在场，额外追加200点伤害",
	"Ｗ移动步数变为一格",
	"Ｎ",
	}
	--韦小宝
	TFJS[601] = {"Ｄ机敏无双",
	"Ｗ战斗开始前50时序，受到的伤害不超过50点",
	"Ｎ",
	}
	ZL[601] = {"Ｒ特色指令：口才",
	"Ｗ使一名敌方进入沉睡状态，此状态无法集气，不会自行解除，受到攻击会醒来",
	}
	FY[601] = {"Ｇ福缘际遇",
	"Ｗ鹿鼎记鳌府密室剧情，洗第一、二格武功"
	}
	--海大富
	TFJS[602] = {"Ｄ阴阳怪气",
	"Ｗ使用化骨绵掌削弱敌方体力内力",
	"Ｎ",
	}
	--鳌拜
	TFJS[603] = {"Ｄ满洲勇士",
	"Ｗ满洲摔跤威力翻倍，使敌人无法移动一回合",
	"Ｚ十三太保横练",
	"Ｗ免疫破绽，免疫杀气，受到伤害降低13%",
	"Ｚ缩阳入腹",	
	"Ｗ主运金刚不坏体，必定发动\"金刚不坏\"特效",
	"Ｎ",
	}
	--阿青
	TFJS[604] = {"Ｄ天元剑气",
	"Ｗ使用剑系武功攻击时，敌方御剑系数按零计算",
	--"Ｌ听风辨位",
	--"Ｗ无视敌方的闪避效果（包括刺目，轻功，天赋等）",
	--"Ｎ",
	"Ｚ越女剑仙",
	"Ｗ使用越女剑法攻击无误伤",
	"Ｗ每次行动前解除自身所有异常",
	"Ｗ自带“九霄仙息”护体，增加自身御剑系数×5点气防",
	"Ｗ战场中增加自身御剑系数点攻防值",
	"Ｎ",	
	}
	FY[604] = {"Ｇ福缘际遇",
	"Ｗ侠客行天书获得太玄时，第二格洗太玄神功"	
	}
	
	TFJS[605] = {"Ｄ惊才绝艳",
	"Ｗ武功威力提高10%，加力/护体/出招几率提高10%，总气攻提高10%",
	"Ｚ姑射仙姿",
	"Ｗ被攻击时必发动\"轻云蔽月\"，免疫攻击10时序，冷却时间50时序",
	"Ｗ攻击时几率发动\"流风回雪\"，本次攻击必定造成冰封",
	"Ｎ",
	}
	--阿凡提
	TFJS[606] = {"Ｄ踏沙无痕",
	"Ｗ移动格数+3，攻击后可以再次移动",
	"Ｚ西域战神",
	"Ｗ拥有专属坐骑毛驴",
	"Ｗ休息时自带蓄力兼防御效果",
	"Ｎ",
	}
	--焦宛儿
	TFJS[607] = {"Ｄ乱世浮萍",
	"Ｗ我方全体连击率提高10%",
	"Ｎ",
	}
	--赵敏
	TFJS[609] = {"Ｄ机智多谋",
	"Ｗ在场时，我方全体获得如下光环：",
	"Ｗ处于蓄力状态时，增加自身20%减伤（蓄力必定成功）",
	"Ｗ处于防御状态时，有20%几率闪避",
	"Ｚ绍敏郡主",
	"Ｗ被攻击时，反弹30%受到的攻击伤害",
	"Ｎ",
	}
	FY[609] = {"Ｇ福缘际遇",
	"Ｗ神雕邪线襄阳剧情，洗第二格武功，天赋内功洗为天魔功"}
	--公孙止
	TFJS[616] = {"Ｄ绝情谷主",
	"Ｗ本方每阵亡一名队友，集气速度增加6点",
	"Ｚ特技：闭穴功",
	"Ｗ受到的封穴降低50%",
	"Ｎ",
	}
	--裘千尺
	TFJS[617] = {"Ｄ铁掌莲花",
	"Ｗ作为畅想主角时可以获得年轻漂亮的头像贴图",
	"Ｎ",
	}
	--郭襄
	TFJS[626] = {"Ｄ小东邪",
	"Ｗ无需修炼桃花三宝，即可触发桃花绝技",
	"Ｚ魔音·碧海潮生曲",
	"Ｗ攻击时发动碧海潮生曲,第一击扣除全体敌人内力250",
	"Ｗ觉醒后享受以下特效：",
	"Ｚ峨眉祖师",
	"Ｗ领悟“无上瑜伽密乘”，身娇腰柔易推倒，同时拥有阴、阳、调和三种内力属性的特性",
	"Ｎ",
	}
	ZL[626] = {"Ｒ特色指令：玲珑",
	"Ｗ可自由切换第一格武功为弹指神通/玉萧剑法/落英神剑掌，不消耗回合"
	}
	
	--蒙哥
	TFJS[627] = {"Ｄ王霸之气",
	"Ｗ敌方全体集气减半",
	"Ｎ",
	}
	--神雕
	TFJS[628] = {"Ｄ雕兄",
	"Ｗ使用玄铁剑法时，有几率发动重剑真传",
	"Ｚ大鹏展翅",
	"Ｗ使用玄铁剑法时，攻击范围变为可移动",
	"Ｚ鹏程万里",
	"Ｗ移动格数+3",
	"Ｎ",
	}
	--神雕
	TFJS[530] = {"Ｄ雕兄",
	"Ｗ使用玄铁剑法时，有几率发动重剑真传",
	"Ｚ大鹏展翅",
	"Ｗ使用玄铁剑法时，攻击范围变为可移动",
	"Ｚ鹏程万里",
	"Ｗ移动格数+3",
	"Ｎ",
	}
	--阿九
	TFJS[629] = {"Ｄ长平公主",
	"Ｗ每次行动前有60%几率使敌方全体集气位置倒退150",
	"Ｗ暴怒时集气免疫封穴且不受异常状态影响",		
	"Ｚ浴火凤凰(畅想单通专享)",
	"Ｗ华山击败玉真子觉醒领悟：",
	"Ｗ“凤鸣九霄”：满怒触发范围伤害。",
	"Ｗ“凤凰涅槃”：机率触发杀气减999，伤害变为99，"	,
	"Ｗ“浴火重生”：机率复活一次",	
	"Ｎ",
	
	}
	FY[629] = {"Ｇ福缘际遇",
	"Ｗ获得“神行百变”第三格洗神百变1级",
	}
	
	--周芷若
	TFJS[631] = {"Ｄ秀若芝兰",
	"Ｗ面板上每个外功增加5点集气，每个内功、轻功增加5%减伤，最大50%减伤",
	"Ｚ谁与争锋",
	"Ｗ装备『倚天剑』时，全部剑法威力+200",
	"Ｗ使用九阴白骨爪，攻击时无视敌方毒抗",
	"Ｎ",
	}
	FY[631] = {"Ｇ福缘际遇",
	"Ｗ倚天邪线少林剧情，可选择洗第一格武功；第二格武功及天赋内功洗为九阴神功",
	"Ｗ倚天邪线三渡剧情，坚持50时序洗左右互搏",
	}
	--逍遥子
	TFJS[634] = {"Ｄ武道神仙",
	"Ｗ自带所有内功组合效果，且必定触发",
	--"Ｗ减伤30%伤害并用双倍内力抵消伤害值",
	--"Ｗ击败无崖子直接激活“逍遥御风”(不需学小无相/八荒/北冥)",
	"Ｚ逍遥祖师",
	"Ｗ必发动“梅花三弄”特效之一",
	"Ｗ梅花一弄：造成散功30时序",
	"Ｗ梅花二弄：减少敌方当前内力值的5%",
	"Ｗ梅花三弄：忽视绝对气防",	  	
	"Ｎ",
	}	
	--李白
	TFJS[636] = {"Ｄ青莲剑仙",
	"Ｗ自带青莲剑法高连",
	"Ｗ“谪仙观气”攻击与被攻击发动，兵器值不会低于对方",	
    "Ｚ侠客行",
	"Ｗ“十步杀一人”：击退敌人发动可再次行动",
	"Ｗ“深藏身与名”：攻击后概率20时序闪避攻击",  		
    "Ｚ绝技：青莲剑歌",
	"Ｗ华山后山觉醒后领悟",
	"Ｗ 青莲剑歌·长风当歌剑当扬 ：满怒剑法攻击发动大范围伤害附加御剑值伤害并给目标添加“创伤”DEBUFF,依流血值额外时序扣除生命",
	"Ｎ",
	}
	FY[636] = {"Ｇ福缘奇遇",
	"Ｗ侠客行战胜李白第一格洗青莲剑法",
	}
	--李寻欢
	TFJS[498] = {"Ｄ小李探花",
	"Ｗ敌人移动-1，自身移动+2",
	"Ｗ自带蜻蜓三抄水，30%躲避攻击",
	"Ｗ战斗胜利获得暗器",	
	"Ｗ7书领悟暗器为范围攻击",	
	"Ｚ惊才绝艳 ",
	"Ｗ自带100武常",	
	"Ｗ被攻击系数必然不低于对方",
	"Ｗ被攻击集气不会少于300",	
	"Ｎ",	
	}
	ZL[498] = {"Ｒ特色指令：飞刀",
	"Ｗ100时序暗器攻击”暴击3~5倍，华山觉醒后20%暴击5倍~10倍；攻击必命中；每次开启消耗体力20，内力1000",
	}
		--冯蘅
	TFJS[588] = {"Ｄ岛主夫人",
	"Ｗ桃花岛武学威力+200",
	"Ｗ特效发动机率+10",		
	"Ｚ过目不忘",
	"Ｗ修炼武功获得双倍三围属性",
	"Ｗ受到武功威力伤害-10%",
	"Ｎ",  		
	}
	FY[588] = {"Ｇ福缘奇遇",
	"Ｗ桃花岛招亲后，第2格洗九阴神功1级，天内洗九阴神功；射雕正线牛家村3格洗弹指神通，天外洗弹指神通；射雕邪线云岭山洞3格洗九阴白骨爪，天外洗九阴白骨爪",		
	}
	--于万亭
	TFJS[571] = {"Ｄ总舵主",
	"Ｗ用剑法必破防30%",
	"Ｎ",
	}
	--元悲
	TFJS[655] = {"Ｄ红粉骷髅",
	"Ｗ对女性攻击伤害×120%，被女性攻击伤害×80%",
	"Ｎ",
	}
	--元伤
	TFJS[656] = {"Ｄ天怒红颜",
	"Ｗ对男性攻击伤害×120%，被男性攻击伤害×80%",
	"Ｎ",
	}
		--斗酒僧
	TFJS[638] = {"Ｄ九阳至尊",
	"Ｗ内力上限9999，初始武学常识100",
	"Ｗ九阳神功必加力护体,自动运功",
	"Ｗ九阳神功招式可以选择",
	"Ｗ反震40%伤害",
	"Ｎ",
	}	
		--萧半和
	
		--西门吹雪
	TFJS[500] = {"Ｄ剑道巅峰 五方行尽",		
	"Ｗ资质大于30击败谢云流领悟“剑道巅峰 五方行尽”可触增加一次行动",
	"Ｗ攻击时发动“剑道化身.破苍穹”无视敌方御剑系数50%",
	"Ｗ被攻击发动“化三清”无视敌方御剑系数50%",	
	"Ｎ",  			
	}
	FY[500] = {"Ｇ福缘奇遇（专属剧情）",
	"Ｗ战胜谢云流第一格洗斩流剑术，第二格洗太虚剑意；天赋外功洗斩流剑术，天赋内功洗太虚剑意”",
	}	
		--胡一刀
	TFJS[633] ={"Ｄ辽东大侠",
	"Ｗ天赋轻功自动主运（不用学）",
	"Ｗ自身免疫冰封。",
	"Ｗ装备冷月宝刀后胡家刀法威力+300",		
	"Ｗ装备冷月刀攻击必冰封。",
	"Ｚ刀剑归真",	
	"Ｗ飞雪邪线杀苗/飞雪正线胜苗第二格洗苗剑1级，领悟刀剑归真绝技：",
	"Ｗ不悔：伤害增加10%，时序增加怒气",	
	"Ｗ贯通：不修炼苗家剑法即可发动刀剑归真",
	"Ｗ刀剑归真：攻击触发动刀剑归真时触发刀剑绝技。",
	"Ｗ刀剑绝技：暴怒触发，必定连击首击出胡刀二击出苗剑绝技，大范围伤害杀气。",
	"Ｎ",
	}	
	--萧秋水
	TFJS[652] = {"Ｄ神州大侠",
	"Ｗ修炼辟邪剑法与葵花宝典没有惩罚，自带“忘情天书”护体+1200气防", 
	--"Ｗ气血越低防御越高，最低15%，最高35%",	
	"Ｎ",
	"Ｚ忘情天书",
	"Ｗ1书领悟：“天意”死亡时必触发“天意”复活一次",
	"Ｗ2书领悟：“水逝”增加冰封，冰封过50点概率发动“月映”冰冻5时序", 
	"Ｗ3书领悟：“火延”增加燃烧，燃烧过50点概率发动“日明”点燃目标",    
	"Ｗ4书领悟：“土掩”减伤30点，机率发动“风流”完全闪避攻击",         
	"Ｗ5书领悟：“云翳”必杀集气200，自身暴怒后概率“我无”免伤",  	
    "Ｚ剑气飞纵（6书领悟）",
	"Ｗ连击不减伤害，攻击范围+1，",
	"Ｗ攻击时不随距离减伤害，目标距离越远，伤害越高",       
	"Ｎ",
	}
	ZL[652] = {"Ｒ天剑",
	"Ｗ7书华山后山觉醒后领悟，使用剑法暴怒时可使用“天剑”指令，无视敌方御剑系数30%防御30%",
	}
	--梁萧
	TFJS[635] = {"Ｄ西昆仑",
	"Ｗ自带“鲸息功”与“碧海惊涛掌”", 	
	"Ｗ鲸息功自动运功或使用碧海惊涛掌可以触发六大奇劲之一",	
    "Ｚ星罗散手",
	"Ｗ用拳掌攻击时，必触发“星罗散手”给对方造成封穴",
    "Ｚ绝技：谐之道",
    "Ｗ自身不会有破绽，暴怒时发动必中破绽，",
	"Ｗ击中敌方破绽高机率造成敌方5时序集气暂停",
	"Ｎ",
	}
	FY[635] = {"Ｇ福缘机遇",
	"Ｗ灵鳌岛领悟鲸息功与碧海惊涛掌，第一格洗碧海惊涛掌，第二格洗鲸息功。",	
	}
	--陆渐
	TFJS[497] = {"Ｄ金刚门人",
	"Ｗ攻击时为自己添加一个100时序“金刚法相”增益BUFF：", 
	"Ｗ攻击机率触发大金刚神力，无视绝对气防+1200气攻",	
	--"Ｗ初始+20暴击率，每本天书+5%",
	--"Ｗ七书无视防御40%",	
    "Ｚ三十二身相",
	"Ｗ攻击时或被攻击时机率触发持续100时序“一合相”BUFF,减伤15%",
	"ＷBUFF“一合相”存在期间，才会发动以下身相：",
	"Ｗ1书领悟[神鱼相]：攻击时机率追加一次连击，暴怒必连",	
	"Ｗ2书领悟[白毫相] ：被攻击机率只受到100点气攻",
	"Ｗ3书领悟[雀母相]：被攻击机率减伤50点",	
	"Ｗ4书领悟[大自在相]：被攻击机率+200集气",	 
    "Ｚ补天劫奴",
	"Ｗ攻击时偷取敌方物品,攻击与被攻击都算拳系",	
    "Ｚ绝技：海之道",
	"Ｗ华山后山觉醒后领悟",
    "Ｗ7书领悟 “海之道.海纳百川” 被攻击时无视对方系数",
    "Ｗ10书领悟“海之道.上善若水” 攻击时无视对方系数 ",	
	"Ｎ",
	}	
	--黄衫女
	TFJS[640] = {"Ｄ古墓后人",
	"Ｗ玉女心经特效机率增加，",
	"Ｗ无需主运九阴神功可触发九阴白骨爪极意，",	
	"Ｗ华山觉醒九阴白骨爪威力+50%,",
	"Ｗ主运九阴，九阴神爪极意40%三连，暴怒必三连",	
	"Ｚ翩若惊鸿",
	"Ｗ学会天罗地网后，每次攻击增加1~2层“疾风”每层+2.5%集气，最多10层",
	"Ｗ被男性目标攻击伤害减少10%",
    "Ｚ绝技:广寒清辉",
	"Ｗ华山后山觉醒后暴怒触发“广寒清辉”必冻结目标集气5时序",
	"Ｎ",	
	}
	--黄赏
	TFJS[637] = {"Ｄ九阴至尊",
	"Ｗ九阴神功自动运功",
	"Ｗ“易筋锻骨”：免疫封穴，被暴击时反而降低伤害70%",
	"Ｗ“天之道”：攻击时触发“天之道”附加目标生命最大值5%的伤害",
	"Ｗ主运九阴，九阴神爪极意必两连，40%机率三连，暴怒必三连。",		
	"Ｚ大道归藏(畅想专享)",
	"Ｗ无视条件修炼武功",
	"Ｗ所有武功可以自动到极",					
	"Ｎ",
	}
	--寇仲
	TFJS[578] = {"Ｄ大唐双龙·冰",
	"Ｗ免疫冰封，攻击必冰封，概率冰冻敌方并使敌方时序减血",
	"Ｗ无视内属修炼刀法",
	"Ｚ长生精要",
	"Ｗ触发长生诀复活时，必定满状态复活",
	"Ｗ自带长生八荒纯阳组合的「长生·天人」以及「长生蓄力」效果", 	
	"Ｚ井月八法",
	"Ｗ每个刀法到极领悟一招",
	"Ｗ每一招加暴击伤害/暴击概率/加气攻(上限8个)", 		
	"Ｎ",
	}
	FY[578] = {"Ｇ福缘奇遇",
	"Ｗ觉醒之后，学有长生诀即可触发长生八荒纯阳组合的全部特效",
	}
	--徐子陵
	TFJS[505] = {"Ｄ大唐双龙·炎",
	"Ｗ免疫灼烧，攻击必灼伤，概率点燃",
	"Ｗ无视内属修炼拳掌",
	"Ｚ长生精要",
	"Ｗ触发长生诀复活时，必定满状态复活",
	"Ｗ自带长生八荒纯阳组合的「长生·天人」以及「长生蓄力」效果",
	"Ｚ真言手印",
	"Ｗ只要学会大金刚掌或般若掌，使用二者其一即可触发「金刚般若」特效。", 	
	"Ｎ",
	}
	FY[505] = {"Ｇ福缘奇遇",
	"Ｗ觉醒之后，学有长生诀即可触发长生八荒纯阳组合的全部特效",
	}
	--袁紫衣
	TFJS[587] = {"Ｄ紫衣银鞭",
	"Ｗ黄沙万里鞭威力加300，白莽鞭法威力加300",
	"Ｗ每修炼一个奇门武功到极，减伤提高4%（上限7个）",	
	"Ｎ",	
	}
	FY[587] = {"Ｇ福缘奇遇（专属剧情）",
	"Ｗ倚天正线光明顶胜灭绝第一格白莽鞭法，天外洗白莽鞭法；倚天邪线胜三渡第一格洗金刚伏魔圈,天外洗金刚伏魔圈；飞雪拿到飞天神行,第三格洗飞天神行1级,天轻洗飞天神行",
	}
	--何足道
	TFJS[586] = {"Ｄ昆仑三圣",
	"Ｗ琴音：攻击时为敌全体添加1~4层琴音BUFF,最多30层",
	"Ｗ棋势：攻击目标附带天数书量x10的伤害",
	"Ｗ百鸟朝凤：每攻击一次给自身添加1~3层曲风，曲风BUFF>20层,消耗20层曲风给敌全体造成附加琴音层数x10的伤害",	
	"Ｚ何足道哉",
	"Ｗ气血越少连击、暴击越高",	
	"Ｎ",  	
	}
	FY[586] = {"Ｇ福缘奇遇（专属剧情）",
	"Ｗ获得两仪剑法，第1格洗两仪剑法；获得两仪刀法，第2格洗两仪刀法；获得九阳神功，第3格子洗混沌气决",
	}
	--司空摘星
	TFJS[579] = {"Ｄ千变万幻",
	"Ｗ机率(20+天书数)触发“千变.相由心生”只受到误伤，",
	"Ｗ受到伤害值随天书数增加而减少",
	"Ｗ挨打增加集气速度，集气上限99,集气不受异常状态影响",	
	
	"Ｚ盗王之王",
	"Ｗ攻击偷取敌方身上的物品",	
	"Ｗ增加敌方存活人数x5的集气速度",
	"Ｗ行动后可再次移动",	
	"Ｎ",
	}		
	--步惊云
	TFJS[584] = {"Ｄ不哭死神",
	--"Ｗ自带“虚云劲”减少受到气攻，时序回复内力",
	--"Ｗ“云踪魅影 ”集气速度提升30%,无视敌人位置移动10格，获得梯云纵领悟 ",
	"Ｚ云无常",
	"Ｗ排云掌：随天书数量增加领悟招式",	
	"Ｗ使用拳掌时触发招式。招式气攻、伤害、破防（最大36%）随招式增加",	
	"Ｗ第十到第十二式无视绝对气防与大概率破防",		
	"Ｚ剑廿三",
	"Ｗ自带1-14式圣灵剑法，使用剑法时随机出招增加气攻",	
	"Ｗ15-22式需获得天书领悟，",
	"Ｗ获得9本天书后满怒时使用剑法触发剑廿三大范围攻击并概率使目标昏迷1回合",	
	"Ｎ",
	}	
	--莫大
	TFJS[20] = {"Ｄ衡山掌门",
	"Ｗ华山觉醒后自带五岳剑诀",
	"Ｚ潇湘夜雨",		
	"Ｗ剑法攻击范围+1",
	"Ｗ“笑傲江湖”：攻击时机率发动笑傲江湖追加气攻",
	"Ｚ七弦无形剑",
	"Ｗ华山觉醒后领悟",
	"Ｗ“绝技·七弦无形剑·无形剑气”用剑法攻击暴怒触发",
	"Ｎ",		
	}
	--殷离
	TFJS[646] = {"Ｄ绝色佳人",
	"Ｄ千蛛万毒手",
	"Ｗ攻击强制上毒20点，根据目标中毒值回复生命",
	"Ｎ",
	}	
	--鹤笔翁
	TFJS[647] = {"Ｄ玄冥二老",
	"Ｗ使用玄冥神掌，必定发动极意",
	"Ｚ此地可是白门楼",
	"Ｗ暴怒时攻击附加随机负面状态",
	"Ｚ此地可是虎牢关",
	"Ｗ战斗中首次被击退可复活一次，立即行动",
	"Ｎ",
	}
	--鹿杖客
	TFJS[648] = {"Ｄ玄冥二老",
	"Ｗ使用玄冥神掌，必定发动极意",
	"Ｚ江南苟王",
	"Ｗ免疫男性非连击伤害",
	"Ｚ起峰了",
	"Ｗ被女性攻击时追加666点伤害",
	"Ｎ",
	}

	--宁中则
	TFJS[649] = {"Ｄ娇美人妻",
	"Ｗ被攻击时，消耗攻击方5-10点体力",
	"Ｗ使用剑法机率触发“宁氏一剑·无双无对”附加虚弱状态1~3回合",	
	"Ｚ华山玉女",
	"Ｗ紫霞神功必发动紫霞剑气",
	"Ｗ剑法攻击必触发“玉女十九剑”增加自身连击率，暴怒必连",	
	"Ｎ",
	}
	FY[649] = {"Ｇ福缘际遇",
	"Ｗ获得五岳剑诀第二格洗五岳剑诀",
	}
	
	--白绣
	TFJS[582] = {"Ｄ冰川天女",
	"Ｗ敌方全体集气-5",
	"Ｗ攻击必冰封，冰封超过50机率冻结目标",	
	"Ｗ追加冰封值的真实伤害，自身免疫冰封",		
	"Ｚ雪花神剑",
	"Ｗ获得雪山剑谱后领悟“雪花神剑”：",
	"Ｗ雪山剑法威力翻倍",
	"Ｗ每个武功到极增加雪山剑法100威力",
	"Ｗ攻击时概率触发“雪花神剑”，增加杀气，暴怒必触发",	
	}
	--丁当
	TFJS[581] = {"Ｄ丁丁当当",
	"Ｗ敌方全体集气-5",
	"Ｗ攻击必灼烧",	
	"Ｗ击败丁不三丁不四，金乌刀法威力增加300，只学金乌刀法可触发举火燎原",		
	"Ｚ机灵古怪",
	"Ｗ自身集气位置概率前进30，暴怒时3倍",
	"Ｗ集气位置不会低于0",
	"Ｎ",
	}
	--陆无双
	TFJS[580] = {"Ｄ银弧刀",
	"Ｗ攻击必造成流血",
	"Ｗ暴击率+30",	
	"Ｚ五毒心经",
	"Ｗ程英居觉醒后免疫中毒",	
	"Ｎ",
	}	
	FY[580] = {"Ｇ福缘际遇",
	"Ｗ蝴蝴谷请胡青牛治好腿伤 轻功+50；获得玉女剑法 第2格洗玉女剑法1级；获得玉女心经 第3格洗玉女心经1级，天内洗玉女心经；获得天罗地网 第5格洗天罗地网1级，天轻洗天罗地网 ",
	}
	--仪琳
	TFJS[583] = {"Ｄ小尼姑",
	"Ｗ被攻击伤害-15%，自身伤害-10%",
	"Ｗ获得万花剑法 1格洗万花剑法1级",	
	"Ｚ天域幻音",
	"Ｗ行动结束时友方行动结束清除流血、中毒、冰封、灼烧、内伤并回复最多1000点生命值",
	"Ｎ",
	}
	--商剑鸣
	TFJS[722] = {"Ｄ八卦高手",
	"Ｗ八卦掌造成敌方“散功”状态20时序",
	"Ｎ",
	}
	--商夫人
	TFJS[737] = {"Ｄ八卦高手",
	"Ｗ八卦刀造成敌方“虚弱”状态20时序",
	"Ｎ",
	}
	--商宝震
	TFJS[739] = {"Ｄ商家堡主",
	"Ｗ使用八卦掌后八卦刀追加三次连击",
	"Ｗ使用八卦刀后八卦掌追加300伤害"
	}
	--默苍离
	TFJS[750] = {"Ｄ夜雨楼主",
    "Ｒ畅想主角专属：",
    "Ｗ夜雨楼现任楼主",
    "Ｗ享受夜雨楼最高级特效",
    "Ｗ享受与夜雨楼初代楼主商御隐同等特效",
	"Ｎ",
	}
	--嘉华
	TFJS[761] = {"Ｄ枪剑迷帝",
    "Ｗ初始自带部分奇门奇穴满级",	
    "Ｗ使用剑法时，该剑法也会被视为奇门武功；使用奇门武功则也会被视为剑系武功",
	"Ｎ",
	}
	--顾怜影
	 TFJS[763] = {"Ｄ顾影自怜",
	 "Ｗ被攻击时必然集气+300，并减少攻击者10点体力",
	 "Ｗ免疫杀气",
	 "Ｗ受击时，若敌方距离自身小于等于「受击者资质/14」，则免疫伤害。（非队友，或畅想主角二次觉醒才生效）",
	"Ｎ"	
     } 
	--王劍杰
	--[[TFJS[740] = {"Ｄ隔壁大王",
	"Ｗ八卦刀威力翻倍，受到攻击时30%几率用八卦刀招架并反击",
	"Ｎ",
	}
	--王劍英
	TFJS[741] = {"Ｄ隔壁二王",
	"Ｗ八卦掌威力翻倍，攻击时30%几率敌人无法护体，追加杀气值伤害",
	"Ｎ",
	}
	]]
	--不戒
	TFJS[593] = {"Ｄ不戒和尚",
	"Ｎ",
	}	
	ZL[593] = {"Ｒ特色指令：不戒",
	"Ｗ帮助队友自宫，每次开启消耗体力20，内力1000",
	}	
	--胡夫人
	TFJS[738] = {"Ｄ冰肌玉骨",
	"Ｗ被攻击伤害减半，但不减受伤度",
	"Ｎ",
	}
	--苗若兰
	TFJS[545] = {"Ｄ望雪颦愁",
	"Ｗ被男性攻击时，免疫双击、免疫暴击伤害",
	"Ｎ",
	}
	
	--------------------------------------
	
	--主角专属介绍
	ZJZSJS = {"Ｒ天赋外功",
	"Ｄ获得方式：拿到七本天书后，场景【华山后山】对话谢无悠",
	"Ｄ可选择一个武功作为天赋外功",
	"Ｎ",
	"Ｒ天赋内功",
	"Ｄ获得方式：拿到十本天书后，场景【华山后山】挑战谢无悠胜利",
	"Ｄ可选择一个内功作为天赋内功",
	}
	
    WPTX2 = {}
    WPTX2[0] = "时序恢复1点内伤，持续50时序"
    WPTX2[1] = "时序恢复2点生命，满实战翻倍，持续100时序"
    WPTX2[3] = "时序恢复8点内力，持续200时序"
    WPTX2[9] = "时序恢复1点中毒，持续50时序"
    WPTX2[10] = "时序恢复1点中毒，持续50时序"
    WPTX2[11] = "提升战场抗毒100点，持续至战斗结束"
    WPTX2[22] = "解除冰封50点并时序恢复1点冰封，持续50时序"
    WPTX2[23] = "解除灼烧20点并时序恢复1点灼烧，持续50时序"
    WPTX2[24] = "解除流血50点并时序恢复1点流血，持续100时序"
    WPTX2[25] = "清除所有基础异常"
	--物品特效说明
	WPTX = {}
	--绣花针
	WPTX[349] = {"必破气防，破防10%",
	"破防20%",
	"破防30%",
	"破防40%",
	"破防50%",
	"破防60%，进战集气增加900。"
	}
	--青冥剑
	WPTX[335] = {"根据御剑能力提升剑法范围",
	"根据御剑能力提升剑法攻击范围",
	"根据御剑能力提升剑法攻击范围",
	"根据御剑能力提升剑法攻击范围",
	"根据御剑能力提升剑法攻击范围",
	"根据御剑能力提升剑法攻击范围"
	}
	--白猿
	WPTX[326] = {"猿公剑法/越女剑法威力+200",
	"猿公剑法/越女剑法威力+200",
	"猿公剑法/越女剑法威力+200",
	"猿公剑法/越女剑法威力+200",
	"猿公剑法/越女剑法威力+200",
	"猿公剑法/越女剑法威力+200"
	}
	--伏魔禅杖
	WPTX[323] = {"伏魔杖法威力+200",
	"攻击时60%几率造成内伤5~15点",
	"攻击时70%几率造成内伤5~15点",
	"攻击时80%几率造成内伤5~15点",
	"攻击时90%几率造成内伤5~15点",
	"攻击时必造成内伤，增加“世尊降魔”发动机率10%"
	}
	--狼牙
	WPTX[320] = {"攻击时50%几率造成流血",
	"攻击时60%几率造成流血",
	"攻击时70%几率造成流血",
	"攻击时80%几率造成流血",
	"攻击时90%几率造成流血",
	"攻击时必造成流血，50%机率发动“天狼啸月”"
	}	
	--七宝指环
	WPTX[200] = {"逍遥派武学威力+100",
	"60%概率追加封穴5点",
	"70%概率追加封穴5点",
	"80%概率追加封穴5点",
	"90%概率追加封穴5点",
	"必封穴，50%机率发动“七宝琉璃”特效"
	}	
	--玄铁剑
	WPTX[36] = {"使用玄铁剑法时，增加50%暴击率",
	"使用玄铁剑法时，增加60%暴击率",
	"使用玄铁剑法时，增加70%暴击率",
	"使用玄铁剑法时，增加80%暴击率",
	"使用玄铁剑法时，增加90%暴击率",
	"使用玄铁剑法时，必定暴击，并可发动“破尽天下”"
	}
	--倚天剑
	WPTX[37] = {"攻击时70%几率造成流血效果",
	"攻击时80%几率造成流血效果",
	"攻击时90%几率造成流血效果",
	"攻击时必定造成流血效果",
	"攻击时必定造成流血效果",
	"使用剑法攻击时，有几率触发“谁于争锋”特效"
	}
	--流星剑
	WPTX[38] = {"连击率+10%",
	"连击率+11%",
	"连击率+12%",
	"连击率+13%",
	"连击率+14%",
	"连击率+15%"
	}
	--屠龙刀
	WPTX[43] = {"使用刀法攻击时，有几率触发两种特效",
	"使用刀法攻击时，有几率触发两种特效",
	"使用刀法攻击时，有几率触发两种特效",
	"使用刀法攻击时，有几率触发两种特效",
	"使用刀法攻击时，有几率触发两种特效",
	"使用刀法攻击时，有几率触发两种特效"
	}
	--血刀
	WPTX[44] = {"看起来不错，实际上没什么用",
	"看起来不错，实际上没什么用",
	"看起来不错，实际上没什么用",
	"看起来不错，实际上没什么用",
	"看起来不错，实际上没什么用",
	"看起来不错，实际上没什么用"
	}
	--软猬甲
	WPTX[58] = {"减伤20点，被拳指系武功攻击时，使攻击方流血10点",
	"减伤22点，被拳指系武功攻击时，使攻击方流血10点",
	"减伤24点，被拳指系武功攻击时，使攻击方流血10点",
	"减伤26点，被拳指系武功攻击时，使攻击方流血10点",
	"减伤28点，被拳指系武功攻击时，使攻击方流血10点",
	"减伤30点，被拳指系武功攻击时，使攻击方流血10点"
	}
	--乌蚕衣
	WPTX[59] = {"被攻击时，受到的内伤减少5点",
	"被攻击时，受到的内伤减少6点",
	"被攻击时，受到的内伤减少7点",
	"被攻击时，受到的内伤减少8点",
	"被攻击时，受到的内伤减少9点",
	"被攻击时，受到的内伤减少10点"
	}
	--金丝背心
	WPTX[60] = {"被攻击时，受到的封穴减少5点",
	"被攻击时，受到的封穴减少6点",
	"被攻击时，受到的封穴减少7点",
	"被攻击时，受到的封穴减少8点",
	"被攻击时，受到的封穴减少9点",
	"被攻击时，受到的封穴减少10点"
	}
	--鳄皮护甲
	WPTX[61] = {"每次行动结束后解毒25点",
	"每次行动结束后解毒35点",
	"每次行动结束后解毒45点",
	"每次行动结束后解毒55点",
	"每次行动结束后解毒65点",
	"每次行动结束后解毒75点"
	}
	--佛心甲
	WPTX[62] = {"被攻击时，受到的灼烧减少50%",
	"被攻击时，受到的灼烧减少60%",
	"被攻击时，受到的灼烧减少70%",
	"被攻击时，受到的灼烧减少80%",
	"被攻击时，受到的灼烧减少90%",
	"被攻击时，免疫灼烧状态"
	}
	--皮衣
	WPTX[63] = {"被攻击时，受到的冰封减少50%",
	"被攻击时，受到的冰封减少60%",
	"被攻击时，受到的冰封减少70%",
	"被攻击时，受到的冰封减少80%",
	"被攻击时，受到的冰封减少90%",
	"被攻击时，免疫冰封状态"
	}
	--白马
	WPTX[230] = {"集气速度增加2点",
	"集气速度增加2点",
	"集气速度增加3点",
	"集气速度增加3点",
	"集气速度增加4点",
	"集气速度增加4点"
	}	

	--真武剑
	WPTX[236] = {"使用太极剑法时，必定连击",
	"使用太极剑法时，必定连击",
	"使用太极剑法时，必定连击",
	"使用太极剑法时，必定连击",
	"使用太极剑法时，必定连击",
	"使用太极剑法时，必定连击"
	}
	--鸳鸯刀
	WPTX[217] = {"需男性，使用夫妻刀法时，必定连击",
	"使用夫妻刀法时，必定连击",
	"使用夫妻刀法时，必定连击",
	"使用夫妻刀法时，必定连击",
	"使用夫妻刀法时，必定连击，追加500气攻",
	"使用夫妻刀法时，必定连击，追加500气攻，伤害提高20%"
	}
	WPTX[218] = {"需女性，使用夫妻刀法时，必定连击",
	"使用夫妻刀法时，必定连击",
	"使用夫妻刀法时，必定连击",
	"使用夫妻刀法时，必定连击",
	"使用夫妻刀法时，必定连击，追加500气攻",
	"使用夫妻刀法时，必定连击，追加500气攻，伤害提高20%"
	}
	--毛驴
	WPTX[279] = {"集气速度增加10点",
	"集气速度增加10点",
	"集气速度增加10点",
	"集气速度增加10点",
	"集气速度增加10点",
	"集气速度增加10点"
	}
	--青驴
	WPTX[339] = {"集气速度增加5点，体力消耗减2点",
	"集气速度增加5点，体力消耗减2点",
	"集气速度增加5点，体力消耗减2点",
	"集气速度增加5点，体力消耗减2点",
	"集气速度增加5点，体力消耗减2点",
	"集气速度增加5点，体力消耗减2点"
	}
	--飞云骓
	WPTX[264] = {"集气速度增加12点",
	"集气速度增加12点",
	"集气速度增加12点",
	"集气速度增加12点",
	"集气速度增加12点",
	"集气速度增加12点"
	}	
	--汗血宝马
	WPTX[262] = {"集气速度增加8点，时序回复流血2点",
	"集气速度增加8点，时序回复流血2点",
	"集气速度增加8点，时序回复流血2点",
	"集气速度增加8点，时序回复流血2点",
	"集气速度增加8点，时序回复流血2点",
	"集气速度增加8点，时序回复流血2点"
	}		
	--西毒蛇杖
	WPTX[244] = {"攻击时无视敌方毒抗强制上毒10点",
	"攻击时无视敌方毒抗强制上毒15点",
	"攻击时无视敌方毒抗强制上毒20点",
	"攻击时无视敌方毒抗强制上毒25点",
	"攻击时无视敌方毒抗强制上毒30点",
	"攻击时无视敌方毒抗强制上毒35点"
	}
	--瘦黄马
	WPTX[284] = {nil,
	nil,
	nil,
	nil,
	nil,
	"血量越低，集气速度越快"
	}
	
	--金丝手套
	WPTX[239] = {"提高自身拳/指系数10点",
	"提高自身拳/指系数15点",
	"提高自身拳/指系数20点",
	"提高自身拳/指系数25点",
	"提高自身拳/指系数30点",
	"提高自身拳/指系数30点，免疫流血"
	}
	
	--音箱
	WPTX[300] = {"降龙三叠浪几率提高5%，暴怒时有几率触发四叠浪",
	"降龙三叠浪几率提高10%，暴怒时有几率触发四叠浪",
	"降龙三叠浪几率提高15%，暴怒时有几率触发四叠浪",
	"降龙三叠浪几率提高20%，暴怒时有几率触发四叠浪",
	"降龙三叠浪几率提高25%，暴怒时有几率触发四叠浪",
	"降龙三叠浪几率提高30%，暴怒时有几率触发四叠浪"
	}
	
	--麻痹戒指
	WPTX[301] = {"令击中的敌方进入麻痹状态，下回合移动能力-1",
	"令击中的敌方进入麻痹状态，下回合移动能力-1",
	"令击中的敌方进入麻痹状态，下回合移动能力-2",
	"令击中的敌方进入麻痹状态，下回合移动能力-2",
	"令击中的敌方进入麻痹状态，下回合移动能力-3",
	"令击中的敌方进入麻痹状态，下回合移动能力-3"
	}
	--护身戒指
	WPTX[302] = {"用内力抵消一半伤害，抵消比例为3内力=1伤害",
	"用内力抵消一半伤害，抵消比例为3内力=1伤害",
	"用内力抵消一半伤害，抵消比例为2内力=1伤害",
	"用内力抵消一半伤害，抵消比例为2内力=1伤害",
	"用内力抵消一半伤害，抵消比例为1内力=1伤害",
	"用内力抵消一半伤害，抵消比例为1内力=1伤害"
	}
	--复活戒指
	WPTX[303] = {"被击退时，满状态复活，复活6次之后物品损坏",
	"被击退时，满状态复活，复活6次之后物品损坏",
	"被击退时，满状态复活，复活6次之后物品损坏",
	"被击退时，满状态复活，复活6次之后物品损坏",
	"被击退时，满状态复活，复活6次之后物品损坏",
	"被击退时，满状态复活，复活6次之后物品损坏"
	}
	--隐身戒指
	WPTX[304] = {"敌方无法察觉你的存在，攻击后现形40时序",
	"敌方无法察觉你的存在，攻击后现形40时序",
	"敌方无法察觉你的存在，攻击后现形30时序",
	"敌方无法察觉你的存在，攻击后现形30时序",
	"敌方无法察觉你的存在，攻击后现形20时序",
	"敌方无法察觉你的存在，攻击后现形20时序"
	}
	--天书
	WPTX[312] = {"神秘强大的力量",
	"神秘强大的力量",
	"神秘强大的力量",
	"神秘强大的力量",
	"神秘强大的力量",
	"神秘强大的力量",
	}	
	--千年人参
	WPTX[14] = "可增加人物体质1点"	
	--独孤九剑
	WPTX[114] = "在一定机缘下可领悟九剑真传"
	--六脉神剑
	WPTX[113] = "连击时，伤害、气攻不会减少"
	--夫妻刀法
	WPTX[140] = "连击时，伤害、气攻不会减少"
	--北冥神功
	WPTX[64] = "主角修炼时，内力不会调和，主角修炼机率吸怒20点"
 	--小无相功
	WPTX[75] = "主角修炼不调和"	
 	--九阴功
	WPTX[83] = "主角修炼可习得飞絮劲机率+100真实伤害且无视闪避"
 	--九阳功
	WPTX[84] = "主角修炼可习得“抱元守一”，行动前清除所有异常状态"	
	--难度文字
	MODEXZ2 = {"简单", "普通", "困难","地狱"}
	--标主选天赋文字
	TFXZSAY1 = " 天下风云出我辈 * 一入江湖岁月催 * 皇图霸业谈笑中 * 不胜人生一场醉 "
	
	--特色指令
	GRTS = {}
	GRTSSAY = {}
	
	--杨冰羽
	GRTS[514] = "招生" --615修改
	GRTSSAY[514] = "效果：为师决定收你为徒**消耗：体力20点 内力2000点 金钱6000两"
	--段誉
	GRTS[53] = "凌波"
	GRTSSAY[53] = "效果：至该角色下次行动为止*      被攻击有50%几率闪避*消耗：体力10点"
	
	--虚竹
	GRTS[49] = "催符"
	GRTSSAY[49] = "效果：催动敌人身上的生死符*      使其封穴25时序*消耗：体力5点 内力500点"
	
	--人厨子
	GRTS[89] = "气补"
	GRTSSAY[89] = "效果：回复指定邻接队友体力50点**消耗：体力25点 内力300点"
	
	--张无忌
	GRTS[9] = "挪移"
	GRTSSAY[9] = "效果：将八格范围内的我方任一队友*      挪移到指定位置*消耗：体力10点 内力500点"
	
	--祖千秋
	GRTS[88] = "传功"
	GRTSSAY[88] = "效果：将五格范围内我方任一队友*      当前集气提升500点*消耗：体力10点 内力700点"
  
	--霍青桐
	GRTS[74] = "指挥"
	GRTSSAY[74] = "效果：我方获得号令三军50时序。*效果为我方存活人数*5%。*消耗：体力10点 内力150点"
	
	--王难姑
	GRTS[17] = "施毒"
	GRTSSAY[17] = "效果：周围五格范围内的敌人时序中毒*      持续50时序*消耗：体力15点 内力300点"
	
	--胡青牛
	GRTS[16] = "群疗"
	GRTSSAY[16] = "效果：周围五格范围内的队友时序回内伤*      并按比例回血，持续20时序*消耗：体力15点 内力300点"
	
	
	--慕容复
	GRTS[51] = "幻梦"
	GRTSSAY[51] = "效果：至该角色下次行动为止*      被攻击必定发动幻梦星辰反击*消耗：体力10点"
	
	--小昭
	GRTS[66] = "影步"
	GRTSSAY[66] = "效果：标记自身周围一点*      被攻击则移动至该处*消耗：体力20点 内力1000点"
	
	--钟灵
	GRTS[90] = "灵貂"
	GRTSSAY[90] = "效果：偷窃敌方携带的物品*      并对其强制上毒50点*消耗：体力5点"
	
	--郭襄
	GRTS[626] = "玲珑"
	GRTSSAY[626] = "效果：可自由切换第一格武功为*      弹指神通/玉萧剑法/落英神剑掌*      不消耗回合"
	--郭襄
	GRTS[574] = "云梦"
	GRTSSAY[574] = "效果：可自由切换第一格武功为*      寒袖拂穴/白虹掌力*      不消耗回合"	
	--胡斐
	GRTS[1] = "飞狐"
	GRTSSAY[1] = "效果：无视障碍物移动*      在战场上来去自如*消耗：体力10点"
	
	--鸠摩智
	GRTS[103] = "幻化"
	GRTSSAY[103] = "效果：使用小无相功模拟天下武学*      必须要拥有对应的秘籍*消耗：体力10点 内力500点"
	
	--达尔巴
	GRTS[160] = "死战"
	GRTSSAY[160] = "效果：锁定一名敌人，至其死亡之前，达尔巴*      对其的攻击效果提高50%，且必定命中*      在目标死亡之前无法更换目标*消耗：体力10点 内力500点"
	
	--金轮
	GRTS[62] = "龙象"
	GRTSSAY[62] = "效果：使用后自动执行蓄力*      并使下一次的攻击附加昏迷效果*      昏迷的敌人将丧失一次行动机会*消耗：体力10点 内力500点"
	
	--黄蓉
	GRTS[56] = "遁甲"
	GRTSSAY[56] = "效果：使用奇门遁甲*      重新布置战场地形效果*消耗：体力10点 内力500点"
	
	--阿紫
	GRTS[47] = "禁药"
	GRTSSAY[47] = "效果：使用禁药刺激神经*      自身每时序损失1%最大血量*      此状态下自身血量越低，伤害/集气越高*      不消耗回合"
	
	--韦小宝
	GRTS[601] = "口才"
	GRTSSAY[601] = "效果：使一名敌方进入沉睡状态*      此状态无法集气，不会自行解除*      受到攻击会醒来*消耗：体力15点"
	
	--苗人凤
	GRTS[3] = "破军"
	GRTSSAY[3] = "效果：攻击敌方*      并使其内功停运50时序*消耗：体力10点 内力300点"
	
	--灭绝
	GRTS[6] = "俱焚"
	GRTSSAY[6] = "效果：开启后100时序*      自身造成和受到的伤害皆提高50% *      不消耗回合"
	
	--谢逊
	GRTS[13] = "咆哮"
	GRTSSAY[13] = "效果：使全场敌人进入混乱状态20时序*      此状态下敌人行动时的敌我关系为随机*      不会全部随机到我方，以免出现直接获胜的情况*消耗：体力10点 2000内力"
	--丘处机
	GRTS[68] = "止杀"
	GRTSSAY[68] = "效果：自身十格范围内敌人不会攻击一回合    *     *消耗：体力15点 "	
	
	--何太冲
	GRTS[7] = "铁琴"
	GRTSSAY[7] = "效果：使全场敌人受到其身上琴音层数×50点伤害*      并清除其身上的琴音状态*消耗：体力10点 内力500点"
	
	--阎基
	GRTS[4] = "虚弱"
	GRTSSAY[4] = "效果：用毒药侵蚀一名敌人的神经*      使其在40时序内造成的伤害杀气减半*消耗：体力10点"
	
	--黛绮丝
	GRTS[15] = "倾国"
	GRTSSAY[15] = "效果：开启后，接下来受到的前6次攻击*      将折射给在场随机第三方人物*消耗：体力10点"
	
	--猫姐
	GRTS[92] = "换装"
	GRTSSAY[92] = "效果：使用后改变自身外形*      并将获得不同的内功*消耗：体力10点"
		
	GRTS[507] = "麒麟"
	GRTSSAY[507] = "效果1：使用后改变自身形象*效果2：每本天赋可复制敌方一个武功*消耗：体力10点"
		
	GRTS[508] = "麒麟"
	GRTSSAY[508] = "效果1：使用后改变自身形象*      无消耗消耗"
		
	--李寻欢
	GRTS[498] = "飞刀"
	GRTSSAY[498] = "效果：开启100时序后，自身伤害提升50%*    小李飞刀例无需发 攻击无视闪避必命中；*  暗器造成更高伤害，消耗：-10体，-500内"
	--萧秋水
	GRTS[652] = "天剑"
	GRTSSAY[652] = "效果：满怒后可使用，开启开50时序内*    任何剑系武功附加【惊天一剑】*  造成无视一切防御无视闪避的伤害*        消耗：-10体，-500内"	
	
	--不戒和尚
	GRTS[593] = "不戒"
	GRTSSAY[593] = "效果：帮助队友自宫*消耗：体力10点，内力1000点"	
	
	CC.Kungfunum = 15;	--人物武功数量
CC.weekday = {}
	CC.weekday["Monday"] = {"星期一"}
	CC.weekday["Tuesday"] = {"星期二"}
	CC.weekday["Wednesday"] = {"星期三"}
	CC.weekday["Thursday"] = {"星期四"}
	CC.weekday["Friday"] = {"星期五"}
	CC.weekday["Saturday"] = {"星期六"}
	CC.weekday["Sunday"] = {"星期日"}
	
	
--队友攻击加成
CC.AddAtk = {
{10, 15, 50}, 		--金花给范遥加攻
{11, 15, 50}, 		--金花给杨逍加攻
{12, 15, 50}, 		--金花给殷天正加攻
{13, 15, 50}, 		--金花给谢逊加攻
{14, 15, 50}, 		--金花给韦一笑加攻
{48, 47, 100}, 		--阿紫给游坦之加攻
{47, 50, 100}, 		--乔峰给阿紫加攻
{53, 76, 100}, 		--王语嫣给段誉加攻
{79, 36, 60}, 		--林平之给岳灵珊加攻
{74, 75, 50}, 		--陈家洛给霍青桐加攻
{59, 58, 100}, 		--杨过给小龙女加攻
{54, 91, 100}, 		--温青青给袁承志加攻
{629, 54, 100}, 	--袁承志给阿九加攻
{99, 70, 100}, 		--玄慈给叶二娘加攻
{119, 65, 50}, 		--一灯给渔加攻
{120, 65, 50}, 		--一灯给樵加攻
{121, 65, 50}, 		--一灯给耕加攻
{122, 65, 50}, 		--一灯给读加攻
{68, 129, 50}, 		--王重阳给全真七子加攻
{123, 129, 50}, 
{124, 129, 50}, 
{125, 129, 50}, 
{126, 129, 50}, 
{127, 129, 50}, 
{128, 129, 50},
{37, 589, 50},		--狄云、水笙在场，攻各加50
{589, 37, 50},
{88, 89, 50},		--人厨子给祖千秋加攻
{311, 312, 100}, 		--天山
{604, 592, 100}, 	--独孤求败给阿青加攻
{566, 77, 100},
{614,615, 50},
{505,578, 100},    --大唐双龙
}

--队友防御加成
CC.AddDef = {	
{76, 51, 100}, 		--慕容复给王语嫣加防
{311, 312, 100}, 		--天山
{55, 56, 50}, 		--黄蓉给郭靖加防
{56, 55, 100}, 		--郭靖给黄蓉加防
{35, 73, 100}, 		--任盈盈给令狐冲加防
{79, 36, 60}, 		--岳灵珊给林平之加防
{73, 35, 50}, 		--令狐冲给任盈盈加防
{74, 75, 50}, 		--陈家洛给霍青桐加防
{58, 59, 50}, 		--小龙女给杨过加防
{59, 58, 50}, 		--杨过给小龙女加防	
{66, 9, 50}, 		--张无忌给小昭加防
{91, 54, 100}, 		--袁承志给温青青加防
{119, 65, 50}, 		--一灯给渔加防
{120, 65, 50}, 		--一灯给樵加防
{121, 65, 50}, 		--一灯给耕加防
{122, 65, 50}, 		--一灯给读加防
{68, 129, 50}, 		--王重阳给全真七子加防
{123, 129, 50}, 
{124, 129, 50}, 
{125, 129, 50}, 
{126, 129, 50}, 
{127, 129, 50}, 
{128, 129, 50},
{37, 589, 50},		--狄云、水笙在场，防各加50
{589, 37, 50},
{566, 77, 100},
{614,615, 50},
{578,505, 100},    --大唐双龙
}

--队友速度加成
CC.AddSpd = {
{25, 35, 50}, 		--令狐冲给蓝凤凰加轻
{90, 53, 50}, 		--段誉给钟灵加轻
{55, 56, 100}, 		--黄蓉给郭靖加轻
{56, 55, 50}, 		--郭靖给黄蓉加轻
{35, 79, 100}, 		--小师妹给令狐加轻
{73, 35, 50}, 		--令狐给盈盈加轻
{74, 75, 50}, 		--陈家洛给霍青桐加轻
{58, 59, 100}, 		--小龙女给杨过加轻
{63, 58, 60}, 		--杨过给程英加轻
{83, 54, 50},		--袁承志给何铁手加轻
{54, 629, 100}, 	--阿九给袁承志加轻
{37, 589, 50},		--狄云、水笙在场，轻各加50
{589, 37, 50},
{311, 312, 100}, 		--天山
{89, 88, 50},		--祖千秋给人厨子加轻
{592, 604, 100},	--阿青给独孤求败加轻
{614,615, 50},
{505,578, 50},    --大唐双龙
{578,505,50},    --大唐双龙
}

CC.AddDoc = {
{2, 1, 120}, 		--胡斐给程灵素加医疗
{16, 17, 50}}		--王难姑给胡青牛加医疗

CC.AddPoi = {
{17, 16, 50}}		--胡青牛给王难姑加用毒

--组合名称
CC.COMBO = {
	{1, 2, "海棠烛泪"},
	--{4, 72, "狼狈为奸"},
      {311, 312, "天山双鹰"}, 		--天山	
	--{37, 38, "赤诚仁心"},
	--{47, 48, "铁怪毒娇"},
	{51, 76, "姑苏表亲"},
	{53, 76, "仙洞眷侣"},
	--{90, 582, "灵婉双娇"},
	{55, 56, "铁血丹心"},
	--{87, 86, "鹿鼎双妹"},
	{35, 73, "剑胆琴心"},
	{36, 79, "苦命鸳鸯"},
	{75, 74, "巾帼红花"},
	{58, 59, "神雕侠侣"},
	{9, 66, "倚天奇情"},
	{16, 17, "蝶谷怪医"},
	{54, 91, "碧血情侠"},
	{54, 629, "情天长恨"},
	{88, 89, "酒食为天"},
	--{35, 58, "独孤传人"},
	--{83, 25, "五毒五仙"},
	--{35, 29, "酒肉冤家"},
	--{0, 92, "前尘如梦"},
	{37, 589, "雪山隐士"},
	--{38, 661, "金乌玉兔"},
	--{29, 591, "风流浪荡"},
	--{10, 11, "逍遥二仙"},
	--{162, 163, "不三不四"},
	--{60, 61, "雪山白驼"},
	--{620, 61, "雪山白驼"},
	--{51, 113, "燕国遗脉"},
	--{50, 112, "大辽战神"},
	--{3, 621, "刀剑双绝"},
	--{632, 633, "人淡如菊"},
	--{616, 635, "情义无解"},	
	--{77, 625, "女貌郎才"},		
	--{643, 644, "玄冥二老"},	
	--{663, 664, "义重情深"},	
	--{9, 638, "情深不寿"},
	--{9, 639, "张郎画眉"},
	{592, 604, "剑试天宵"},
	{566, 77, "珠联璧合"},
	{615, 614, "欢喜冤家"},	
	{505, 578, "大唐双龙"},	
}

CC.HTG = {1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,311,312,313,314,315,316,317,318,319,451,452,453,454,458,459,497,498,499,500,501,502,503,504,505,506,507,508,509,510,511,530,531,545,546,565,566,567,568,569,570,571,573,574,575,576,577,578,579,580,581,582,583,584,586,587,588,589,590,592,593,594,595,596,597,598,599,601,602,603,604,605,606,607,609,610,611,612,613,614,615,616,617,626,627,628,629,630,631,632,633,634,635,636,637,638,639,640,641,642,643,644,645,646,647,648,649,650,651,652,653,655,656,657,658}
--CC.QG1 = {145,146,148,149,150,237}	--标记修改
CC.QG1 = {2,145,146,149,150,195,237,262,277,296,316}	--标记修改
CC.QG2 = {147,148,186,223,224,280,286,292,290,300}	--标记修改
CC.NG1 = {87,88,89,90,92,93,94,95,96,98,99,144,163,196,199,207,216,221,227,233,248,317}	--标记修改
CC.NG2 = {91,97,100,101,103,104,105,106,107,108,154,160,171,177,180,184,190,203,204,247,249,251,252,314,315,359,367}	--标记修改

	CC.CoupleDisplay = 0;
	
	--显示组合动画开关
	if CONFIG.CoupleDisplay == 1 then
		CC.CoupleDisplay = 1;
	end
	
	--无酒不欢：人物换装设定
	Avatar = {}
	
	--杨过
	Avatar[58] = {{},{}}
	Avatar[58][1].name = "神雕大侠"
	Avatar[58][1].num = 58
	Avatar[58][1].num2 = 58
	Avatar[58][1].frameNum = {0,13,12,0,0}
	Avatar[58][1].frameDelay = {0,6,5,0,0}
	Avatar[58][1].soundDelay = {0,4,3,0,0}
	
	Avatar[58][2].name = "重剑无锋"
	Avatar[58][2].num = 376
	Avatar[58][2].num2 = 58
	Avatar[58][2].frameNum = {0,13,12,0,0}
	Avatar[58][2].frameDelay = {0,11,11,0,0}
	Avatar[58][2].soundDelay = {0,11,11,0,0}
	
	--黛绮丝
	Avatar[15] = {{},{}}
	Avatar[15][1].name = "金花婆婆"
	Avatar[15][1].num = 15
	Avatar[15][1].num2 = 15
	Avatar[15][1].frameNum = {0,0,0,0,14}
	Avatar[15][1].frameDelay = {0,0,0,0,12}
	Avatar[15][1].soundDelay = {0,0,0,0,10}
	
	Avatar[15][2].name = "紫衫龙王"
	Avatar[15][2].num = 377
	Avatar[15][2].num2 = 15
	Avatar[15][2].frameNum = {0,0,0,0,12}
	Avatar[15][2].frameDelay = {0,0,0,0,10}
	Avatar[15][2].soundDelay = {0,0,0,0,10}

	--韦小宝
	Avatar[601] = {{},{}}
	Avatar[601][1].name = "游手好闲"
	Avatar[601][1].num = 225
	Avatar[601][1].num2 = 601
	Avatar[601][1].frameNum = {0,8,0,7,0}
	Avatar[601][1].frameDelay = {0,6,0,5,0}
	Avatar[601][1].soundDelay = {0,6,0,5,0}
	
	Avatar[601][2].name = "一人之下"
	Avatar[601][2].num = 378
	Avatar[601][2].num2 = 601
	Avatar[601][2].frameNum = {0,0,0,14,0}
	Avatar[601][2].frameDelay = {0,0,0,12,0}
	Avatar[601][2].soundDelay = {0,0,0,10,0}
	
	--鹤笔翁
	Avatar[647] = {{},{}}
	Avatar[647][1].name = "炸屎狂魔"
	Avatar[647][1].num = 16
	Avatar[647][1].num2 = 16
	Avatar[647][1].frameNum = {0,13,0,0,0}
	Avatar[647][1].frameDelay = {0,11,0,0,0}
	Avatar[647][1].soundDelay = {0,9,0,0,0}
	
	Avatar[647][2].name = "专业解说"
	Avatar[647][2].num = 17
	Avatar[647][2].num2 = 17
	Avatar[647][2].frameNum = {10,7,0,0,0}
	Avatar[647][2].frameDelay = {7,7,0,0,0}
	Avatar[647][2].soundDelay = {0,2,0,0,0}
	
	--鹿杖客
	Avatar[648] = {{},{}}
	Avatar[648][1].name = "带头大哥"
	Avatar[648][1].num = 358
	Avatar[648][1].num2 = 633
	Avatar[648][1].frameNum = {0,0,10,0,0}
	Avatar[648][1].frameDelay = {0,0,8,0,0}
	Avatar[648][1].soundDelay = {0,0,7,0,0}
	
	Avatar[648][2].name = "国民老婆"
	Avatar[648][2].num = 515
	Avatar[648][2].num2 = 738
	Avatar[648][2].frameNum = {0,0,0,0,20}
	Avatar[648][2].frameDelay = {0,0,0,0,18}
	Avatar[648][2].soundDelay = {0,0,0,0,18}
	
	--乔峰
	Avatar[50] = {{},{}}
	Avatar[50][1].name = "奋英雄怒"
	Avatar[50][1].num = 50
	Avatar[50][2].num = 50
	Avatar[50][1].frameNum = {0,14,0,0,0}
	Avatar[50][1].frameDelay = {0,8,0,0,0}
	Avatar[50][1].soundDelay = {0,5,0,0,0}
	
	Avatar[50][2].name = "狂龙天征"
	Avatar[50][2].num = 388
	Avatar[50][2].num = 50
	Avatar[50][2].frameNum = {0,14,0,0,0}
	Avatar[50][2].frameDelay = {0,8,0,0,0}
	Avatar[50][2].soundDelay = {0,5,0,0,0}
	
	--文字颜色定义
	CC.Color = {["R"]=C_RED, ["G"]=M_Green, ["B"]=M_Blue}
  
	--是否显示滚动提醒，1打开，0关闭
	CC.OpenTimmerRemind = 0;
  
	--windows版本默认是打开
	if CONFIG.Operation == 0 then
		CC.OpenTimmerRemind = 1;
	end
	CC.ZTCZSM = {"操作说明","鼠标左键点击装备栏：*无装备时可以执行装备操作，如果有装备点击显示装备说明。*按A键执行武器切换。*按B键执行防具切换。*按C键执行坐骑切换。*按J键/或鼠标点【可分配点数】执行加点。*按上下键切换队友。"}
	CC.TFCZSM = {"操作说明","up上翻天赋说明，down下翻天赋说明。"}
	CC.WGCZSM = {"操作说明","PgDn上翻武功说明，PgUp下翻武功说明。"}
	CC.QXCZSM = {"操作说明","每个人可以从战斗获取的武学点数上限为500，还可以通过稀有药物提升武学点数。*武学点数有限，请谨慎使用，一经使用概不返还。"}
	CC.SZCZSM = {"操作说明","无。"}
	require("MyOEvent");
	
	--拳法
	CC.QUAHZQX = {}
	CC.QUAHZQX[1] = {"拳倾天下","条件：拳掌功夫100可以激活。","攻击时30%增加满内伤值。","10","5","100"}
	CC.QUAHZQX[2] = {"霸王惊雷","条件：拳倾天下三级，拳掌功夫150。","攻击时根据倍内伤值增加真实伤害。","15","2","150"}
	CC.QUAHZQX[3] = {"排山倒海","条件：霸王惊雷二级，拳掌功夫200。","攻击时根据内伤值2/3/4倍恢复生命。","10","3","200"}
	CC.QUAHZQX[4] = {"翻江倒海","条件：排山倒海二级，拳掌功夫250。","攻击时30%降低50/100/150点集气位置。","10","3","250"}
	CC.QUAHZQX[5] = {"沉元破月","条件：翻江倒海/济世为怀二级，拳掌功夫300。","攻击时30%根据增加10/20/30层迟缓值，根据层数恢复内力。","10","3","300"}
	CC.QUAHZQX[6] = {"泰山压顶","条件：沉元破月二级，拳掌功夫400。","攻击时30%破除防御20时序。","15","5","400"}
	CC.QUAHZQX[7] = {"君临天下","条件：拳倾天下三级，拳掌功夫150。","攻击时30%根据内伤5/10/15时序减少生命。","10","3","150"}
	CC.QUAHZQX[8] = {"傲看苍生","条件：君临天下二级，拳掌功夫200。","攻击时30%根据3倍内伤5/10/15时序减少内力。","10","2","200"}
	CC.QUAHZQX[9] = {"济世为怀","条件：傲看苍生二级，拳掌功夫250。","攻击时30%根据拳法5/10/15/20时序恢复生命。","10","4","250"}
	CC.QUAHZQX[10] = {"恩泽苍生","条件：济世为怀二级，拳掌功夫380。","攻击时30%根据拳法5/10/15/20/25时序恢复内力。","10","5","380"}
	CC.QUAHZQX[11] = {"名动山河","条件：拳倾天下三级，拳掌功夫150。","攻击时30%增加5/10点体力。","10","2","150"}
	CC.QUAHZQX[12] = {"问鼎天下","条件：名动山河二级，拳掌功夫200。","攻击时30%敌人力竭1回合。","20","3","200"}
	CC.QUAHZQX[13] = {"纵横宇内","条件：问鼎天下二级，拳掌功夫280。","攻击时30%增加5/10/15时序虚弱、重度内伤双状态。","10","3","280"}
	CC.QUAHZQX[14] = {"天机难寻","条件：纵横宇内二级，拳掌功夫350。","攻击时30%根据内伤值的2/2.5/3倍减少生命。","10","3","350"}
	CC.QUAHZQX[15] = {"主宰人神","条件：纵横宇内二级/恩泽苍生四级，拳掌功夫400。","攻击时30%根据拳系0.1/0.2/0.3/0.4/0.5减少内力。","10","5","400"}
	CC.QUAHZQX[16] = {"回魂七刺","条件：拳倾天下三级，拳掌功夫150。","攻击时30%增加5/10/15点中毒值。","10","3","150"}
	CC.QUAHZQX[17] = {"邪元蛊毒","条件：回魂七刺二级，拳掌功夫200。","攻击时30%根据敌人无法获得治疗效果。","20","3","200"}
	CC.QUAHZQX[18] = {"七雾麻香","条件：邪元蛊毒二级，拳掌功夫250。","攻击时30%增加5/10/15时序伤重不治状态,2倍中毒值减少生命。","15","3","250"}
	CC.QUAHZQX[19] = {"三日断肠","条件：七雾麻香二级，拳掌功夫300。","攻击时30%扣除1/2/3/4/5点体力,3倍受伤值减少内力。","15","5","300"}
	CC.QUAHZQX[20] = {"锁筋蚀骨","条件：三日断肠二级，拳掌功夫400。","锁定挪移。","20","5","400"}

	--指法
	--1名称 ， 2 条件， 3效果，4消耗，5等级，6御剑条件 
	CC.ZHIFQX = {}
	CC.ZHIFQX[1] = {"白阳破晓","条件：指法能力100可以激活。","攻击时30%几率封穴1/2/3/4/5点。","10","5","100"}
	CC.ZHIFQX[2] = {"执念断妄","条件：白阳破晓三级，指法技巧150。","攻击时30%几率根据敌方封穴值增加2/3/4倍伤害。","10","3","150"}
	CC.ZHIFQX[3] = {"日坐愁城","条件：执念断妄二级，指法技巧200。","攻击时30%几率提高30%/40%/50%伤害。","10","3","200"}	
	CC.ZHIFQX[4] = {"烈火燎原","条件：日坐愁城二级，指法技巧300。","攻击时30%几率增加100/200/300点气攻值。","10","3","300"}
	CC.ZHIFQX[5] = {"风火无边","条件：烈火燎原二级，指法技巧350。","攻击时30%几率减少1/2/3/4/5点体力值。","10","5","350"}
	CC.ZHIFQX[6] = {"烈阳普照","条件：风火无边三级，指法技巧400。","攻击时30%几率减少100/200/300内力值。","15","3","400"}--=3+3+5+3+5+6 = 24

	CC.ZHIFQX[7] = {"空山灵雨","条件：白阳破晓三级，指法技巧150。","攻击时30%几率减少50/100点生命值。","10","2","150"}
	CC.ZHIFQX[8] = {"黄泉寒雾","条件：空山灵雨二级，指法技巧200。","攻击时30%几率使敌人集气停止6/7/8/9/10时序。","10","5","200"}
	CC.ZHIFQX[9] = {"九续雪寒","条件：黄泉寒雾二级，指法技巧250。","攻击时30%几率增加3/4/5层迟缓值。","10","3","250"}
	CC.ZHIFQX[10] = {"冥河雪涌","条件：九续雪寒二级，指法技巧300。","攻击时增加连击几率30%/40%/50%。","10","3","300"}
	CC.ZHIFQX[11] = {"冰寒雪冷","条件：冥河雪涌二级，指法技巧300。","攻击时30%增加1/2连击次数。","15","2","300"}			
	CC.ZHIFQX[12] = {"荡为寒烟","条件：冰寒雪冷二级，指法技巧400。","攻击时30%集气紊乱6/7/8/9/10时序。","10","5","400"}--=2+5+4+3+10.5=

	CC.ZHIFQX[13] = {"万魄枯魂","条件：白阳破晓三级，指法技巧150。","攻击时30%暴击提升20%/30%/40%/50%，暴击倍数2/3/4/5倍。","10","4","150"}
	CC.ZHIFQX[14] = {"绝浪凌波","条件：万魄枯魂二级，指法技巧200。","攻击时30%几率封穴10/15/20/25/30封穴值，现有25%/30%/35%/40%/45%内力值。","10","5","200"}	
	CC.ZHIFQX[15] = {"战鼓鸣笛","条件：绝浪凌波二级，指法技巧250。","攻击时30%增加6/7/8/9/10点无明业火状态。","10","5","250"}	
	CC.ZHIFQX[16] = {"射石饮羽","条件：战鼓鸣笛二级，指法技巧300。","攻击时30%几率根据自身指系50%/60%/70%/80%增加伤害。","10","4","300"}
	CC.ZHIFQX[17] = {"天惊石破","条件：射石饮羽二级，指法技巧400。","攻击时30%几率进入隐匿状态2/4/4时序。","15","3","400"} -- = 4+4+4+5+6

	CC.ZHIFQX[18] = {"九幽夺魂","条件：学会魔渡八方，指法技巧400","攻击时30%麻痹不醒状态1回合。","60","1","400"}
	CC.ZHIFQX[19] = {"魔渡八方","条件：战鼓鸣笛二级，指法技巧350","攻击时30%根据2倍封穴值10/20/30/40/50时序丢失内力。","10","5","350"}--=4+4+5+6+5
	CC.ZHIFQX[20] = {"邪性定聚","条件：指法技巧310。","攻击时30%根据封穴值15/30时序丢失生命","15","2","310"}
	CC.ZHIFQX[21] = {"鬼啸问天","条件：邪性定聚二级，指法能力400。","攻击时无视闪避","50","1","400"}

	--剑法
	CC.JIANFQX = {}
	--1名称 ， 2 条件， 3效果，4消耗，5等级，6御剑条件 
	CC.JIANFQX[1] = {"纵观天地","条件：御剑能力100可以激活。","攻击时30%增加冰封值1/2/3/4/5点。","10","5","100"}
	CC.JIANFQX[2] = {"剑影纵横","条件：纵观天地三级，御剑能力150。","攻击时30%减少生命100/150/200点。","10","3","150"}
	CC.JIANFQX[3] = {"以意成型","条件：剑影纵横二级，御剑能力200。","攻击时30%减少内力300/400/500点。","10","3","200"}	
	CC.JIANFQX[4] = {"随心所意","条件：以意成型二级，御剑能力300。","攻击时30%减少体力1/2/3点。","10","3","300"}
	CC.JIANFQX[5] = {"意转乾坤","条件：随心所意二级，御剑能力350。","攻击时30%自身增加50/60/70/80/90点生命。","10","5","350"}
	CC.JIANFQX[6] = {"情意归心","条件：意转乾坤三级，御剑能力400。","攻击时30%自身增加1/2/3点体力。","15","3","400"}--=3+3+5+3+5+6 = 24

	CC.JIANFQX[7] = {"剑迭晖煌","条件：纵观天地三级，御剑能力150。","攻击时30%几率附加10/20层迟缓值。","10","2","150"}
	CC.JIANFQX[8] = {"日丽中天","条件：剑迭晖煌二级，御剑能力200。","攻击时30%根据敌冰封值的1%/2%/3%/4%/5%倍增加伤害。","10","5","200"}
	CC.JIANFQX[9] = {"落霞孤鹜","条件：日丽中天二级，御剑能力250。","攻击时30%根据敌冰封值2/3/4/5倍减少内力。","10","4","250"}
	CC.JIANFQX[10] = {"夜雨飞花","条件：落霞孤鹜二级，御剑能力300。","攻击时30%敌人处于刺目状态。","30","1","300"}
	CC.JIANFQX[11] = {"浪汤碧江","条件：夜雨飞花一级，御剑能力300。","攻击时30%敌人集气紊乱10/20时序。","15","2","300"}			
	CC.JIANFQX[12] = {"碎破穹苍","条件：浪汤碧江一级，御剑能力400。","攻击时30%敌人进入混乱状态。","50","1","400"}--=2+5+4+3+10.5=

	CC.JIANFQX[13] = {"化金元诀","条件：纵观天地三级，御剑能力150。","攻击时30%根据敌冰封值3/6/9/12时序减血。","10","4","150"}
	CC.JIANFQX[14] = {"绝木干罡","条件：化金元诀二级，御剑能力200。","攻击时30%根据敌冰封值4/8/12/16/20时序减内。","10","5","200"}	
	CC.JIANFQX[15] = {"灭水空焰","条件：绝木干罡二级，御剑能力250。","攻击时30%根据自身攻击力2/4/6/8/10时序恢复生命。","10","5","250"}	
	CC.JIANFQX[16] = {"御火吞天","条件：灭水空焰二级，御剑能力360。","攻击时30%根据自身防御力3/6/9/12时序恢复内力。","10","4","360"}
	CC.JIANFQX[17] = {"断土狂雷","条件：御火吞天二级，御剑能力400。","攻击时30%减少当前3%/4%/6%生命值。","15","3","400"} -- = 4+4+4+5+6

	CC.JIANFQX[18] = {"独点寒松","条件：妙连天机五级，御剑能力400。","攻击时30%增加2/4/6/8层麻痹状态。","15","4","400"}
	CC.JIANFQX[19] = {"妙连天机","条件：灭水空焰二级，御剑能力350。","攻击时30%增加3/6/9/12/15时序无明业火状态。","10","5","350"}--=4+4+5+6+5
	CC.JIANFQX[20] = {"天地玄空","条件：绝木干罡二级，御剑能力310。","攻击时30%停止5/10/15时序集气。","10","3","310"}
	CC.JIANFQX[21] = {"乾坤剑傲","条件：天地玄空二级，御剑能力400。","攻击时30%敌人昏迷1回合。","50","1","400"}

	--耍刀
	CC.SHUADQX = {}
	--1名称 ， 2 条件， 3效果，4消耗，5等级，6御剑条件 
	CC.SHUADQX[1] = {"千铸仞","条件：耍刀技巧100可以激活。","提升自身刀系数10%/20%/30%/40%/50%的防御力","10","5","100"}
	CC.SHUADQX[2] = {"沉星月","条件：千铸仞三级，耍刀技巧150。","刀法攻击时自身2/4/6/8/10格内敌人，承受20%/40%/60%/80%/100%的伤害加成","10","5","150"}
	CC.SHUADQX[3] = {"太虚炁","条件：沉星月二级，耍刀技巧200。","刀法攻击增加20%/40%/60%/80%/100%气攻，并恢复12%/14%/16%/18%/20%内力。","10","5","200"}	
	CC.SHUADQX[4] = {"交阴阳","条件：太虚炁二级，耍刀技巧300。","使用阳刀打非阳内、阴刀打非阴内敌人，调和刀打非调和内敌人，敌方集气紊乱5/10/15/20/25点。","10","5","300"}
	CC.SHUADQX[5] = {"象盘古","条件：交阴阳二级，耍刀技巧350。","刀法攻击时15%/20%/25%机率，触发5/10/15格极意，并附加战神状态10/15/20时序。","20","3","350"}
	CC.SHUADQX[6] = {"辟鸿蒙","条件：象盘古三级，耍刀技巧400。","刀法攻击时30%机率降低敌方刀系数，并附加敌我刀系数差异的真实伤害。","50","1","400"}--=3+3+5+3+5+6 = 24

	CC.SHUADQX[7] = {"慈航引","条件：千铸仞三级，耍刀技巧150。","刀法攻击时有5%/10%/15%/20%/25%机率，降低敌方3/6/9/12/15点战意以及5点怒气。","10","5","150"}
	CC.SHUADQX[8] = {"涤罪角","条件：慈航引二级，耍刀技巧200。","若敌方道德低于20/40/60/80/100，机率降低敌方200/300/400/500/600内力并禁止恢复内力2回合。","10","5","200"}
	CC.SHUADQX[9] = {"佛刑禅","条件：涤罪角二级，耍刀技巧250。","若敌方道德低于60/80/100，机率降低敌方250/350/450生命并禁止恢复生命2回合。","20","3","250"}
	CC.SHUADQX[10] = {"菩提间","条件：佛刑禅二级，耍刀技巧300。","攻击时有10%/20%/30%机率清除全场我方的中级debuuf","20","3","300"}
	CC.SHUADQX[11] = {"轮回末","条件：菩提间二级，耍刀技巧300。","击杀敌人时有15%/30%机率，使该敌人复活时仅恢复1点血量。","40","2","300"}			
	CC.SHUADQX[12] = {"涅盘初","条件：轮回末二级，耍刀技巧400。","每击杀一名敌人，有20％机率获得「涅盘」，自身若死亡可半血复活。","50","1","400"}--=2+5+4+3+10.5=

	CC.SHUADQX[13] = {"虚影刀","条件：千铸仞三级，耍刀技巧150。","攻击时30%机率，附加2/4/6/8/10时序的闪避。","10","5","150"}
	CC.SHUADQX[14] = {"惊鸿刀","条件：虚影刀二级，耍刀技巧200。","攻击时30%机率，增加下回合集气速度5/10/15/20/25点。","10","5","200"}	
	CC.SHUADQX[15] = {"萧索刀","条件：惊鸿刀二级，耍刀技巧250。","攻击时30%机率，附加15/20/25时序的冰心状态以及暴怒debuff。","20","3","250"}	
	CC.SHUADQX[16] = {"疏狂刀","条件：萧索刀二级，耍刀技巧360。","攻击时30%机率，增加自己怒气6/8/10点。","20","3","350"}
	CC.SHUADQX[17] = {"碎梦刀","条件：疏狂刀二级，耍刀技巧400。","攻击时对同时拥有昏迷、恐惧、头晕目眩、睡眠状态的敌人一击必杀。","100","1","400"} -- = 4+4+4+5+6

	CC.SHUADQX[18] = {"开天地","条件：千铸仞五级，耍刀技巧400。","怒气爆发时，第一击必全屏攻击并无视反弹反击","100","1","400"}
	CC.SHUADQX[19] = {"定沧海","条件：开天地一级，耍刀技巧450。","刀法攻击时30%机率，全场敌方停止集气20时序。","125","1","450"}--=4+4+5+6+5
	CC.SHUADQX[20] = {"断山岳","条件：定沧海一级，耍刀技巧500。","刀法攻击时无视敌方70％防御力。","150","1","500"}
	CC.SHUADQX[21] = {"斩云空","条件：断山岳一级，耍刀技巧550。","刀法攻击时20%机率自身满怒气满战意，统合全场角色怒气及战意，扣除敌方统合值的血量与内力，之后清空怒气及战意。","175","1","550"}


	
	--奇门
	CC.QIMQX = {}
	--1名称 ， 2 条件， 3效果，4消耗，5等级，6御剑条件 特殊兵器
	CC.QIMQX[1] = {"虎狼势","条件：奇门兵器100。","奇门招式增加1/2/3/4/5攻击范围。","10","5","100"}
	
	CC.QIMQX[2] = {"龙狼牙","条件：虎狼势三级，奇门兵器150。","伤害额外附加30/40/50/60/70%的兵器攻击力。无兵器则以特系数60%计算","10","5","150"}
	CC.QIMQX[3] = {"无瑕击","条件：龙狼牙三级，奇门兵器200。","额外增加招式格挡触发机率、所有格挡成功机率3/6/9/12/15%","10","5","200"}	
	CC.QIMQX[4] = {"贯云枪","条件：无暇击三级，奇门兵器300。","有8/16/24%机率使敌方禁疗10/20/30时序","20","3","300"}
	CC.QIMQX[5] = {"涤瑕劲","条件：贯云枪二级，奇门兵器350。","该场战斗有1/2/3次机会，当前攻击回合结束且自身血量低于50%时，清除绝大部分debuff，回复5/10/15%血量，接下来三回合内必定触发格挡。","20","3","350"}
	CC.QIMQX[6] = {"九龙天","条件：涤瑕劲二级，奇门兵器400。","该次攻击有40%机率变为全屏攻击，该次攻击回合霸体，攻击结束后根据特系数回复血量、增加回气。","50","1","400"}--=3+3+5+3+5+6 = 24

	CC.QIMQX[7] = {"子午行","条件：虎狼势三级，奇门兵器150。","额外增加轻功闪避2/4/6/8/10%机率。升到第五级时，被武功反击额外判定30%机率闪避","10","5","150"}
	CC.QIMQX[8] = {"天地反","条件：子午行三级，奇门兵器200。","攻击或被攻击时，有5/10/15/20/25%机率，将敌方攻防衰减15/20/25/30/35%调反计算","10","5","200"}	
	CC.QIMQX[9] = {"诡兵道","条件：天地反三级，奇门兵器300。","敌方攻击时，有15/25/35%机率，衰减其兵器攻击力的1/2/3倍伤害，若敌方空手，以其五系数平均之50%计算","20","3","300"}
	CC.QIMQX[10] = {"凶亡破","条件：诡兵道二级，奇门兵器350。","前200时序内，攻击有20/30/40%机率，减少敌方「500/700/1000扣除当前时序数」的防御值、气防值","20","3","350"}
	CC.QIMQX[11] = {"问途寒","条件：凶亡破二级，奇门兵器400。","攻击时机率将敌我攻击力差转化部分为真实伤害。机率保底为15%，每会一门枪法增加2%机率、80～160点真实伤害。","50","1","400"}	
	CC.QIMQX[12] = {"天魔叱","条件：问途寒一级，奇门兵器450","行动后有固定30%机率，对自身八格内敌方附加昏迷/魅惑/混乱三者之一，并根据基础异常总和扣除血量与内力","50","1","400"}--=2+5+4+3+10.5=

	CC.QIMQX[13] = {"幻胧穿","条件：虎狼势四级，奇门兵器300。","攻击时有12/24/36%机率附加封穴，并提升自身集气10点。","20","3","300"}
	CC.QIMQX[14] = {"火神鸣","条件：虎狼势四级，奇门兵器300。","攻击时有12/24/36%机率附加灼烧，并根据敌方灼烧量回复自血量、增加战意","20","3","300"}	
	CC.QIMQX[15] = {"血时雨","条件：虎狼势四级，奇门兵器300。","攻击时有12/24/36%机率附加流血。若敌方流血超过50，附加撕裂并溅射其3格内邻近敌方撕裂","20","3","300"}
	CC.QIMQX[16] = {"三途暗","条件：虎狼势四级，奇门兵器300。","攻击时有12/24/36%机率附加中毒，并根据中毒程度计算机率附加目盲、虚弱。","20","3","300"}
	CC.QIMQX[17] = {"黄泉沉","条件：虎狼势四级，奇门兵器300。","攻击时有12/24/36%机率附加内伤，并根据内伤程度计算机率增加伤害、附加锁足","20","3","300"} -- = 4+4+4+5+6
	
	CC.QIMQX[18] = {"乱春岚","条件：虎狼势五级，奇门兵器400。","怒气爆发时，该回合攻击无视断连击","100","1","400"}
	CC.QIMQX[19] = {"鏖杀阵","条件：乱春岚一级，奇门兵器450。","战意爆发时，机率使全体我方满怒气，并附加神兵状态","125","1","450"}--=4+4+5+6+5
	CC.QIMQX[20] = {"天水影","条件：鏖杀阵一级，奇门兵器500。","攻击时根据怒气计算机率，若触发反弹时，再反弹","150","1","500"}
	CC.QIMQX[21] = {"鬼龙袭","条件：天水影一级，奇门兵器550。","自身满战意、满怒气时触发，攻击时对场上战意最低者计算特别伤害，计算后若敌方血量低于666，低机率斩杀","175","1","550"}
	--内功

	CC.NEIGQX = {}
	--1名称 ， 2 条件， 3效果，4消耗，5等级，6内力条件 （未使用）
	CC.NEIGQX[1] = {"气纳如海","未制作。","主运易筋神功时，被攻击获得2层易筋神功BUFF,初始50,上限100,回合开始前按BUFF点数值回复生命内力,受到攻击时按BUFF点数值减伤+50,攻击时按BUFF点数值附加真实伤害+100。","100","1","5000"}
	CC.NEIGQX[2] = {"汇尽百川","条件：未制作。","主运天魔功额外暴怒一次。化功大法被动吸取内力体力并转化为种魔护盾。被攻击获得2层暴走状态,初始20,上限50,按BUFF点数值减伤,内功天赋为天魔功时攻击50%天魔音10-15时序混乱。","100","1","7000"}
	CC.NEIGQX[3] = {"波澜壮阔","条件：未制作。","主运葵花、吸星、乾坤、圣火之一时葵花、吸星、乾坤、圣火一同视为主运。","100","1","7000"}
	CC.NEIGQX[4] = {"轻影灵水","条件：未制作。","使用武功消耗的内力跟体力减少50%，攻击时将25%杀气转化为攻击,被攻击时将50%杀气转化为回血。人物为男性并且佛怒等级为2，天赋内功狮子吼/金刚禅狮子吼自运","50","2","7000"}
	CC.NEIGQX[5] = {"怒海纵横","条件：未制作。","主运九阳时纯阳无极功自动运功，被攻击获得2层九阳神功BUFF,初始50,上限100,回合开始前按BUFF点数值回复生命,受到攻击时按BUFF点数值两倍减伤+100,攻击时按BUFF点数值附加真实伤害+100。","100","1","5000"}
	CC.NEIGQX[6] = {"气涌山河","条件：未制作。","1级减伤80,30%概率减伤150-250。2级20%概率减伤50%。","50","2","7000"}
	CC.NEIGQX[7] = {"天若无水","条件：未制作。","内功天赋为先天功时先天功自动运功,神照经/长生诀复活变为被动，复活后获得500点先天护盾。被攻击获得获得2层养神状态,初始20,上限50,受到攻击时按BUFF点数减伤。","100","1","6000"}
	CC.NEIGQX[8] = {"大浪淘沙","条件：未制作。","每时序恢复10点生命20点内力,3时序1点体力，2级50%几率用双倍内力抵消30%伤害,枯荣禅功自动运功。","50","2","6000"}
	CC.NEIGQX[9] = {"云海波涛","条件：未制作。","主运九阴时逆运真经自动运功，被攻击获得2层九阴神功BUFF,初始50,上限100,回合开始前按BUFF点数值回复内力,受到攻击时按BUFF点数值减伤+50,攻击时按BUFF点数值附加2倍真实伤害+200。","100","1","5000"}
	CC.NEIGQX[10] = {"混俗和光","条件：未制作。","受到攻击15%几率免疫伤害一次。","50","1","4000"}
	CC.NEIGQX[11] = {"浑然武垢","条件：未制作。","生命上限额外提升1/2/3/4/5点，5级免疫杀气、免疫破绽、内功天赋为龙象般若功时自动运功。","20","5","5000"}
	CC.NEIGQX[12] = {"大道无形","条件：未制作。","吸收20%受到的伤害，降低25%受到的杀气。天赋内功为瑜伽密乘,自动运功。","50","2","5000"}
	CC.NEIGQX[13] = {"生育天地","条件：未制作。","主运太玄神功，战斗开始前80时序受到的伤害不超过300点。","100","1","4000"}
	CC.NEIGQX[14] = {"运行日月","条件：未制作。","行动后回复100点生命值200点内力值和5点体力值，随机获得一种药品BUFF,2级每回合结束怒气+10,内功天赋为蛤蟆功/鲸息功/混元功时10%概率爆怒一次。","50","2","4500"}
	CC.NEIGQX[15] = {"逍遥御风","条件：未制作。","主运大周天/北冥/小无八荒之一时大周天/北冥/小无八荒一同视为主运。","100","1","6800"}
	CC.NEIGQX[16] = {"速水无痕","条件：未制作。","免疫来自伤害追加的杀气，2级回合开始时清除异常状态,30%免疫反击,反弹等。","50","2","5000"}
	CC.NEIGQX[17] = {"斗转星移","条件：未制作。","阴内攻击时10/15/20/25/30%概率使目标冻结5时序。被攻击时40%概率冰盾护体1回合,减伤10/15/20/25/30%,5级冷禅减伤50,学会寒冰真气30%概额外减伤100-180点。","10","5","4500"}
	CC.NEIGQX[18] = {"万佛朝宗","条件：未制作。","每次行动前50%概率使敌方全体集气位置倒退40/80/120/160/200。","15","5","4000"}
	CC.NEIGQX[19] = {"天之苍穹","条件：未制作。","回合结束时50%概率增加300点集气。2级集气速度+4,回气+1,内功天赋为玉女心经而且为女性自动运功。","50","2","4000"}
	CC.NEIGQX[20] = {"天道混元","条件：未制作。","内功天赋为太极神功时自动运功，蓄力只清除50%，真太奥25%几率1时序内受到的伤害不超过30点。","100","1","4000"}

	
    

    CC.PTFSM = {}
    CC.PTFSM[9999] ={'仁阳佛光','内力上限提升1000点，可使用九阳神功攻击；主运九阳神功即视为满足九阳组合条件',3}
    CC.PTFSM[9998] ={'天域幻音','行动结束时友方行动结束清除流血、中毒、冰封、灼烧、内伤并回复最多1000点生命值',1}--
    CC.PTFSM[9997] ={'仙剑神猿','使用剑系武功攻击时，敌方御剑系数减半，可装备白猿,猿公剑法威力+500。',1}
    CC.PTFSM[9996] ={'闪电惊鸿','初始集气值1000，每次攻击后自身集气+200，连击率+50%，每学会一种剑法,伤害提升5%。',3}
    CC.PTFSM[9995] ={'菩提金身','受到的伤害降低30%，受到连击暴击伤害减伤50%，主运易筋经可以反弹敌人昏迷',3}
    CC.PTFSM[9994] ={'无量禅震','使用伏魔杖法必定暴击，攻击如被闪避则追加一次攻击，伏魔伏法必暴击，追加内伤，并追加内伤值伤害。',3}
    CC.PTFSM[9993] ={'佛门无双','除洗髓经外所有少林武功无条件学习，主运少林内功时，开场为自己附加金刚盾',3}
    CC.PTFSM[9992] ={'圣火明尊','攻击必灼烧，灼烧大于25点必点燃。点燃后会造成小范围伤害，附加阳气污染',1}
    CC.PTFSM[9991] ={'魔道天行','我方全体攻击伤害×120％，敌方全体攻击伤害×90％；主运天魔功就可触发天魔组合特效。',3}
    CC.PTFSM[9990] ={'逆转乾坤','乾坤大挪移必反弹，且可同时反弹给两个人（学会乾坤大挪移后）反弹伤害100%。免疫暗器',3}
    CC.PTFSM[9989] ={'傲世神罡','攻击必暴击，必破防30%，必触发打狗招式。',1}
    CC.PTFSM[9988] ={'天池怪侠','被攻击时概率转移杀气值给攻击者，攻击系数只算拳法，百花错拳威力+600。',1}
    CC.PTFSM[9987] ={'博通百家','战斗中系数必然不低于对方*免疫破绽，暴怒时攻击必中破绽*修炼所有武功需求-20，无视内力阴阳属性，不会强制调和，增加内功组合概率5%',1}
    CC.PTFSM[9986] ={'天佛降世','学会金刚不坏神功必定触发“金刚不坏”特效，战斗中可以复活一次(易筋经组合判定成功能免疫无视复活)，复活后免疫内伤，免疫暴击伤害。',3}
    CC.PTFSM[9985] ={'诸行无常','可使用内功攻击，武功范围+1。',2}
    CC.PTFSM[9984] ={'诸法无我','每行动一次，自身伤害+10%,受到的伤害-10%。(上限6次)',2}
    CC.PTFSM[9983] ={'悲天佛怜','生命值低于80%，拥有绝对气防，被攻击使用根据敌我拳法差反伤，般若掌攻击范围变为点，威力翻倍',3}
    CC.PTFSM[9982] ={'无我无剑','被攻击前根据自身御剑值判定先手反击，先手反击后根据自身御剑值判定打断对方攻击，独孤求败必然触发反击、打断效果（高级免疫反击免疫）。',3}
    CC.PTFSM[9981] ={'小王爷','武功练到极，减少受到的5%伤害与杀气（上限35%）',2}
    CC.PTFSM[9980] ={'无妄无我','每获得一本天书，伤害增加2%，受伤害降低1%',2}
    CC.PTFSM[9979] ={'九字真言','行动前概率触发九字真言其中的一种或多种，随天书跟实战的增加而增加触发最大数量*临：减伤至999点*兵：破防40%*斗：气攻提升800*者：气防提升800*列：击中移动减3*皆：必击中破绽*阵：击中目标内力-200*在：攻击必灼烧*前：攻击范围扩大。',1}
    CC.PTFSM[9978] ={'大唐双龙·冰','免疫冰封，攻击必冰封，概率冰冻敌方并使敌方时序减血',2}
    CC.PTFSM[9977] ={'大唐双龙·炎','免疫灼烧，攻击必灼伤，概率点燃',2}
    CC.PTFSM[9976] ={'神游太虚','免疫正面90°角攻击，正面两侧30%概率免疫，暴怒时必定免疫；移动时有独立动画',3}
    CC.PTFSM[9975] ={'剑魔再临','玄铁剑法攻击时发动两种特效之一：天极剑渊：破防50%，破尽天下：无视气防，气攻增加800',3}
    CC.PTFSM[9974] ={'九剑真传','独孤九剑攻击时发动四种特效，荡剑式：集气+200，撩剑式：伤害+30%，倒剑式：强制杀气150，离剑式：伤害不随距离递减;被攻击时发动破X式，减少受到的伤害20%，攻击方下回合集气位置-200',3}
    CC.PTFSM[9973] ={'其疾如风','概率发动，攻击时发动后已方集气位置+100，自身集气位置+300',1}
    CC.PTFSM[9972] ={'侵略如火','概率发动，攻击气攻增加1000，必破气防，强制杀气100点，扣血100点。',1}
    CC.PTFSM[9971] ={'不动如山','概率发动，被攻击只受到伤害30点',1}
    CC.PTFSM[9970] ={'其徐如林','概率发动，被攻击增加自身集气，最多增加20点',1}
    CC.PTFSM[9969] ={'琅琊公子','战斗中系数必然不低于对方,可以自由切换林殊/梅长苏两个身份',3}
    CC.PTFSM[9968] ={'决胜千里','每回合50％几率触发，敌方集气-150，本方集气+150。',1}
    CC.PTFSM[9967] ={'葵花挪移','自带35%几率挪移，主运葵花神功时被攻击，增加25%概率触发「真葵花移行」。',2}
    CC.PTFSM[9966] ={'氤氲紫气','受到的气攻与伤害减少30%，免疫连击',1}
    CC.PTFSM[9965] ={'酒神八杯','羊脂白玉杯：此杯极为珍贵，可卖出2万两*犀角杯：战场中每次喝酒集气增加3点，下回合集气位置提升*古藤杯：战斗结束随机获得一颗（灵芝、地灵外）的药*青铜爵：战斗结束随机获得一坛酒*夜光杯：连击率大幅度降低，暴怒必定连击*琉璃杯：5%概率触发“酒神迷踪步”闪避，喝酒后概率增加30%*古瓷杯：被攻击时免疫破绽，暴怒必中破绽；攻击时无法出破绽，暴怒必中破绽*翡翠杯：免疫冰封灼烧',2}
    CC.PTFSM[9964] ={'飞云回转刀','16把飞刀在自身8x8格范围内随机移动，飞刀1x1范围内的敌方时序50点生命损失3流血，飞刀重叠位置时序100点生命损失6流血',1}
    CC.PTFSM[9963] ={'破剑八刀','反弹50%伤害，持续10时序，10时序的cd时间',1}
    CC.PTFSM[9962] ={'万里独行','移动距离增加2格,免疫锁足*战场上已方人员越少集气速度提升越多*集气速度提升值为：20-在场队友数量×4',1}
    CC.PTFSM[9961] ={'金蛇缠丝手','攻击时30%造成锁足；每间隔30时序，将随机一名敌方目标拉至自身3x3范围内随机位置锁足',2}
	CC.PTFSM[9960] ={'拳法精通','拳拳威力+100，攻防无视目标拳掌功夫20%',2}
	CC.PTFSM[9959] ={'指法精通','指法威力+100，攻防无视目标指法功夫20%',2}
	CC.PTFSM[9958] ={'剑法精通','剑法威力+100，攻防无视目标御剑能力20%',2}
	CC.PTFSM[9957] ={'刀法精通','刀法威力+100，攻防无视目标刀法技巧20%',2}
	CC.PTFSM[9956] ={'奇门精通','奇门威力+100，攻防无视目标特殊兵器20%',2}
	CC.PTFSM[9955] ={'神拳无敌','拳拳威力+200，攻防无视目标拳掌功夫40%',2}
	CC.PTFSM[9954] ={'千手神通','指法威力+200，攻防无视目标指法技巧40%',2}
	CC.PTFSM[9953] ={'剑法大成','剑法威力+200，攻防无视目标剑法功夫40%',2}
	CC.PTFSM[9952] ={'傲世狂刀','刀法威力+200，攻防无视目标耍刀技巧40%',2}
	CC.PTFSM[9951] ={'奇门无双','奇门威力+200，攻防无视目标特殊兵器40%',2}
	CC.PTFSM[9950] ={'越战越勇','减伤15%，气血越少减伤越高，最多减伤55%',2}
	CC.PTFSM[9949] ={'入魔','暴怒时有一定概率进入入魔状态，免疫封穴杀气，吸血20%（上限800）。且必连击概率三连击。暴怒结束入魔结束。',1}
	CC.PTFSM[9948] ={'傲寒六诀','攻击时周身10格范围敌人冰封20点，概率触发傲寒六诀冻结10时序，聂风、宗主有特殊效果。',1}		
	CC.PTFSM[9947] ={'化气成兵','面板上每存在一门内功，战斗中自身五系兵器值额外附加30点。',2}
	CC.PTFSM[9946] ={'浩然罡气','被动效果：每修炼一个内功气防+100，气攻+100。气攻10%转化为伤害。暴怒必破气防。主动效果：受到攻击概率发动"浩然罡气护体",减少受到的伤害与气攻（气防决定减少的数值）。内功攻击概率发动"浩然罡气"对目标追加部分气攻值的伤害，暴怒追加的伤害增加。',1}
	CC.PTFSM[9945] ={'御气纵横','每20时序触发一次攻击',3}
	CC.PTFSM[9944] ={'流云飞袖','被攻击30%概率抵挡伤害，且进行反击，伤害为120%，不可与斗转同时触发。',1}	
	CC.PTFSM[9943] ={'妙手仁心','使用药物效果根据难度翻倍，行动后一半概率医疗自己。',2}
	CC.PTFSM[9942] ={'听风辨位','攻击必命中。',1}			
	CC.PTFSM[9941] ={'剑神','进战集气位置1000,Ｗ每个剑法到极减少伤害10%,每个剑法到极增加伤害10%。',2}
	CC.PTFSM[9940] ={'五蕴皆空','亦复如是：Ｗ被攻击时概率触发，把受到的伤害完全反弹给攻击方（包括暗器）。*受想行识：Ｗ行动前概率触发，敌方会随机获得DEBUFF。',4}			
	CC.PTFSM[9939] ={'毗婆舍那','达摩受到攻击不会产生怒气，但每时序增加1点怒气。,*达摩攻击会减少目标的最大生命值。每攻击一次减少2%,*达摩每回合行动前内力、体力、怒气，生命只要其中一项恢复到满状态，生命、内力、体力随机一项恢复到满状态。',4}			
	CC.PTFSM[9938] ={'天下无敌','天下无敌的凭证（全面板主运）！',4} 
	--CC.PTFSM[9937] ={'八卦高手','八卦刀法与八卦游身掌必出招式，威力+200。',3} 
	CC.PTFSM[9936] ={'丐帮帮主','学习打狗棒法与降龙十八掌无视内属与系数条件。',3} 
	CC.PTFSM[9935] ={'冰肌玉骨','免疫冰封，攻击必触发冰封。受到的伤害减少30%，攻击伤害减少20%',2} 
	CC.PTFSM[9934] ={'剑法无极','剑法攻击时无视目标10%防御，每学会一门剑法至极，剑法破防效果增加10％',2}
	CC.PTFSM[9933] ={'仁者无敌','道德高于100时，被暴击无伤，被连击前三次无伤。标主仁者额外享受全局机率判定增加10%成功率',1}
	CC.PTFSM[9932] ={'龙象般若','蓄力状态下被攻击集气位置+100。',1} 
	CC.PTFSM[9931] ={'十龙十象','伤害提升50%，受到的伤害减少50%。',1} 
	CC.PTFSM[9930] ={'黑级浮屠','战场三围属性提升30%，时序回复2点封穴内伤中毒12点内力值，被攻击时，40%几率触发“黑级浮屠”完全免疫杀气和内伤，主运易筋经即可判定组合。',3} 	
	CC.PTFSM[9929] ={'万寿道藏','攻击时触发"天之道"附加目标生命最大值5%的伤害。九阴神爪极意必两连，40%机率三连，暴怒必三连；主运九阴即可判定组合。',3}	
	CC.PTFSM[9928] ={'易筋洗髓','修炼武功获得双倍三围属性系数*主运易筋经提升任意武功威力，效果为200+天书数量X50',1}	
	CC.PTFSM[9927] ={'白首太玄','资质50及以下三维下限为1500，资质50以上可以突破2500三维上限，*主运太玄即可判定组合，太玄组合触发时资质50以上攻击减少敌人60%防御，资质50以下60%概率无视敌人高级减伤',3}	--标记修改
	CC.PTFSM[9926] ={'老汉推车','行动后扣除1点体力*回复25%损失内力',1}	--标记修改
	--106
	--CC.PTFSM[9925] ={'仁者无敌','道德高于100时，免疫暴击、连击伤害',1}
	CC.PTFSM[9924] ={'汤大侠','攻击（100-道德）概率1.5倍伤害',1}	
	CC.PTFSM[9923] ={'甘霖惠七省','行动结束时回复我方全体最多500点生命值',2}		
	CC.PTFSM[9922] ={'商家堡主','使用八卦掌后八卦刀追加300伤害，使用刀法触发八卦刀组合特效',1}		
	CC.PTFSM[9921] ={'隔壁大王','八卦刀威力1.5倍，受到攻击后30%几率用八卦刀反击',3}		
	CC.PTFSM[9920] ={'隔壁二王','八卦掌威力1.5倍，受到攻击后30%几率用八卦掌反击',3}		
	CC.PTFSM[9919] ={'万恶罪魁','实战上限为9999；阴属性武功的武功威力、攻击最终伤害计算皆受实战加成。限制：需道德小于5才能生效。',3}		
	CC.PTFSM[9918] ={'以气运剪','使用大剪刀对目标追加部分气攻值的伤害',3}		
	--CC.PTFSM[9917] ={'魔刀千刃','战斗中首次被击退可复活一次，变身首席暗影刺客，立即行动*第一格武功变为魔刀千刃，无视敌方50%防御和系数*如击退至少一名敌方，则可再次行动',3}		
	CC.PTFSM[9916] ={'佛山一霸','每有10000银两，伤害提升20%，减伤提高20%，上限60%',1}		
	CC.PTFSM[9915] ={'满洲勇士','满洲摔跤威力翻倍，概率使敌人无法移动一回合',3}		
	CC.PTFSM[9914] ={'韦陀双鹤','使用韦陀掌几率触发“鹤啸九天”*周身六格内目标概率混乱，被击的目标击集气位置倒退300',3}		
	--CC.PTFSM[9913] ={'娑罗双树','被攻击概率吸收50%伤害，附加在下回合攻击中，攻击时概率吸收伤害的50%为自身增加护盾。爆怒后触发【金毗罗陀】清除范围所有敌人身上的怒气。',3}
	CC.PTFSM[9912] ={'鸡你太美','攻击时50%概率使七格内敌人获得魔性音效混乱10时序。',2}
	CC.PTFSM[9911] ={'风中之神','轻功成长加倍，装备附加的轻功和集气加成双倍。',1}
	CC.PTFSM[9910] ={'精忠报国','生命低于50%减伤20%，生命低于25%减伤40%。',1}
	CC.PTFSM[9909] ={'千秋侠烈','生命值低于50%伤害1.25倍，低于25%伤害1.5倍。',1}
	CC.PTFSM[9908] ={'意假情真','暴怒后攻击怒气值概率高机率维持满怒气，低机率怒气减半。',2}
	CC.PTFSM[9907] ={'白驹过隙','15%概率闪避攻击并反击，生命越低，闪避率越高，最高35%闪避率。',1}
	CC.PTFSM[9906] ={'芙蓉金针','攻击根据暗器系数的半数增幅伤害、并直接扣血。',1}
	CC.PTFSM[9905] ={'似水柔情','误伤队友时恢复其血量。',2}
	CC.PTFSM[9904] ={'七心海棠','攻击时敌方全体损失当前血内，并中毒17点，给已方全体随机上一种药品BUFF，除程灵素外会被反噬。',3}
	CC.PTFSM[9903] ={'赤心连城','如本次攻击造成伤害低于500，则追加一次连击（一轮追加上限3次）。',1}
	CC.PTFSM[9902] ={'星宿老仙','连环腐尸毒必出极意，引爆目标身上毒素。',1}
	CC.PTFSM[9901] ={'三笑销魂散','回合结束时按中毒量3倍扣除敌方生命。',1}
	--CC.PTFSM[9900] ={'武中无相','无视限制条件修炼武学秘籍。',3}
	CC.PTFSM[9899] ={'御法绝尘','在场时，敌方全体攻击时不会出现无招胜有招（需要自身五系兵器值之和大于等于500）',1}
	CC.PTFSM[9898] ={'仁义无双','使用刀法必定单击，根据道德追加伤害）',2}
	CC.PTFSM[9897] ={'一指镇江南','指系武功威力随天书提高',1}
	CC.PTFSM[9896] ={'天池红花','初始兵器值大幅提高，被女性攻击伤害×250%，对女性攻击伤害×50% ',3}
	CC.PTFSM[9895] ={'释迦掷象功','必定单击，伤害增加50% ',1}
	CC.PTFSM[9894] ={'罗汉伏魔','学有罗汉伏魔功，攻击时必出【罗汉伏魔】特效，效果增强10% ',1}
	CC.PTFSM[9893] ={'六脉玄机','使用六脉神剑必触发【剑气碧烟横】，内力上限提升1500点；自运天南易阳诀',3}
	CC.PTFSM[9892] ={'铁锁横江','自身范围内一格20%概率免受攻击。',2}
	CC.PTFSM[9891] ={'松风剑神','华山觉醒后松风剑法威力翻倍，必连击，必暴击。',3}
	CC.PTFSM[9890] ={'葵花点穴手','攻击时几率追加1000气攻，且必定造成封穴',1}
	CC.PTFSM[9889] ={'杀人名医','每击退一名敌人集气速度+3点、医疗能力+50（最多5个有效）',1}
	CC.PTFSM[9888] ={'辟邪剑客','辟邪剑法威力提高500点 ',3}
	CC.PTFSM[9887] ={'血海飘香','根据本轮造成的伤害提高下一轮的集气位置，上限800',1}
	CC.PTFSM[9886] ={'曼珠沙华','每击退一个敌方，自身气攻气防提高200点',2}
	CC.PTFSM[9885] ={'千年冰蚕','攻击随机附加1~8层“冰冻状态”，每层减缓1%集气速度，上限50层 ',2}
	CC.PTFSM[9884] ={'冰毒怪客','攻击时，如敌方身上的冰封大于50，则有60%几率将其冻结10时序 ',2}
	CC.PTFSM[9883] ={'福缘深厚','攻击时50%几率触发【福泽加护】，下回合集气+200 ',1}
	CC.PTFSM[9882] ={'离合参商','斗转星移发动几率100%，反击时无视兵器值需求必定发动离合参商 ',1}
	CC.PTFSM[9881] ={'中平神枪','使用中平枪法时，气攻+1000 ',3}
	CC.PTFSM[9880] ={'一空到底','暴怒时使用掌法攻击使敌我双方集气倒退10时序 ',2}
	CC.PTFSM[9879] ={'毓秀灵姝','攻击时必定造成流血 ',1}
	CC.PTFSM[9878] ={'以柔克刚','被攻击时，将一半杀气转化为回血 ',2}
	CC.PTFSM[9877] ={'两仪守护','被攻击时，降低64点伤害、降低640点气攻 ',2}
	CC.PTFSM[9876] ={'我被推了','自带“化子邋遢，观音长发”加力、护体，666威力，可叠加（几率与天书数、实战相关） ',1}
	CC.PTFSM[9875] ={'我当爹了','攻击/防御效果提高10%，加力/护体/出招几率大幅提高，无法休息 ',1}
	CC.PTFSM[9874] ={'采阴补阳','攻击女性时，恢复造成伤害10%的血量（单次攻击吸血上限400点） ',1}
	CC.PTFSM[9873] ={'大轮明王','火焰刀法【大轮密宗.火焰刀】发动几率100% ',1}
	CC.PTFSM[9872] ={'珠落玉盘','行动后提升我方全体100集气 ',1}
	CC.PTFSM[9871] ={'吴侬软语','行动前提升我方全体100集气 ',1}
	CC.PTFSM[9870] ={'风月无间','对男性伤害提高20%，被女性伤害减少20% ',1}
	CC.PTFSM[9869] ={'不老长春','被攻击时概率恢复521点生命 ',1}
	CC.PTFSM[9868] ={'转瞬红颜','每过99时序，自动回满血内体并解除自身基础异常状态 ',2}
	CC.PTFSM[9867] ={'老谋深算','每过199时序，自动回满血内体并解除自身基础异常状态 ',1}
	CC.PTFSM[9866] ={'妙手回春','被攻击时，有15%几率将受到的伤害转化为回血 ',1}
	CC.PTFSM[9865] ={'侠之大者','使用降龙十八掌，必出招式，发动连击时附加随机多重后劲，额外增加真实伤害和杀气。',2}
	CC.PTFSM[9864] ={'带刺玫瑰','被攻击减伤200，反弹10%受到的攻击伤害 ',1}
	CC.PTFSM[9863] ={'兰质蕙心','修炼武功秘籍时，兵器值成长翻倍 ',2}
	CC.PTFSM[9862] ={'过目不忘','修炼武功秘籍时，屬性與兵器值成長翻倍 ',2}
	CC.PTFSM[9861] ={'狂龙天征','使用降龙十八掌，40%几率发动【降龙.三叠浪】全场杀气300，暴怒时概率发动【降龙.六叠浪】使5格敌人混乱 ',2}
	CC.PTFSM[9860] ={'碧海潮生曲','攻击时发动碧海潮生曲,第一击100%概率杀全体敌人内力500，连击时发动概率30% ',3}
	CC.PTFSM[9859] ={'小东邪','攻击时发动碧海潮生曲,第一击扣除全体敌人内力300 ',1}
	CC.PTFSM[9858] ={'倒行逆施','集气时有小概率跳跃（集气值随机增加） ',1}
	CC.PTFSM[9857] ={'蟾震九天','蛤蟆功.蟾震九天效果加强，会根据蓄力值追加伤害 ',1}
	CC.PTFSM[9856] ={'白驼少主','暴怒时，使用雪山白驼掌可触发灵蛇拳，击中的敌人集气进入波动状态20时序 ',2}
	CC.PTFSM[9855] ={'顽童武痴','每行动一次，攻击效果提升10% ',1}
	CC.PTFSM[9854] ={'空明之武道','攻击时，有(25+实战/20)%几率使敌方无法触发内功护体，自运金关玉锁诀 ',2}
	CC.PTFSM[9853] ={'无明业火','使用一阳指，给敌方追加“无明业火”状态，攻击会损失50%内力消耗量的生命，持续30时序 ',2}
	CC.PTFSM[9852] ={'铁腿水上飘','移动步数+5 ',1}
	CC.PTFSM[9851] ={'一气化三清','攻击时机率发动“中神通.一气化三清” 1.3倍伤害 ',2}
	CC.PTFSM[9850] ={'心秀天铃','使用奇门武功几率发动“心秀天铃·星月争辉”*追加800点气攻，如已有14本天书，则触发此特效必破气防 ',2}
	CC.PTFSM[9849] ={'车神的大愿','被扣除不小于九点体力时，只扣除九点体力；无视小于九点的体力扣除效果',1}
	CC.PTFSM[9848] ={'遁甲奇书','修炼奇门遁甲后闪避，增加护盾，修炼奇门五转，攻击时概率引爆奇门护盾造成伤害，奇门五转自运 ',3}
	CC.PTFSM[9847] ={'奔雷手','暴怒时奔雷手概率触发雷动九天，为目标添加一层雷音BUFF，对大于等三层雷音BUFF的目标击晕一回合 ',2}
	CC.PTFSM[9846] ={'豹胎易筋丸','在敌方要服用的药品中加入豹胎易筋丸，使其加血效果变为减血 ',2}
	CC.PTFSM[9845] ={'剑术通神','攻击和被攻击时，无论任何系，均按敌我御剑系数计算加成 ',1}
	CC.PTFSM[9844] ={'无招胜有招','暴怒时，使用独孤九剑攻击，追加1000点气攻，和10时序的静止状态，可叠加 ',1}
	CC.PTFSM[9843] ={'琴铮盈盈','使用持瑶琴，必定发动“七弦无形剑气”，对敌方全体造成50点伤害 ',1}
	CC.PTFSM[9842] ={'慧中灵剑','每修炼一门剑法，攻击效果提升15%，初始集气+150，行动后回气+150 ',1}
	CC.PTFSM[9841] ={'酒神秘踪步','被攻击时有30%几率发动"酒神秘踪步"闪避 ',2}
	CC.PTFSM[9840] ={'夺命三仙','使用剑法连击时变为三连击 ',2}
	CC.PTFSM[9839] ={'狂风快剑','使用剑法攻击，下回合集气+100 ',2}
	CC.PTFSM[9838] ={'火手判官','攻击必定内伤，所造成内伤效果加倍 ',1}
	CC.PTFSM[9837] ={'追魂夺命剑','生命值低于50%时连击率两倍，生命值低于25%时连击率三倍 ',2}
	CC.PTFSM[9836] ={'连环迷踪腿','行动后50%几率使用“连环迷踪腿”攻击周身五格敌人，造成指腿系数/3的伤害 ',2}
	CC.PTFSM[9835] ={'黑无常','攻击时伤害随机增加2%~50% ',2}
	CC.PTFSM[9834] ={'白无常','被攻击时受到伤害随机减少1%~25% ',2}
	CC.PTFSM[9833] ={'西狂之怒啸','攻击时附带“西狂之怒啸”，敌方全体集气倒退100点 ',2}
	CC.PTFSM[9832] ={'一片冰心','左右互搏发动几率70% ',1}
	CC.PTFSM[9831] ={'元蒙帝师','任何攻击追加2000点气攻 ',2}
	CC.PTFSM[9830] ={'外和内刚','生命值低于50%时，攻击效果提升20% ',2}
	CC.PTFSM[9829] ={'青箫落瑛','使用玉箫剑法攻击，可杀敌内力300点 ',2}
	CC.PTFSM[9828] ={'食神','攻击不消耗体力 ',2}
	CC.PTFSM[9827] ={'情为何物','每隔50时序，随机向敌人发射三枚冰魄银针 ',3}
	CC.PTFSM[9826] ={'赤练仙子','五毒神掌变为赤练神掌，追加70点伤害，并强制上毒20点，引爆目标身上毒素 ',2}
	CC.PTFSM[9825] ={'赏善使者','道德高于59，行动后对周身五格范围内队友治疗 ',2}
	CC.PTFSM[9824] ={'罚恶使者','道德低于61，行动后对周身五格范围内敌人施毒 ',2}
	CC.PTFSM[9823] ={'雪山掌门','攻击必冰封，冰封超过50冻结目标，追加冰封值的真实伤害，自身免疫冰封 ',1}
	CC.PTFSM[9822] ={'碧针清掌','行动后使用“碧针清掌”攻击周身七格敌人，造成拳掌系数/5点伤害 ',1}
	CC.PTFSM[9821] ={'通微显化','被攻击几率发动无根无形减伤30% ',2}
	CC.PTFSM[9820] ={'万法自然','攻击时几率下回合集气+500 ',1}
	CC.PTFSM[9819] ={'七伤大成','使用七伤拳必定内伤，追加777点伤害和杀气，恢复自身生命内力 ',4}
	CC.PTFSM[9818] ={'吸血蝙蝠','攻击时，恢复造成伤害10%的血量（单次攻击吸血上限100点） ',2}
	CC.PTFSM[9817] ={'紫衫龙王','每次行动都有20%几率魅惑敌人一回合 ',1}
	CC.PTFSM[9816] ={'志垂日月','暴击效果随天书数量提升 ',2}
	CC.PTFSM[9815] ={'四大恶人','暴击效果提升50% ',2}
	CC.PTFSM[9814] ={'纤纤铁手','使用五毒神掌攻击，随机2-5倍威力 ',1}
	CC.PTFSM[9813] ={'五毒教姑','被攻击使攻击者中毒20点，降低攻击者5点体力，200点内力 ',1}
	CC.PTFSM[9812] ={'没影子','使用剑法攻击追加100点真实伤害，如装备武器，则此加成减半 ',2}
	CC.PTFSM[9811] ={'神拳无敌','使用拳法攻击追加100点真实伤害，如未装备武器，则此加成翻倍 ',1}
	CC.PTFSM[9810] ={'十里坡剑神','每行动一次，攻击效果提升1% ',1}
	CC.PTFSM[9809] ={'一龙一象','提升10%伤害，降低10%承受伤害 ',2}
	CC.PTFSM[9808] ={'机敏无双','战斗开始前50时序，受到的伤害不超过50点 ',1}
	CC.PTFSM[9807] ={'十三太保','免疫破绽，免疫杀气，受到伤害降低13% ',2}
	CC.PTFSM[9806] ={'天元剑气','使用剑系武功攻击时，敌方御剑系数按零计算，使用剑法概率追击一次，中庸觉醒提高至三次 ',2}
	CC.PTFSM[9805] ={'越女剑仙','战场中增加自身御剑系数点攻防值 ',2}
	CC.PTFSM[9804] ={'惊才绝艳','武功威力提高10%，加力/护体/出招几率提高10%，总气攻提高10% ',1}
	CC.PTFSM[9803] ={'轻云蔽月','被攻击时必发动"轻云蔽月"，免疫攻击10时序，冷却时间50时序 ',2}
	CC.PTFSM[9802] ={'踏沙无痕','移动格数+3，攻击后可以再次移动 ',1}
	CC.PTFSM[9801] ={'绍敏郡主','被攻击时，反弹20%受到的攻击伤害 ',2}
	CC.PTFSM[9800] ={'王霸之气','敌方全体集气减半 ',1}
	CC.PTFSM[9799] ={'长平公主','每次行动前有60%几率使敌方全体集气位置倒退150 ',1}
	CC.PTFSM[9798] ={'秀若芝兰','面板上每个外功增加5点集气，每个内功、轻功增加5%减伤，最大50%减伤',1}
	CC.PTFSM[9797] ={'红粉骷髅','对女性攻击伤害×120%，被女性攻击伤害×80% ',1}
	CC.PTFSM[9796] ={'天怒红颜','对男性攻击伤害×120%，被男性攻击伤害×80% ',1}
	CC.PTFSM[9795] ={'晋阳大侠','攻击时必触发“混元一气”造成敌全体内伤。增加1000气功，并附加集气紊乱 ',2}
	CC.PTFSM[9794] ={'刀剑归真','攻击触发动刀剑归真时触发刀剑绝技',3}
	CC.PTFSM[9793] ={'紫衣银鞭','每修炼一个奇门武功到极，减伤提高4%（上限7个）',2}
	CC.PTFSM[9792] ={'何足道哉','气血越少连击、暴击越高 ',2}
	CC.PTFSM[9791] ={'逆流勇进','生命值低于50%时暴击率两倍，生命值低于25%时暴击率三倍 ',2}
	CC.PTFSM[9790] ={'千蛛万毒手','攻击强制上毒20点，根据目标中毒值回复生命，追加敌人生命回复 ',2}
	CC.PTFSM[9789] ={'娇美人妻','被攻击时，消耗攻击方5-10点体力，根据敌人体力缺失损耗生命 ',2}
	CC.PTFSM[9788] ={'光明左使','每次攻击，使敌方受到的伤害提高2%，上限40% ',2}
	CC.PTFSM[9787] ={'光明右使','每次受到攻击，增加自身2%的减伤，上限40% ',2}
	CC.PTFSM[9786] ={'寒露清梦','攻击与被攻击无视敌方武常 ',1}
	CC.PTFSM[9785] ={'清露寒梦','攻击概率无视敌方防御30% ',2}
	CC.PTFSM[9784] ={'天仙锁魂','敌方每回合30%几率附加虚弱状态2回合 ',2}
	CC.PTFSM[9783] ={'天魂锁仙','增加10x(敌方人数)伤害，最多增加60%。 ',2}
	--CC.PTFSM[9782] ={'以暴制暴','受到暴击伤害，自身下次攻击必暴1次，受到连击伤害，下次攻击必连击1次。 ',1}
	--CC.PTFSM[9781] ={'以眼还眼','生命值大于10%时，每次攻击减少自身5%的生命，受到攻击的目标也附加生命最大值5%的伤害。 ',1}
	CC.PTFSM[9780] ={'得意门生','被攻击时几率按自身暴击率率的一半降低伤害。 ',2}
	--CC.PTFSM[9779] ={'银钩铁划','攻击时几率按自身连击率的一半提高伤害。 ',1}
	CC.PTFSM[9778] ={'怡红公子','自带六如苍龙诀。 ',2}
	--CC.PTFSM[9777] ={'春哥的自信','战斗死亡满血复活两次。 ',3}
	CC.PTFSM[9776] ={'甩锅','被攻击时25%几率由其他目标承受伤害。 ',2}
	CC.PTFSM[9775] ={'不粘锅','被攻击时25%几率闪避攻击。 ',1}
	CC.PTFSM[9774] ={'速之极限','自身集气不受基础状态影响；触发抢跑时，转化为真实抢跑。',3}
	CC.PTFSM[9773] ={'冰肌玉骨','被攻击伤害减半，但不减受伤度。 ',2}
	CC.PTFSM[9772] ={'剑荡十方','每行动一次，增加自身10%的伤害和1%的特效概率，行动到第九次每次行动会根据敌我距离伤血，行动到第十次触发无招胜有招，行动到第十一次计数归一。 ',3}
	CC.PTFSM[9771] ={'望雪颦愁','被男性攻击时，免疫双击、免疫暴击伤害。 ',2}
	CC.PTFSM[9770] ={'凉风有信','被女性攻击时，免疫双击、免疫暴击伤害。 ',2}
	CC.PTFSM[9769] ={'灵犀真拳','觉醒后可使用拳系标主大招 ',2}--主角拳系大招
	CC.PTFSM[9768] ={'点墨山河','觉醒后可使用指系标主大招 ',2}--主角指法大招
	CC.PTFSM[9767] ={'剑神一笑','觉醒后可使用剑系标主大招 ',2}--主角剑神大招
	CC.PTFSM[9766] ={'傲世狂刀','觉醒后可使用刀系标主大招 ',2}--主角刀系大招
	CC.PTFSM[9765] ={'棍藏天机','觉醒后可使用特系标主大招 ',2}--主角特系大招
	CC.PTFSM[9764] ={'绝世天罡','觉醒后可使用天罡标主大招 ',2}--主角天罡大招，内功可触发
	CC.PTFSM[9763] ={'回天圣手','觉醒后可触发医生标主大招',2}--主角医生大招，直接再次行动
	CC.PTFSM[9762] ={'欲天摩罗','觉醒后可使用毒王标主大招',2}--主角毒王大招，自身中毒100可触发
	CC.PTFSM[9761] ={'苇名流奥义','剑圣苇名一心所创苇名流剑术终极奥义，使用火枪必定暴击。 ',1}
	CC.PTFSM[9760] ={'真武剑尊','柔云剑法必定暴击。 ',1}
	CC.PTFSM[9759] ={'混沌无界','不论自身内属，所有判定调和内才能触发的特效都能触发。',1}
	CC.PTFSM[9758] ={'纯阳无极','不论自身内属，所有判定阳内才能触发的特效都能触发。',1}
	CC.PTFSM[9757] ={'极阴无相','不论自身内属，所有判定阴内才能触发的特效都能触发。',1}
	CC.PTFSM[9756] ={'真名神照','战斗死亡满血复活一次，并且立即行动 ',2}
	CC.PTFSM[9755] ={'假名神照','战斗死亡70%血复活一次，随天书增强复活状态，并且立即行动 ',2}
	CC.PTFSM[9754] ={'燎原百击','使用杨家枪、中平枪、呼延枪或岳家枪法，有特殊枪法特效',3}
	CC.PTFSM[9753] ={'无情三绝斩','三分剑法必定三连，伤害变为三分之一 ',1}
	CC.PTFSM[9752] ={'五行六合','五行六合拳必定连击 ',1}
	CC.PTFSM[9751] ={'铁掌无情','铁掌必定连击 ',3}
	CC.PTFSM[9750] ={'旋风扫落叶','旋风落叶腿必定连击 ',1}
	CC.PTFSM[9749] ={'鬼哭神嚎','鬼头刀法威力翻倍 ',1}
	CC.PTFSM[9748] ={'百战百胜','百胜刀法威力提高300点 ',1}
	CC.PTFSM[9747] ={'顶叶纸虎','五虎刀法五虎棍法威力提高200点 ',1}
	CC.PTFSM[9746] ={'桃花岛主','无需修炼三种武功即可触发桃花绝技 ',2}
	--CC.PTFSM[9745] ={'阴差阳错','阴阳倒乱刃附带混乱效果 ',1}
	CC.PTFSM[9744] ={'混元霹雳','幻阴指威力1.5倍，受到攻击后30%几率用幻阴指反击 ',1}
	CC.PTFSM[9743] ={'初生牛犊','攻击范围增加，攻击附带基础异常、杀集气，强化基础伤害，增加暴击几率伤害，概率面功，概率恢复状态，增加集气速度。',3}
	CC.PTFSM[9742] ={'黄沙万里','黄沙万里鞭追加200点真实伤害 ',4}
	CC.PTFSM[9741] ={'龙的传人','龙爪手擒龙手追加100点真实伤害 ',4}
	CC.PTFSM[9740] ={'雪羽精髓','内力上限提升1000点，无视内属修炼武功，自运易水寒诀。',3}
	CC.PTFSM[9739] ={'不归三境','1书领悟第一境——不见归人:每次行动集气速度+2,上限天书数+6*5书领悟第二境——不识归途:暴怒连击必三连击,连击伤害不减*9书领悟第三境——不知归处：攻击暴击时,无视敌方防御50% ',1}
	CC.PTFSM[9738] ={'一通万法','战场中攻击力高于敌方时，攻击时特效伤害成长35％；防御力高于敌方时，被攻击时特效伤害衰减35％。',2}
	CC.PTFSM[9737] ={'阳春三月','每时序回生命5内力10 ',1}
	CC.PTFSM[9736] ={'马踏飞燕','被攻击时30%几率无效,集气+5',2}
	CC.PTFSM[9735] ={'悟道乾坤','回合开始清除负面影响,特效几率提高10%',1}
	-- CC.PTFSM[9734] ={'热心市民','误伤队友会对其造成回血，医毒解上限400点',1}
	-- CC.PTFSM[9733] ={'快乐肥宅','被攻击不会产生怒气，杀气值转化为50%的集气值 ',2}
	-- CC.PTFSM[9732] ={'奇异经脉','学习秘籍时三围、五系获得点数翻倍 ',2}
	-- CC.PTFSM[9731] ={'密不透风','被攻击时兵器值按五系之和的一半计算 ',2}
	-- CC.PTFSM[9730] ={'怒火重生','第一次死亡后满血复活并立刻行动，伤害提高30%，暴怒必三连，时序怒气加2 ',2}
	CC.PTFSM[9729] ={'先天神罡','主运先天功即视为满足先天组合条件',3}
	CC.PTFSM[9728] ={'降龙罗汉','主运擒龙功即视为满足擒龙组合条件，行动后恢复700点内力，3点体力',3}
	CC.PTFSM[9727] ={'龙象尊者','主运龙象般若功功即视为满足龙象组合条件，行动后回气350点',3}
	CC.PTFSM[9726] ={'怒海狂涛','主运怒涛海潮功即视为满足怒涛组合条件，集气额外增加10点',3}
	CC.PTFSM[9725] ={'顾道长生','主运长生诀即视为满足长生组合条件，内力上限增加2000点',3}
	CC.PTFSM[9724] ={'玄门正宗','主运玄武真功即视为满足玄武组合条件',3}
	CC.PTFSM[9723] ={'万般皆通','无条件学习除葵花一脉所有武学',3}
	CC.PTFSM[9722] ={'波澜壮阔','内力上限10000点',3}
	
	CC.Tiangtf = {}
	for k,v in ipairs(CC.PTFSM) do
		local n = CC.PTFSM[k][3]
		if n == 1 then
			CC.Tiangtf[#CC.Tiangtf+1] = k
		end
	end
	
	--CC.Tiangtf1 = {9849,9848,9896,9926,9895,9915,9824,9825,9867,9819,9835,9834,9791,9837,9810,9760,9759,9758,9757,9761,9748,9747,9753,9742,9743,9741,9749}	
	CC.Tiangtf1 = {9741,9742,9743,9744,9746,9747,9748,9749,9750,9751,9752}
	CC.Yingcang = {}
	for k,v in ipairs(CC.PTFSM) do
		local n = CC.PTFSM[i][3]
		if n < 3 then
			CC.Yingcang[#CC.Yingcang+1] = i
		end
	end
	
	
	--106
	-- CC.PTFSM[9901] ={'四大恶人','暴击攻击加成提升至200%'} 
	-- CC.PTFSM[9900] ={'鸡你太美','攻击时获得魔性音效，全体敌人混乱5时序。'} 
	--护盾
 	CC.HD = {}
    --CC.HD[1] = {name = '坐忘无我',tt = 2032,tt1 = 2042,sm = '周身释放一个吸收（武功等级+基础内功）*0.8点伤害的真气防护罩，防护罩消失前，所受初始伤害降低伤害３０％'}
 	CC.HD[1] = {name = '坐忘无我',tt = 2032,tt1 = 2042,dx = 0,dy = 0,sm = '周身释放一个吸收（武功等级+基础内功）*0.8点伤害的真气防护罩，防护罩消失前，所受初始伤害降低伤害３０％'}
	CC.HD[2] = {name = '金刚护盾',tt = 2411,tt1 = 2422,dx = 0,dy = 0,sm = '受到的连击暴击伤害减少70%'}
	--CC.HD[2] = {name = '菩提金身',tt = 3836,tt1 = 3845,sm = '受到的连击暴击伤害减少70%'}
 	CC.HD[3] =  {name = '先天护盾',tt = 5689,tt1 = 5698,dx = 0,dy = 0,sm = '以护盾抵消伤害'}
 	CC.HD[4] =  {name = '破剑八刀',tt = 1974,tt1 = 1986,dx = 0,dy = 0,sm = '反弹50%伤害'}
	CC.HD[5] =  {name = '吸星真气',tt = 5844,tt1 = 5858,dx = 0,dy = 0,sm = '以护盾抵消伤害'}
	CC.HD[6] =  {name = '九阳护盾',tt = 2697,tt1 = 2715,dx = 0,dy = 0,sm = '以护盾抵消伤害'}--红色火焰圆球
	CC.HD[7] =  {name = '葵花护盾',tt = 5643,tt1 = 5652,dx = 0,dy = 0,sm = '时序触发攻击'} --红色气场环绕
	CC.HD[8] =  {name = '怒涛剑气',tt = 5725,tt1 = 5736,dx = 0,dy = 0,sm = '免受死亡伤害'}--万剑
	CC.HD[9] =  {name = '长生真气',tt = 5699,tt1 = 5708,dx = 0,dy = 0,sm = '低于半血触发'}--
	CC.HD[10] =  {name = '奇门五转',tt = 2452,tt1 = 2468,dx = 0,dy = 0,sm = '受到伤害触发'}--紫火绕体
	CC.HD[11] =  {name = '无形气墙',tt = 2878,tt1 = 2889,dx = 0,dy = 0,sm = '低于半血触发'}--金光绕体
	CC.HD[12] =  {name = '怒涛剑气',tt = 2760,tt1 = 2778,dx = 0,dy = 0,sm = '低于半血触发'}--闪电蓝色人形
	CC.HD[13] =  {name = '天魔金身',tt = 5665,tt1 = 5675,dx = 0,dy = 0,sm = '免受死亡伤害'}--紫色须佐（天魔）
	CC.HD[14] =  {name = '格档',tt = 3002,tt1 = 3011,dx = 0,dy = 0,sm = '部分伤害'}--格档特效
	CC.HD[15] =  {name = '蓝色脚底漩涡',tt = 2779,tt1 = 2786,dx = 0,dy = 0,sm = '以护盾抵消伤害'}--
	CC.HD[16] =  {name = '咒文卍字',tt = 2829,tt1 = 2838,dx = 0,dy = 0,sm = '以护盾抵消伤害'}--
	CC.HD[17] =  {name = '御气纵横',tt = 5599,tt1 = 5632,dx = 0,dy = 0,sm = '以护盾抵消伤害'}--
	CC.HD[18] =  {name = '阴阳二气',tt = 5317,tt1 = 5339,dx = 0,dy = 0,sm = '强制减少被伤害'}--黑白太极图
	CC.HD[19] =  {name = '菩提金身',tt = 5547,tt1 = 5556,dx = 0,dy = 0,sm = '受到的连击暴击伤害减少70%'}
	CC.HD[20] =  {name = '先天八卦',tt = 2546,tt1 = 2569,dx = 0,dy = 0,sm = '强制减少被伤害'}
	CC.HD[21] =  {name = '神足护盾',tt = 2032,tt1 = 2042,dx = 0,dy = 0,sm = '周身释放一个吸收（武功等级+基础内功）*0.8点伤害的真气防护罩，防护罩消失前，所受初始伤害降低伤害３０％'}
	CC.HD[22] =  {name = '先天太极',tt = 5466,tt1 = 5489,dx = 0,dy = 0,sm = '效果同不动如山'}--太极图
	CC.HD[23] =  {name = '万毒炼体',tt = 3659,tt1 = 3678,dx = 0,dy = 0,sm = '以护盾抵消伤害'}
	CC.HD[24] =  {name = '残日狱衣',tt = 2697,tt1 = 2715,dx = 0,dy = 0,sm = '以护盾抵消伤害'}--红色火焰圆球
	CC.HD[25] =  {name = '蓝色太极',tt = 5776,tt1 = 5787,dx = 0,dy = 0,sm = '以护盾抵消伤害'}--老张太极图
	CC.HD[26] =  {name = '倾国倾城',tt = 4105,tt1 = 4119,dx = 0,dy = 0,sm = '效果同不动如山'}--紫色花图
	CC.HD[27] =  {name = '七星汇聚',tt = 6024,tt1 = 6053,dx = -4,dy = -3,sm = '效果同不动如山'}--紫色花图
	CC.HD[28] =  {name = '九阴九阳',tt = 6008,tt1 = 6023,dx = 2,dy = 2,sm = '效果同不动如山'}--紫色花图
	CC.HD[29] =  {name = '越女剑仙',tt = 6078,tt1 = 6112,dx = 0,dy = 0,sm = '效果同不动如山'}--紫色花图
	CC.HD[30] =  {name = '六如真龙',tt = 6146,tt1 = 6161,dx = 0,dy = 0,sm = '效果同不动如山'}--紫色花图
	CC.HD[31] =  {name = '神足乾坤',tt = 4737,tt1 = 4747,dx = 0,dy = 0,sm = '效果固定伤害加上状态恢复'}--紫色光圈
	CC.HD[32] =  {name = '乾坤双龙',tt = 5434,tt1 = 5449,dx = 0,dy = 0,sm = '效果同不动如山'}--红蓝双龙
	CC.HD[33] =  {name = '易水寒冰',tt = 2130,tt1 = 2154,dx = 0,dy = 0,sm = '效果同不动如山'}--蓝色波浪
	CC.HD[34] =  {name = '独孤护盾',tt = 1244,tt1 = 1256,dx = 0,dy = 0,sm = '效果同不动如山'}--人形
	CC.HD[35] =  {name = '神照护盾',tt = 2626,tt1 = 2640,dx = 0,dy = 0,sm = '效果同不动如山'}--火焰

	--26种特效 一行5个
	Xguo={"攻击概率附加2-5冻结效果","攻击概率附加3-5点燃效果","攻击概率附加2-5点剧毒效果","攻击小概率附加晕眩效果","攻击概率附加5-10点撕裂效果",
	"攻击概率附加虚弱效果","攻击后小概率再次行动","攻击概率增加集气速度","攻击概率附加同归状态","攻击概率附加麻痹效果",
	"被攻击概率反击敌人","攻击概率附加格挡效果","攻击概率附加5-10散功效果","攻击概率停止敌人回血","攻击概率附加3-5集气紊乱",
	"攻击概率附加恐惧效果","攻击概率停止敌人解穴","攻击概率附加3-5迟缓效果","攻击吸血10%","攻击70%概率无视闪避",
	"行动后回复5点体力,回复30%损失内力","每回合开始前休息一次","攻击范围增加2格","攻击杀300内力3体力","攻击概率附加30%破防效果",
	"30%概率反弹不良状态",
	}
	--15种特效
	FJXguo={"封穴减少10点","中毒减少10点","内伤减少10点","冰封减少10点","灼烧减少10点",
	"流血减少10点","免疫内伤","50%概率降低50%受到伤害气攻","30%概率免疫反击","15%概率闪避",
	"免疫流血","免疫中毒","免疫封穴","免疫冰封","免疫灼烧",
	}
	--7种特效
	ZqXguo={"集气速度+6,免疫混乱","集气速度+8,移动距离+2","集气速度+4,15%概率挪移","集气速度+10%",
	"集气速度+4,免疫昏迷","集气速度+6,8%概率无敌","集气速度+6,免疫锁足",
	}
	
	
	
	Setmeal = {}
	--套装
	--	装备id	武器ID,防具ID,坐骑ID,特效ID,基础效果ID,坐骑效果ID,天赋ID
	local wq = math.random(26)
	local fj = math.random(15)
	local zj = math.random(7)
	Setmeal[551-3]={551-3,552-3,553-3,26,13,7,9942} --阿青套装◆青竹棒
	Setmeal[552-3]={551-3,552-3,553-3,2,4,2,9942} --阿青套装◆浅绿青衫
	Setmeal[553-3]={551-3,552-3,553-3,10,12,6,9942} --阿青套装◆羊
	Setmeal[554-3]={554-3,555-3,556-3,26,12,2,9998} --白虎套装◆飞天玉虎爪
	Setmeal[555-3]={554-3,555-3,556-3,15,5,5,9998} --白虎套装◆驺虞皮裘
	Setmeal[556-3]={554-3,555-3,556-3,21,2,3,9998} --白虎套装◆驺虞
	Setmeal[557-3]={557-3,558-3,559-3,24,2,6,9966} --白驼套装◆幻蝶扇
	Setmeal[558-3]={557-3,558-3,559-3,7,8,7,9966} --白驼套装◆绣金白袍
	Setmeal[559-3]={557-3,558-3,559-3,19,3,4,9966} --白驼套装◆骆驼
	Setmeal[560-3]={560-3,561-3,562-3,15,9,6,9994} --北侠套装◆沥泉盘龙枪
	Setmeal[561-3]={560-3,561-3,562-3,8,12,4,9994} --北侠套装◆龙神天铠
	Setmeal[562-3]={560-3,561-3,562-3,18,7,3,9994} --北侠套装◆黑雕
	Setmeal[563-3]={563-3,564-3,565-3,25,4,5,9993} --碧波套装◆九弦琴
	Setmeal[564-3]={563-3,564-3,565-3,2,2,1,9993} --碧波套装◆缀玉华裳
	Setmeal[565-3]={563-3,564-3,565-3,12,7,6,9993} --碧波套装◆猫
	Setmeal[566-3]={566-3,567-3,568-3,2,2,5,9978} --冰霜套装◆金铃索带
	Setmeal[567-3]={566-3,567-3,568-3,23,7,3,9978} --冰霜套装◆雪羽披风
	Setmeal[568-3]={566-3,567-3,568-3,14,12,1,9978} --冰霜套装◆九尾灵狐
	Setmeal[569-3]={569-3,570-3,571-3,16,5,5,9963} --波斯套装◆乌兹钢刃
	Setmeal[570-3]={569-3,570-3,571-3,20,8,1,9963} --波斯套装◆鳄神皮甲
	Setmeal[571-3]={569-3,570-3,571-3,13,3,2,9963} --波斯套装◆鲨鱼
	Setmeal[572-3]={572-3,573-3,574-3,18,7,3,9929} --超风套装◆毒龙银鞭
	Setmeal[573-3]={572-3,573-3,574-3,22,8,3,9929} --超风套装◆素绸朱绫
	Setmeal[574-3]={572-3,573-3,574-3,17,6,7,9929} --超风套装◆蛇蟋
	Setmeal[575-3]={575-3,576-3,577-3,16,11,6,9882} --成昆套装◆乾坤一气袋
	Setmeal[576-3]={575-3,576-3,577-3,7,8,7,9882} --成昆套装◆化蕴神铠
	Setmeal[577-3]={575-3,576-3,577-3,10,2,6,9882} --成昆套装◆漆黑星
	Setmeal[578-3]={578-3,579-3,580-3,19,8,2,9961} --承志套装◆金蛇剑
	Setmeal[579-3]={578-3,579-3,580-3,8,13,1,9961} --承志套装◆金丝背心
	Setmeal[580-3]={578-3,579-3,580-3,7,9,3,9961} --承志套装◆猩猩
	Setmeal[581-3]={581-3,582-3,583-3,25,6,3,9989} --翠山套装◆银钩铁划
	Setmeal[582-3]={581-3,582-3,583-3,12,9,1,9989} --翠山套装◆火浣银纱
	Setmeal[583-3]={581-3,582-3,583-3,1,8,7,9989} --翠山套装◆白熊
	Setmeal[584-3]={584-3,585-3,586-3,11,11,7,9962} --翠羽套装◆楼兰古剑
	Setmeal[585-3]={584-3,585-3,586-3,20,3,1,9962} --翠羽套装◆玉女云袖
	Setmeal[586-3]={584-3,585-3,586-3,15,3,7,9962} --翠羽套装◆兀鹰
	Setmeal[587-3]={587-3,588-3,589-3,4,10,2,9983} --达摩套装◆九仪天尊
	Setmeal[588-3]={587-3,588-3,589-3,6,2,6,9983} --达摩套装◆辟法玄胄
	Setmeal[589-3]={587-3,588-3,589-3,12,2,3,9983} --达摩套装◆狻倪
	Setmeal[590-3]={590-3,591-3,592-3,5,3,6,9948} --刀王套装◆井中水月
	Setmeal[591-3]={590-3,591-3,592-3,3,6,4,9948} --刀王套装◆黄缠明锦
	Setmeal[592-3]={590-3,591-3,592-3,6,4,5,9948} --刀王套装◆照夜白
	Setmeal[593-3]={593-3,594-3,595-3,19,7,7,9756} --狄云套装◆血刀
	Setmeal[594-3]={593-3,594-3,595-3,5,7,7,9756} --狄云套装◆乌蚕宝衣
	Setmeal[595-3]={593-3,594-3,595-3,23,9,5,9756} --狄云套装◆黄牛
	Setmeal[596-3]={596-3,597-3,598-3,15,9,3,9971} --东方套装◆簪花绣针
	Setmeal[597-3]={596-3,597-3,598-3,2,13,2,9971} --东方套装◆山河绣袍
	Setmeal[598-3]={596-3,597-3,598-3,13,15,2,9971} --东方套装◆空速星痕
	Setmeal[599-3]={599-3,600-3,601-3,15,11,2,9860} --东邪套装◆玉箫
	Setmeal[600-3]={599-3,600-3,601-3,10,13,5,9860} --东邪套装◆软猬宝甲
	Setmeal[601-3]={599-3,600-3,601-3,10,15,6,9860} --东邪套装◆白驼怪蛇
	Setmeal[602-3]={602-3,603-3,604-3,24,3,2,9877} --毒妇套装◆柳叶银狐刀
	Setmeal[603-3]={602-3,603-3,604-3,4,7,6,9877} --毒妇套装◆玄罗轻袖
	Setmeal[604-3]={602-3,603-3,604-3,14,13,1,9877} --毒妇套装◆金银血蛇
	Setmeal[605-3]={605-3,606-3,607-3,18,3,2,9893} --段誉套装◆阴阳扇
	Setmeal[606-3]={605-3,606-3,607-3,22,12,2,9893} --段誉套装◆浅绿青衫
	Setmeal[607-3]={605-3,606-3,607-3,8,1,2,9893} --段誉套装◆莽牯朱蛤
	Setmeal[608-3]={608-3,609-3,610-3,3,3,4,9815} --鳄神套装◆鳄嘴剪
	Setmeal[609-3]={608-3,609-3,610-3,22,5,1,9815} --鳄神套装◆鳄神皮甲
	Setmeal[610-3]={608-3,609-3,610-3,11,13,7,9815} --鳄神套装◆鳄鱼
	Setmeal[611-3]={611-3,612-3,613-3,1,9,7,9794} --飞狐套装◆闯王军刀
	Setmeal[612-3]={611-3,612-3,613-3,6,10,3,9794} --飞狐套装◆紫云战衣
	Setmeal[613-3]={611-3,612-3,613-3,10,10,1,9794} --飞狐套装◆九尾灵狐
	Setmeal[614-3]={614-3,615-3,616-3,19,8,3,9977} --凤凰套装◆凤屏孔雀翎
	Setmeal[615-3]={614-3,615-3,616-3,3,6,3,9977} --凤凰套装◆九龙云胄
	Setmeal[616-3]={614-3,615-3,616-3,23,4,7,9977} --凤凰套装◆狴犴
	Setmeal[617-3]={617-3,618-3,619-3,26,15,2,9851} --芙华套装◆金丝芙蓉镯
	Setmeal[618-3]={617-3,618-3,619-3,8,3,1,9851} --芙华套装◆浮光锦裘
	Setmeal[619-3]={617-3,618-3,619-3,7,15,4,9851} --芙华套装◆蛇蟋
	Setmeal[620-3]={620-3,621-3,622-3,19,13,2,9866} --蝠王套装◆烂银鹤爪
	Setmeal[621-3]={620-3,621-3,622-3,15,4,5,9866} --蝠王套装◆雪羽披风
	Setmeal[622-3]={620-3,621-3,622-3,13,11,6,9866} --蝠王套装◆黑玫瑰
	Setmeal[623-3]={623-3,624-3,625-3,4,12,7,9841} --丐王套装◆打狗棒
	Setmeal[624-3]={623-3,624-3,625-3,7,10,6,9841} --丐王套装◆百结鹑衣
	Setmeal[625-3]={623-3,624-3,625-3,11,5,1,9841} --丐王套装◆漆黑星
	Setmeal[626-3]={626-3,627-3,628-3,15,1,2,9784} --公孙套装◆金刀黑剑
	Setmeal[627-3]={626-3,627-3,628-3,17,8,6,9784} --公孙套装◆幽旛魂锦
	Setmeal[628-3]={626-3,627-3,628-3,12,3,4,9784} --公孙套装◆彩雪蛛
	Setmeal[629-3]={629-3,630-3,631-3,17,13,7,9786} --郭襄套装◆倚天剑
	Setmeal[630-3]={629-3,630-3,631-3,20,7,6,9786} --郭襄套装◆天都雾月
	Setmeal[631-3]={629-3,630-3,631-3,8,4,1,9786} --郭襄套装◆金钱豹
	Setmeal[632-3]={632-3,633-3,634-3,24,1,5,9790} --红药套装◆绿波香露刀
	Setmeal[633-3]={632-3,633-3,634-3,22,4,1,9790} --红药套装◆九黎轻装
	Setmeal[634-3]={632-3,633-3,634-3,5,9,3,9790} --红药套装◆羊
	Setmeal[635-3]={635-3,636-3,637-3,5,7,3,9792} --胡斐套装◆冷月宝刀
	Setmeal[636-3]={635-3,636-3,637-3,1,12,7,9792} --胡斐套装◆紫云战衣
	Setmeal[637-3]={635-3,636-3,637-3,13,4,4,9792} --胡斐套装◆黑熊
	Setmeal[638-3]={638-3,639-3,640-3,4,15,6,9795} --胡商套装◆金龙鞭
	Setmeal[639-3]={638-3,639-3,640-3,6,2,5,9795} --胡商套装◆金丝缎袍
	Setmeal[640-3]={638-3,639-3,640-3,9,9,5,9795} --胡商套装◆碧云霞
	Setmeal[641-3]={641-3,642-3,643-3,4,6,1,9870} --黄蓉套装◆打狗棒
	Setmeal[642-3]={641-3,642-3,643-3,4,12,7,9870} --黄蓉套装◆软猬宝甲
	Setmeal[643-3]={641-3,642-3,643-3,6,6,6,9870} --黄蓉套装◆白雕
	Setmeal[644-3]={644-3,645-3,646-3,26,8,3,9869} --黄衫套装◆卜天钻
	Setmeal[645-3]={644-3,645-3,646-3,21,10,2,9869} --黄衫套装◆黄缠明锦
	Setmeal[646-3]={644-3,645-3,646-3,11,6,6,9869} --黄衫套装◆黄骝自在
	Setmeal[647-3]={647-3,648-3,649-3,2,14,4,9878} --火手套装◆凝碧剑
	Setmeal[648-3]={647-3,648-3,649-3,5,15,3,9878} --火手套装◆素绸朱绫
	Setmeal[649-3]={647-3,648-3,649-3,20,1,4,9878} --火手套装◆豺狼
	Setmeal[650-3]={650-3,651-3,652-3,24,6,6,9883} --霍山套装◆圣火令
	Setmeal[651-3]={650-3,651-3,652-3,4,7,5,9883} --霍山套装◆幽旛魂锦
	Setmeal[652-3]={650-3,651-3,652-3,4,6,6,9883} --霍山套装◆菩斯曲蛇
	Setmeal[653-3]={653-3,654-3,655-3,16,13,3,9767} --剑魔套装◆木剑
	Setmeal[654-3]={653-3,654-3,655-3,10,10,4,9767} --剑魔套装◆山河绣袍
	Setmeal[655-3]={653-3,654-3,655-3,3,12,1,9767} --剑魔套装◆神雕
	Setmeal[656-3]={656-3,657-3,658-3,16,13,3,9996} --剑神套装◆九韶定音剑
	Setmeal[657-3]={656-3,657-3,658-3,9,1,4,9996} --剑神套装◆玄乌羽衣
	Setmeal[658-3]={656-3,657-3,658-3,1,1,7,9996} --剑神套装◆天尊令
	Setmeal[659-3]={659-3,660-3,661-3,4,13,3,9934} --剑圣套装◆木剑
	Setmeal[660-3]={659-3,660-3,661-3,5,15,4,9934} --剑圣套装◆飙风猿铠
	Setmeal[661-3]={659-3,660-3,661-3,9,3,7,9934} --剑圣套装◆猩猩
	Setmeal[662-3]={662-3,663-3,664-3,26,13,3,9806} --剑仙套装◆青竹棒
	Setmeal[663-3]={662-3,663-3,664-3,23,14,4,9806} --剑仙套装◆瑶池仙袖
	Setmeal[664-3]={662-3,663-3,664-3,9,4,3,9806} --剑仙套装◆白猿
	Setmeal[665-3]={665-3,666-3,667-3,5,4,5,9791} --金刀套装◆虎头金刀
	Setmeal[666-3]={665-3,666-3,667-3,23,10,5,9791} --金刀套装◆肃霜宝裘
	Setmeal[667-3]={665-3,666-3,667-3,9,11,4,9791} --金刀套装◆黑雕
	Setmeal[668-3]={668-3,669-3,670-3,21,3,4,9822} --金环套装◆龙凤子母环
	Setmeal[669-3]={668-3,669-3,670-3,3,1,1,9822} --金环套装◆金丝缎袍
	Setmeal[670-3]={668-3,669-3,670-3,19,14,6,9822} --金环套装◆灵獒
	Setmeal[671-3]={671-3,672-3,673-3,15,2,7,9831} --金轮套装◆五行轮
	Setmeal[672-3]={671-3,672-3,673-3,20,7,5,9831} --金轮套装◆天蚕宝甲
	Setmeal[673-3]={671-3,672-3,673-3,18,12,2,9831} --金轮套装◆彩雪蛛
	Setmeal[674-3]={674-3,675-3,676-3,3,12,7,9827} --金蛇套装◆金蛇剑
	Setmeal[675-3]={674-3,675-3,676-3,14,6,3,9827} --金蛇套装◆凤凰织锦
	Setmeal[676-3]={674-3,675-3,676-3,21,5,3,9827} --金蛇套装◆金蛇
	Setmeal[677-3]={677-3,678-3,679-3,2,13,4,9821} --九真套装◆镔铁判官笔
	Setmeal[678-3]={677-3,678-3,679-3,5,14,4,9821} --九真套装◆银狐披肩
	Setmeal[679-3]={677-3,678-3,679-3,7,3,5,9821} --九真套装◆灵獒
	Setmeal[680-3]={680-3,681-3,682-3,17,6,5,9776} --君子套装◆君子剑
	Setmeal[681-3]={680-3,681-3,682-3,23,7,6,9776} --君子套装◆钧天珑袖
	Setmeal[682-3]={680-3,681-3,682-3,6,7,1,9776} --君子套装◆踏霜白
	Setmeal[683-3]={683-3,684-3,685-3,13,12,3,9775} --崆峒套装◆崆峒印
	Setmeal[684-3]={683-3,684-3,685-3,9,8,1,9775} --崆峒套装◆仙符法袍
	Setmeal[685-3]={683-3,684-3,685-3,9,6,1,9775} --崆峒套装◆血蛙
	Setmeal[686-3]={686-3,687-3,688-3,3,13,4,9807} --葵花套装◆割鹿刀
	Setmeal[687-3]={686-3,687-3,688-3,20,9,7,9807} --葵花套装◆雷绦纹帛
	Setmeal[688-3]={686-3,687-3,688-3,2,8,5,9807} --葵花套装◆血鸟
	Setmeal[689-3]={689-3,690-3,691-3,18,7,5,9834} --力士套装◆伏魔金杵
	Setmeal[690-3]={689-3,690-3,691-3,22,7,6,9834} --力士套装◆九黎轻装
	Setmeal[691-3]={689-3,690-3,691-3,8,8,6,9834} --力士套装◆黄牛
	Setmeal[692-3]={692-3,693-3,694-3,19,8,1,9829} --灵珊套装◆碧水剑
	Setmeal[693-3]={692-3,693-3,694-3,8,14,1,9829} --灵珊套装◆玉女云袖
	Setmeal[694-3]={692-3,693-3,694-3,3,11,2,9829} --灵珊套装◆照夜白
	Setmeal[695-3]={695-3,696-3,697-3,3,11,7,9927} --灵素套装◆银烟管
	Setmeal[696-3]={695-3,696-3,697-3,15,1,7,9927} --灵素套装◆凝玉纱索
	Setmeal[697-3]={695-3,696-3,697-3,5,12,4,9927} --灵素套装◆莽牯朱蛤
	Setmeal[698-3]={698-3,699-3,700-3,2,2,6,9842} --令狐套装◆紫薇软剑
	Setmeal[699-3]={698-3,699-3,700-3,19,3,6,9842} --令狐套装◆钧天珑袖
	Setmeal[700-3]={698-3,699-3,700-3,14,4,1,9842} --令狐套装◆乌云盖雪
	Setmeal[701-3]={701-3,702-3,703-3,20,9,7,9763} --龙女套装◆淑女剑
	Setmeal[702-3]={701-3,702-3,703-3,22,14,2,9763} --龙女套装◆胧影织衣
	Setmeal[703-3]={701-3,702-3,703-3,13,5,3,9763} --龙女套装◆玉蜂
	Setmeal[704-3]={704-3,705-3,706-3,11,9,5,9981} --龙燕套装◆北霸银鲨枪
	Setmeal[705-3]={704-3,705-3,706-3,13,9,3,9981} --龙燕套装◆冰壁玉甲
	Setmeal[706-3]={704-3,705-3,706-3,18,13,1,9981} --龙燕套装◆龙燕令
	Setmeal[707-3]={707-3,708-3,709-3,4,15,7,9923} --鹿杖套装◆鹿角杖
	Setmeal[708-3]={707-3,708-3,709-3,21,4,5,9923} --鹿杖套装◆蚀魄幽铠
	Setmeal[709-3]={707-3,708-3,709-3,12,9,2,9923} --鹿杖套装◆黄犬
	Setmeal[710-3]={710-3,711-3,712-3,18,9,5,9910} --骆冰套装◆鸳鸯宝刀
	Setmeal[711-3]={710-3,711-3,712-3,9,13,5,9910} --骆冰套装◆玄罗轻袖
	Setmeal[712-3]={710-3,711-3,712-3,13,8,3,9910} --骆冰套装◆银霜逐电
	Setmeal[713-3]={713-3,714-3,715-3,12,10,1,9909} --马王套装◆金龙鞭
	Setmeal[714-3]={713-3,714-3,715-3,11,6,3,9909} --马王套装◆肃霜宝裘
	Setmeal[715-3]={713-3,714-3,715-3,19,4,4,9909} --马王套装◆追风黄
	Setmeal[716-3]={716-3,717-3,718-3,15,13,3,9887} --蒙帝套装◆铁鸳鸯
	Setmeal[717-3]={716-3,717-3,718-3,21,12,4,9887} --蒙帝套装◆黑天魔铠
	Setmeal[718-3]={716-3,717-3,718-3,19,1,5,9887} --蒙帝套装◆九花虬
	Setmeal[719-3]={719-3,720-3,721-3,14,9,2,9889} --迷城套装◆辉耀金斧
	Setmeal[720-3]={719-3,720-3,721-3,2,9,6,9889} --迷城套装◆驼纹金胄
	Setmeal[721-3]={719-3,720-3,721-3,6,8,6,9889} --迷城套装◆骆驼
	Setmeal[722-3]={722-3,723-3,724-3,20,14,5,9886} --闵柔套装◆黑白双剑
	Setmeal[723-3]={722-3,723-3,724-3,1,13,4,9886} --闵柔套装◆胧影织衣
	Setmeal[724-3]={722-3,723-3,724-3,13,2,6,9886} --闵柔套装◆墨蹄玉兔
	Setmeal[725-3]={725-3,726-3,727-3,17,10,6,9873} --明王套装◆东皇钟
	Setmeal[726-3]={725-3,726-3,727-3,6,15,1,9873} --明王套装◆计都荒寰
	Setmeal[727-3]={725-3,726-3,727-3,12,15,6,9873} --明王套装◆战象
	Setmeal[728-3]={728-3,729-3,730-3,3,11,6,9992} --明尊套装◆圣火令
	Setmeal[729-3]={728-3,729-3,730-3,17,5,4,9992} --明尊套装◆幽日煌袍
	Setmeal[730-3]={728-3,729-3,730-3,15,9,7,9992} --明尊套装◆金银血蛇
	Setmeal[731-3]={731-3,732-3,733-3,12,13,7,9766} --魔刀套装◆圆月弯刀
	Setmeal[732-3]={731-3,732-3,733-3,15,15,7,9766} --魔刀套装◆黄泉祭衣
	Setmeal[733-3]={731-3,732-3,733-3,15,12,7,9766} --魔刀套装◆狻倪
	Setmeal[734-3]={734-3,735-3,736-3,16,3,3,9964} --魔神套装◆苍狼天刃
	Setmeal[735-3]={734-3,735-3,736-3,3,14,5,9964} --魔神套装◆黑天魔铠
	Setmeal[736-3]={734-3,735-3,736-3,16,9,7,9964} --魔神套装◆飞云骓
	Setmeal[737-3]={737-3,738-3,739-3,3,13,1,9826} --莫愁套装◆银丝拂尘
	Setmeal[738-3]={737-3,738-3,739-3,13,13,7,9826} --莫愁套装◆雾幻云袍
	Setmeal[739-3]={737-3,738-3,739-3,11,1,2,9826} --莫愁套装◆金钱豹
	Setmeal[740-3]={740-3,741-3,742-3,8,6,4,9798} --木桑套装◆玄铁棋盘
	Setmeal[741-3]={740-3,741-3,742-3,23,12,1,9798} --木桑套装◆金丝背心
	Setmeal[742-3]={740-3,741-3,742-3,9,7,4,9798} --木桑套装◆黄骢骠
	Setmeal[743-3]={743-3,744-3,745-3,7,9,4,9778} --慕容套装◆琥珀神环
	Setmeal[744-3]={743-3,744-3,745-3,2,14,5,9778} --慕容套装◆紫灵天珠
	Setmeal[745-3]={743-3,744-3,745-3,15,5,6,9778} --慕容套装◆御风乘黄
	Setmeal[746-3]={746-3,747-3,748-3,9,15,6,9799} --女娲套装◆天蛇杖
	Setmeal[747-3]={746-3,747-3,748-3,10,9,1,9799} --女娲套装◆圣灵披风
	Setmeal[748-3]={746-3,747-3,748-3,20,1,2,9799} --女娲套装◆圣灵珠
	Setmeal[749-3]={749-3,750-3,751-3,17,10,5,9821} --平之套装◆偷天剑
	Setmeal[750-3]={749-3,750-3,751-3,2,6,4,9821} --平之套装◆雷绦纹帛
	Setmeal[751-3]={749-3,750-3,751-3,17,8,1,9821} --平之套装◆小雪龙
	Setmeal[752-3]={752-3,753-3,754-3,12,11,3,9823} --破天套装◆玄铁令
	Setmeal[753-3]={752-3,753-3,754-3,21,2,7,9823} --破天套装◆乌蚕宝衣
	Setmeal[754-3]={752-3,753-3,754-3,3,15,4,9823} --破天套装◆黄犬
	Setmeal[755-3]={755-3,756-3,757-3,3,11,6,9808} --千尺套装◆冥煌刺
	Setmeal[756-3]={755-3,756-3,757-3,2,12,6,9808} --千尺套装◆百结鹑衣
	Setmeal[757-3]={755-3,756-3,757-3,4,8,2,9808} --千尺套装◆鳄鱼
	Setmeal[758-3]={758-3,759-3,760-3,12,2,1,9804} --青龙套装◆北霸银鲨枪
	Setmeal[759-3]={758-3,759-3,760-3,5,14,5,9804} --青龙套装◆紫金玄铠
	Setmeal[760-3]={758-3,759-3,760-3,13,5,6,9804} --青龙套装◆五彩神龙
	Setmeal[761-3]={761-3,762-3,763-3,1,8,6,9801} --清帝套装◆血滴子
	Setmeal[762-3]={761-3,762-3,763-3,8,1,6,9801} --清帝套装◆九龙云胄
	Setmeal[763-3]={761-3,762-3,763-3,19,10,5,9801} --清帝套装◆玉花骢
	Setmeal[764-3]={764-3,765-3,766-3,22,12,4,9798} --若兰套装◆白玉瑶琴
	Setmeal[765-3]={764-3,765-3,766-3,16,15,1,9798} --若兰套装◆银狐披肩
	Setmeal[766-3]={764-3,765-3,766-3,1,9,2,9798} --若兰套装◆猫
	Setmeal[767-3]={767-3,768-3,769-3,14,8,5,9906} --三渡套装◆黑狼鬼索
	Setmeal[768-3]={767-3,768-3,769-3,5,12,1,9906} --三渡套装◆辟法玄胄
	Setmeal[769-3]={767-3,768-3,769-3,17,13,7,9906} --三渡套装◆战象
	Setmeal[770-3]={770-3,771-3,772-3,16,13,3,9987} --三丰套装◆真武剑
	Setmeal[771-3]={770-3,771-3,772-3,5,13,6,9987} --三丰套装◆神隐披风
	Setmeal[772-3]={770-3,771-3,772-3,16,11,4,9987} --三丰套装◆灵龟
	Setmeal[773-3]={773-3,774-3,775-3,20,10,4,9984} --三圣套装◆焦尾琴
	Setmeal[774-3]={773-3,774-3,775-3,16,6,3,9984} --三圣套装◆银华月缎
	Setmeal[775-3]={773-3,774-3,775-3,18,3,3,9984} --三圣套装◆仙鹤
	Setmeal[776-3]={776-3,777-3,778-3,8,13,4,9928} --僧人套装◆蟠龙金棍
	Setmeal[777-3]={776-3,777-3,778-3,2,9,6,9928} --僧人套装◆锦斓袈裟
	Setmeal[778-3]={776-3,777-3,778-3,2,2,5,9928} --僧人套装◆小雪龙
	Setmeal[779-3]={779-3,780-3,781-3,4,12,2,9865} --射雕套装◆满月雕弓
	Setmeal[780-3]={779-3,780-3,781-3,3,14,7,9865} --射雕套装◆驼纹金胄
	Setmeal[781-3]={779-3,780-3,781-3,6,12,3,9865} --射雕套装◆九花虬
	Setmeal[782-3]={782-3,783-3,784-3,18,1,6,9941} --神雕套装◆玄铁剑
	Setmeal[783-3]={782-3,783-3,784-3,23,6,2,9941} --神雕套装◆玄乌羽衣
	Setmeal[784-3]={782-3,783-3,784-3,2,4,2,9941} --神雕套装◆菩斯曲蛇
	Setmeal[785-3]={785-3,786-3,787-3,16,8,6,9932} --狮王套装◆龙牙击
	Setmeal[786-3]={785-3,786-3,787-3,22,15,5,9932} --狮王套装◆驺虞皮裘
	Setmeal[787-3]={785-3,786-3,787-3,10,15,2,9932} --狮王套装◆白熊
	Setmeal[788-3]={788-3,789-3,790-3,3,4,1,9926} --嵩阳套装◆嵩阳铁剑
	Setmeal[789-3]={788-3,789-3,790-3,22,1,6,9926} --嵩阳套装◆紫练华衣
	Setmeal[790-3]={788-3,789-3,790-3,6,4,6,9926} --嵩阳套装◆黑木令
	Setmeal[791-3]={791-3,792-3,793-3,21,1,4,9909} --苏荃套装◆玄铁匕首
	Setmeal[792-3]={791-3,792-3,793-3,12,9,4,9909} --苏荃套装◆轻绸舞袖
	Setmeal[793-3]={791-3,792-3,793-3,13,8,2,9909} --苏荃套装◆五彩神龙
	Setmeal[794-3]={794-3,795-3,796-3,20,12,2,9904} --太白套装◆昆仑镜
	Setmeal[795-3]={794-3,795-3,796-3,21,11,2,9904} --太白套装◆飙风猿铠
	Setmeal[796-3]={794-3,795-3,796-3,5,2,7,9904} --太白套装◆白猿
	Setmeal[797-3]={797-3,798-3,799-3,8,13,6,9968} --桃花套装◆峨嵋分水刺
	Setmeal[798-3]={797-3,798-3,799-3,8,15,3,9968} --桃花套装◆七色蝶裳
	Setmeal[799-3]={797-3,798-3,799-3,2,12,4,9968} --桃花套装◆汗血宝马
	Setmeal[800-3]={800-3,801-3,802-3,18,10,4,9949} --天池套装◆剑盾珠索
	Setmeal[801-3]={800-3,801-3,802-3,1,15,1,9949} --天池套装◆银华月缎
	Setmeal[802-3]={800-3,801-3,802-3,16,14,6,9949} --天池套装◆豺狼
	Setmeal[803-3]={803-3,804-3,805-3,13,13,1,9959} --天鹰套装◆白虹剑
	Setmeal[804-3]={803-3,804-3,805-3,21,15,6,9959} --天鹰套装◆火浣银纱
	Setmeal[805-3]={803-3,804-3,805-3,14,2,7,9959} --天鹰套装◆玉面火猴
	Setmeal[806-3]={806-3,807-3,808-3,19,6,4,9950} --铁丑套装◆精钢指套
	Setmeal[807-3]={806-3,807-3,808-3,7,2,5,9950} --铁丑套装◆荧煌明光
	Setmeal[808-3]={806-3,807-3,808-3,17,11,5,9950} --铁丑套装◆冰蚕
	Setmeal[809-3]={809-3,810-3,811-3,17,14,3,9905} --铁手套装◆金蜈钩
	Setmeal[810-3]={809-3,810-3,811-3,8,2,5,9905} --铁手套装◆紫薇仙衣
	Setmeal[811-3]={809-3,810-3,811-3,12,13,7,9905} --铁手套装◆金蛇
	Setmeal[812-3]={812-3,813-3,814-3,2,7,1,9835} --铁掌套装◆冥煌刺
	Setmeal[813-3]={812-3,813-3,814-3,8,12,7,9835} --铁掌套装◆紫金玄铠
	Setmeal[814-3]={812-3,813-3,814-3,19,1,6,9835} --铁掌套装◆追风黄
	Setmeal[815-3]={815-3,816-3,817-3,5,6,6,9854} --顽童套装◆毒针指环
	Setmeal[816-3]={815-3,816-3,817-3,5,6,6,9854} --顽童套装◆仙符法袍
	Setmeal[817-3]={815-3,816-3,817-3,5,9,2,9854} --顽童套装◆鲨鱼
	Setmeal[818-3]={818-3,819-3,820-3,23,13,3,9789} --婉清套装◆点钢峨嵋刺
	Setmeal[819-3]={818-3,819-3,820-3,16,6,3,9789} --婉清套装◆舞风霓裳
	Setmeal[820-3]={818-3,819-3,820-3,16,3,4,9789} --婉清套装◆黑玫瑰
	Setmeal[821-3]={821-3,822-3,823-3,1,2,3,9820} --文秀套装◆金银小剑
	Setmeal[822-3]={821-3,822-3,823-3,14,5,4,9820} --文秀套装◆羊皮长袍
	Setmeal[823-3]={821-3,822-3,823-3,11,6,6,9820} --文秀套装◆踏霜白
	Setmeal[824-3]={824-3,825-3,826-3,13,3,5,9818} --我行套装◆真武剑
	Setmeal[825-3]={824-3,825-3,826-3,11,7,2,9818} --我行套装◆绣金白袍
	Setmeal[826-3]={824-3,825-3,826-3,16,12,2,9818} --我行套装◆血鸟
	Setmeal[827-3]={827-3,828-3,829-3,10,1,6,9990} --无忌套装◆屠龙刀
	Setmeal[828-3]={827-3,828-3,829-3,16,8,4,9990} --无忌套装◆幽日煌袍
	Setmeal[829-3]={827-3,828-3,829-3,7,12,5,9990} --无忌套装◆血蛙
	Setmeal[830-3]={830-3,831-3,832-3,18,7,1,9930} --无名套装◆九仪天尊
	Setmeal[831-3]={830-3,831-3,832-3,2,5,5,9930} --无名套装◆神隐披风
	Setmeal[832-3]={830-3,831-3,832-3,3,15,2,9930} --无名套装◆驺虞
	Setmeal[833-3]={833-3,834-3,835-3,3,3,3,9884} --五毒套装◆蝎尾鞭
	Setmeal[834-3]={833-3,834-3,835-3,7,15,1,9884} --五毒套装◆凝玉纱索
	Setmeal[835-3]={833-3,834-3,835-3,1,5,1,9884} --五毒套装◆花斑毒蝎
	Setmeal[836-3]={836-3,837-3,838-3,19,9,2,9820} --武当套装◆白龙剑
	Setmeal[837-3]={836-3,837-3,838-3,20,2,5,9820} --武当套装◆玄武道装
	Setmeal[838-3]={836-3,837-3,838-3,2,4,5,9820} --武当套装◆青驴
	Setmeal[839-3]={839-3,840-3,841-3,3,4,3,9901} --西毒套装◆天蛇杖
	Setmeal[840-3]={839-3,840-3,841-3,12,15,6,9901} --西毒套装◆计都荒寰
	Setmeal[841-3]={839-3,840-3,841-3,17,9,3,9901} --西毒套装◆白驼怪蛇
	Setmeal[842-3]={842-3,843-3,844-3,5,13,6,9950} --西狂套装◆玄铁剑
	Setmeal[843-3]={842-3,843-3,844-3,13,8,3,9950} --西狂套装◆天瑞华绫
	Setmeal[844-3]={842-3,843-3,844-3,15,5,2,9950} --西狂套装◆神雕
	Setmeal[845-3]={845-3,846-3,847-3,16,1,1,9972} --惜花套装◆海月清辉
	Setmeal[846-3]={845-3,846-3,847-3,22,7,5,9972} --惜花套装◆缀玉华裳
	Setmeal[847-3]={845-3,846-3,847-3,5,14,6,9972} --惜花套装◆九霄环佩
	Setmeal[848-3]={848-3,849-3,850-3,3,12,4,9973} --香香套装◆玉剑
	Setmeal[849-3]={848-3,849-3,850-3,5,9,2,9973} --香香套装◆轻绸舞袖
	Setmeal[850-3]={848-3,849-3,850-3,2,10,1,9973} --香香套装◆碧云霞
	Setmeal[851-3]={851-3,852-3,853-3,4,1,6,9859} --襄儿套装◆黑玉碎星镯
	Setmeal[852-3]={851-3,852-3,853-3,5,11,1,9859} --襄儿套装◆浮光锦裘
	Setmeal[853-3]={851-3,852-3,853-3,3,15,1,9859} --襄儿套装◆青驴
	Setmeal[854-3]={854-3,855-3,856-3,22,9,7,9987} --逍遥套装◆伏羲琴
	Setmeal[855-3]={854-3,855-3,856-3,9,3,2,9987} --逍遥套装◆瑶池仙袖
	Setmeal[856-3]={854-3,855-3,856-3,14,8,2,9987} --逍遥套装◆云狐
	Setmeal[857-3]={857-3,858-3,859-3,10,9,4,9858} --萧峰套装◆锯齿钢盾
	Setmeal[858-3]={857-3,858-3,859-3,15,13,6,9858} --萧峰套装◆龙神天铠
	Setmeal[859-3]={857-3,858-3,859-3,5,7,6,9858} --萧峰套装◆狴犴
	Setmeal[860-3]={860-3,861-3,862-3,3,6,4,9908} --小宝套装◆罗刹火枪
	Setmeal[861-3]={860-3,861-3,862-3,19,14,5,9908} --小宝套装◆天蚕宝甲
	Setmeal[862-3]={860-3,861-3,862-3,11,3,5,9908} --小宝套装◆玉花骢
	Setmeal[863-3]={863-3,864-3,865-3,3,12,6,9902} --星宿套装◆柔丝索
	Setmeal[864-3]={863-3,864-3,865-3,16,5,3,9902} --星宿套装◆黄泉祭衣
	Setmeal[865-3]={863-3,864-3,865-3,17,10,4,9902} --星宿套装◆冰蚕
	Setmeal[866-3]={866-3,867-3,868-3,16,12,7,9892} --虚竹套装◆神农鼎
	Setmeal[867-3]={866-3,867-3,868-3,21,1,5,9892} --虚竹套装◆冥契法衣
	Setmeal[868-3]={866-3,867-3,868-3,14,2,3,9892} --虚竹套装◆白鹿
	Setmeal[869-3]={869-3,870-3,871-3,3,9,3,9986} --玄澄套装◆降魔禅杖
	Setmeal[870-3]={869-3,870-3,871-3,20,6,3,9986} --玄澄套装◆荧煌明光
	Setmeal[871-3]={869-3,870-3,871-3,22,2,3,9986} --玄澄套装◆犀牛
	Setmeal[872-3]={872-3,873-3,874-3,1,12,4,9800} --玄素套装◆黑白双剑
	Setmeal[873-3]={872-3,873-3,874-3,11,14,6,9800} --玄素套装◆黑缎笼衫
	Setmeal[874-3]={872-3,873-3,874-3,15,5,5,9800} --玄素套装◆乌云盖雪
	Setmeal[875-3]={875-3,876-3,877-3,2,8,3,9907} --玄武套装◆洞佩蝶恋花
	Setmeal[876-3]={875-3,876-3,877-3,17,1,1,9907} --玄武套装◆玄武道装
	Setmeal[877-3]={875-3,876-3,877-3,13,6,5,9907} --玄武套装◆灵龟
	Setmeal[878-3]={878-3,879-3,880-3,19,1,5,9855} --血刀套装◆血刀
	Setmeal[879-3]={878-3,879-3,880-3,14,2,6,9855} --血刀套装◆锦斓袈裟
	Setmeal[880-3]={878-3,879-3,880-3,20,5,7,9855} --血刀套装◆黄骢骠
	Setmeal[881-3]={881-3,882-3,883-3,18,7,1,9838} --延庆套装◆镔铁杖
	Setmeal[882-3]={881-3,882-3,883-3,1,5,7,9838} --延庆套装◆冰月皇衣
	Setmeal[883-3]={881-3,882-3,883-3,14,6,3,9838} --延庆套装◆醉人蜂
	Setmeal[884-3]={884-3,885-3,886-3,16,10,1,9833} --杨过套装◆君子剑
	Setmeal[885-3]={884-3,885-3,886-3,5,13,5,9833} --杨过套装◆黑缎笼衫
	Setmeal[886-3]={884-3,885-3,886-3,22,14,6,9833} --杨过套装◆黄骝自在
	Setmeal[887-3]={887-3,888-3,889-3,19,13,6,9738} --妖刀套装◆妖刀村正
	Setmeal[888-3]={887-3,888-3,889-3,13,8,5,9738} --妖刀套装◆化蕴神甲
	Setmeal[889-3]={887-3,888-3,889-3,2,5,2,9738} --妖刀套装◆黑木令
	Setmeal[890-3]={890-3,891-3,892-3,2,10,4,9853} --一灯套装◆铁浮屠
	Setmeal[891-3]={890-3,891-3,892-3,20,10,7,9853} --一灯套装◆冰月皇衣
	Setmeal[892-3]={890-3,891-3,892-3,21,14,1,9853} --一灯套装◆白雕
	Setmeal[893-3]={893-3,894-3,895-3,23,13,1,9855} --仪琳套装◆龙泉剑
	Setmeal[894-3]={893-3,894-3,895-3,8,11,3,9855} --仪琳套装◆白练单衣
	Setmeal[895-3]={893-3,894-3,895-3,6,1,4,9855} --仪琳套装◆兔子
	Setmeal[896-3]={896-3,897-3,898-3,6,12,6,9851} --盈盈套装◆燕语琴
	Setmeal[897-3]={896-3,897-3,898-3,12,15,5,9851} --盈盈套装◆七色蝶裳
	Setmeal[898-3]={896-3,897-3,898-3,23,7,4,9851} --盈盈套装◆墨蹄玉兔
	Setmeal[899-3]={899-3,900-3,901-3,22,11,4,9843} --语嫣套装◆海月清辉
	Setmeal[900-3]={899-3,900-3,901-3,6,5,6,9843} --语嫣套装◆珠璃莹甲
	Setmeal[901-3]={899-3,900-3,901-3,20,6,4,9843} --语嫣套装◆醉人蜂
	Setmeal[902-3]={902-3,903-3,904-3,20,10,1,9835} --玉璧套装◆逍遥神仙环
	Setmeal[903-3]={902-3,903-3,904-3,8,15,5,9835} --玉璧套装◆珠璃莹甲
	Setmeal[904-3]={902-3,903-3,904-3,19,4,7,9835} --玉璧套装◆仙鹤
	Setmeal[905-3]={905-3,906-3,907-3,4,9,7,9830} --玉女套装◆铂丝掌套
	Setmeal[906-3]={905-3,906-3,907-3,12,10,6,9830} --玉女套装◆天瑞华绫
	Setmeal[907-3]={905-3,906-3,907-3,9,4,7,9830} --玉女套装◆玉蜂
	Setmeal[908-3]={908-3,909-3,910-3,4,5,7,9852} --圆性套装◆蟒神蛇鞭
	Setmeal[909-3]={908-3,909-3,910-3,13,10,5,9852} --圆性套装◆紫练华衣
	Setmeal[910-3]={908-3,909-3,910-3,8,7,1,9852} --圆性套装◆银霜逐电
	Setmeal[911-3]={911-3,912-3,913-3,20,4,4,9944} --远山套装◆黑狼鬼索
	Setmeal[912-3]={911-3,912-3,913-3,3,3,3,9944} --远山套装◆羊皮长袍
	Setmeal[913-3]={911-3,912-3,913-3,7,3,4,9944} --远山套装◆黑熊
	Setmeal[914-3]={914-3,915-3,916-3,7,15,5,9845} --芸诗套装◆轩辕剑
	Setmeal[915-3]={914-3,915-3,916-3,19,9,5,9845} --芸诗套装◆圣灵披风
	Setmeal[916-3]={914-3,915-3,916-3,11,2,7,9845} --芸诗套装◆云狐
	Setmeal[917-3]={917-3,918-3,919-3,22,4,7,9801} --赵敏套装◆倚天剑
	Setmeal[918-3]={917-3,918-3,919-3,11,14,5,9801} --赵敏套装◆凤凰织锦
	Setmeal[919-3]={917-3,918-3,919-3,23,5,7,9801} --赵敏套装◆飞云骓
	Setmeal[920-3]={920-3,921-3,922-3,3,14,5,9967} --针神套装◆暴雨梨花针
	Setmeal[921-3]={920-3,921-3,922-3,18,5,2,9967} --针神套装◆冥契法衣
	Setmeal[922-3]={920-3,921-3,922-3,23,11,3,9967} --针神套装◆兀鹰
	Setmeal[923-3]={923-3,924-3,925-3,10,2,6,9803} --芷若套装◆毒龙银鞭
	Setmeal[924-3]={923-3,924-3,925-3,20,10,5,9803} --芷若套装◆天都雾月
	Setmeal[925-3]={923-3,924-3,925-3,15,2,5,9803} --芷若套装◆兔子
	Setmeal[926-3]={926-3,927-3,928-3,18,10,2,9868} --钟灵套装◆秋水雁翎刀
	Setmeal[927-3]={926-3,927-3,928-3,18,11,2,9868} --钟灵套装◆舞风霓裳
	Setmeal[928-3]={926-3,927-3,928-3,16,6,5,9868} --钟灵套装◆闪电貂
	Setmeal[929-3]={929-3,930-3,931-3,13,7,6,9976} --重阳套装◆七星龙渊剑
	Setmeal[930-3]={929-3,930-3,931-3,19,2,3,9976} --重阳套装◆冰壁玉甲
	Setmeal[931-3]={929-3,930-3,931-3,17,8,6,9976} --重阳套装◆犀牛
	Setmeal[932-3]={932-3,933-3,934-3,13,1,2,9945} --朱雀套装◆朱雀神焰扇
	Setmeal[933-3]={932-3,933-3,934-3,14,10,5,9945} --朱雀套装◆雾幻云袍
	Setmeal[934-3]={932-3,933-3,934-3,14,10,3,9945} --朱雀套装◆白鹿
	Setmeal[935-3]={935-3,936-3,937-3,13,9,7,9817} --紫衫套装◆紫金珊瑚杖
	Setmeal[936-3]={935-3,936-3,937-3,17,5,2,9817} --紫衫套装◆紫薇仙衣
	Setmeal[937-3]={935-3,936-3,937-3,11,4,4,9817} --紫衫套装◆玉面火猴
	Setmeal[938-3]={938-3,939-3,940-3,14,13,3,9828} --醉鹤套装◆鹤嘴笔
	Setmeal[939-3]={938-3,939-3,940-3,3,5,5,9828} --醉鹤套装◆蚀魄幽铠
	Setmeal[940-3]={938-3,939-3,940-3,2,13,3,9828} --醉鹤套装◆花斑毒蝎

	
	-- Setmeal[548]={548,549,550,13,6,4} --青竹棒
	-- Setmeal[549]={548,549,550,2,2,6} --淺綠青衫
	-- Setmeal[550]={548,549,550,4,10,4} --羊
	-- Setmeal[551]={551,552,553,11,9,7} --飛天玉虎爪
	-- Setmeal[552]={551,552,553,16,2,1} --騶虞皮裘
	-- Setmeal[553]={551,552,553,17,7,5} --騶虞
	-- Setmeal[554]={554,555,556,1,10,5} --幻蝶扇
	-- Setmeal[555]={554,555,556,7,9,3} --繡金白袍
	-- Setmeal[556]={554,555,556,3,14,7} --駱駝
	-- Setmeal[557]={557,558,559,19,3,6} --瀝泉盤龍槍
	-- Setmeal[558]={557,558,559,22,5,2} --龍神天鎧
	-- Setmeal[559]={557,558,559,7,12,1} --黑雕
	-- Setmeal[560]={560,561,562,11,13,5} --九弦琴
	-- Setmeal[561]={560,561,562,24,6,1} --綴玉華裳
	-- Setmeal[562]={560,561,562,5,13,6} --貓
	-- Setmeal[563]={563,564,565,6,4,4} --金鈴索帶
	-- Setmeal[564]={563,564,565,25,14,6} --雪羽披風
	-- Setmeal[565]={563,564,565,11,5,2} --九尾靈狐
	-- Setmeal[566]={566,567,568,2,8,4} --烏茲鋼刃
	-- Setmeal[567]={566,567,568,17,15,6} --鱷神皮甲
	-- Setmeal[568]={566,567,568,19,5,6} --鯊魚
	-- Setmeal[569]={569,570,571,20,13,2} --毒龍銀鞭
	-- Setmeal[570]={569,570,571,10,8,3} --素綢朱綾
	-- Setmeal[571]={569,570,571,22,14,7} --蛇蟋
	-- Setmeal[572]={572,573,574,26,9,1} --乾坤一氣袋
	-- Setmeal[573]={572,573,574,20,5,6} --化蘊神鎧
	-- Setmeal[574]={572,573,574,14,2,5} --漆黑星
	-- Setmeal[575]={575,576,577,6,5,1} --金蛇劍
	-- Setmeal[576]={575,576,577,7,9,4} --金絲背心
	-- Setmeal[577]={575,576,577,26,4,5} --猩猩
	-- Setmeal[578]={578,579,580,19,11,7} --銀鉤鐵劃
	-- Setmeal[579]={578,579,580,16,14,6} --火浣銀紗
	-- Setmeal[580]={578,579,580,21,5,6} --白熊
	-- Setmeal[581]={581,582,583,11,4,2} --樓蘭古劍
	-- Setmeal[582]={581,582,583,5,8,1} --玉女云袖
	-- Setmeal[583]={581,582,583,2,3,4} --兀鷹
	-- Setmeal[584]={584,585,586,3,13,3} --九儀天尊
	-- Setmeal[585]={584,585,586,17,4,1} --辟法玄胄
	-- Setmeal[586]={584,585,586,12,5,5} --狻倪
	-- Setmeal[587]={587,588,589,11,5,3} --井中水月
	-- Setmeal[588]={587,588,589,23,11,4} --黃纏明錦
	-- Setmeal[589]={587,588,589,10,7,4} --照夜白
	-- Setmeal[590]={590,591,592,17,13,5} --血刀
	-- Setmeal[591]={590,591,592,26,3,4} --烏蠶寶衣
	-- Setmeal[592]={590,591,592,2,6,4} --黃牛
	-- Setmeal[593]={593,594,595,26,4,4} --簪花繡針
	-- Setmeal[594]={593,594,595,1,10,3} --山河繡袍
	-- Setmeal[595]={593,594,595,12,5,4} --空速星痕
	-- Setmeal[596]={596,597,598,24,4,2} --玉簫
	-- Setmeal[597]={596,597,598,16,5,7} --軟?寶甲
	-- Setmeal[598]={596,597,598,17,8,5} --白駝怪蛇
	-- Setmeal[599]={599,600,601,6,13,4} --柳葉銀狐刀
	-- Setmeal[600]={599,600,601,12,1,2} --玄羅輕袖
	-- Setmeal[601]={599,600,601,2,4,4} --金銀血蛇
	-- Setmeal[602]={602,603,604,15,7,2} --陰陽扇
	-- Setmeal[603]={602,603,604,24,10,5} --淺綠青衫
	-- Setmeal[604]={602,603,604,3,8,5} --莽牯朱蛤
	-- Setmeal[605]={605,606,607,1,1,4} --鱷嘴剪
	-- Setmeal[606]={605,606,607,10,6,4} --鱷神皮甲
	-- Setmeal[607]={605,606,607,5,3,2} --鱷魚
	-- Setmeal[608]={608,609,610,4,11,2} --闖王軍刀
	-- Setmeal[609]={608,609,610,6,5,2} --紫云戰衣
	-- Setmeal[610]={608,609,610,6,5,7} --九尾靈狐
	-- Setmeal[611]={611,612,613,22,2,4} --鳳屏孔雀翎
	-- Setmeal[612]={611,612,613,17,1,3} --九龍云胄
	-- Setmeal[613]={611,612,613,6,7,4} --狴犴
	-- Setmeal[614]={614,615,616,23,1,7} --金絲芙蓉鐲
	-- Setmeal[615]={614,615,616,2,1,6} --浮光錦裘
	-- Setmeal[616]={614,615,616,2,14,4} --蛇蟋
	-- Setmeal[617]={617,618,619,18,4,1} --爛銀鶴爪
	-- Setmeal[618]={617,618,619,21,5,3} --雪羽披風
	-- Setmeal[619]={617,618,619,7,9,3} --黑玫瑰
	-- Setmeal[620]={620,621,622,19,4,5} --打狗棒
	-- Setmeal[621]={620,621,622,4,11,5} --百結鶉衣
	-- Setmeal[622]={620,621,622,14,11,4} --漆黑星
	-- Setmeal[623]={623,624,625,7,12,2} --金刀黑劍
	-- Setmeal[624]={623,624,625,24,15,5} --幽旛魂錦
	-- Setmeal[625]={623,624,625,12,11,5} --彩雪蛛
	-- Setmeal[626]={626,627,628,12,9,3} --倚天劍
	-- Setmeal[627]={626,627,628,14,5,6} --天都霧月
	-- Setmeal[628]={626,627,628,24,12,7} --金錢豹
	-- Setmeal[629]={629,630,631,18,13,2} --綠波香露刀
	-- Setmeal[630]={629,630,631,8,3,1} --九黎輕裝
	-- Setmeal[631]={629,630,631,5,11,5} --羊
	-- Setmeal[632]={632,633,634,23,14,1} --冷月寶刀
	-- Setmeal[633]={632,633,634,21,10,1} --紫云戰衣
	-- Setmeal[634]={632,633,634,25,11,7} --黑熊
	-- Setmeal[635]={635,636,637,12,9,1} --金龍鞭
	-- Setmeal[636]={635,636,637,9,5,7} --金絲緞袍
	-- Setmeal[637]={635,636,637,5,5,2} --碧云霞
	-- Setmeal[638]={638,639,640,22,7,4} --打狗棒
	-- Setmeal[639]={638,639,640,14,13,3} --軟?寶甲
	-- Setmeal[640]={638,639,640,22,3,2} --白雕
	-- Setmeal[641]={641,642,643,7,7,7} --卜天鉆
	-- Setmeal[642]={641,642,643,24,3,7} --黃纏明錦
	-- Setmeal[643]={641,642,643,11,11,3} --黃騮自在
	-- Setmeal[644]={644,645,646,1,7,7} --凝碧劍
	-- Setmeal[645]={644,645,646,3,12,3} --素綢朱綾
	-- Setmeal[646]={644,645,646,12,12,5} --豺狼
	-- Setmeal[647]={647,648,649,7,15,1} --圣火令
	-- Setmeal[648]={647,648,649,26,12,6} --幽旛魂錦
	-- Setmeal[649]={647,648,649,21,2,1} --菩斯曲蛇
	-- Setmeal[650]={650,651,652,17,1,4} --木劍
	-- Setmeal[651]={650,651,652,14,14,7} --山河繡袍
	-- Setmeal[652]={650,651,652,3,14,6} --神雕
	-- Setmeal[653]={653,654,655,18,5,1} --九韶定音劍
	-- Setmeal[654]={653,654,655,11,11,2} --玄烏羽衣
	-- Setmeal[655]={653,654,655,4,11,7} --天尊令
	-- Setmeal[656]={656,657,658,4,13,1} --木劍
	-- Setmeal[657]={656,657,658,14,11,5} --飆風猿鎧
	-- Setmeal[658]={656,657,658,8,8,7} --猩猩
	-- Setmeal[659]={659,660,661,8,7,7} --青竹棒
	-- Setmeal[660]={659,660,661,3,2,3} --瑤池仙袖
	-- Setmeal[661]={659,660,661,9,4,4} --白猿
	-- Setmeal[662]={662,663,664,13,3,5} --虎頭金刀
	-- Setmeal[663]={662,663,664,19,6,5} --肅霜寶裘
	-- Setmeal[664]={662,663,664,13,14,2} --黑雕
	-- Setmeal[665]={665,666,667,26,3,4} --龍鳳子母環
	-- Setmeal[666]={665,666,667,13,3,1} --金絲緞袍
	-- Setmeal[667]={665,666,667,20,5,4} --靈獒
	-- Setmeal[668]={668,669,670,18,5,3} --五行輪
	-- Setmeal[669]={668,669,670,7,11,7} --天蠶寶甲
	-- Setmeal[670]={668,669,670,14,6,5} --彩雪蛛
	-- Setmeal[671]={671,672,673,15,2,3} --金蛇劍
	-- Setmeal[672]={671,672,673,26,9,1} --鳳凰織錦
	-- Setmeal[673]={671,672,673,8,9,3} --金蛇
	-- Setmeal[674]={674,675,676,10,11,5} --鑌鐵判官筆
	-- Setmeal[675]={674,675,676,3,8,2} --銀狐披肩
	-- Setmeal[676]={674,675,676,6,14,1} --靈獒
	-- Setmeal[677]={677,678,679,3,1,1} --君子劍
	-- Setmeal[678]={677,678,679,26,13,6} --鈞天瓏袖
	-- Setmeal[679]={677,678,679,10,8,7} --踏霜白
	-- Setmeal[680]={680,681,682,6,15,3} --崆峒印
	-- Setmeal[681]={680,681,682,5,8,2} --仙符法袍
	-- Setmeal[682]={680,681,682,12,11,5} --血蛙
	-- Setmeal[683]={683,684,685,18,14,1} --割鹿刀
	-- Setmeal[684]={683,684,685,1,3,6} --雷絳紋帛
	-- Setmeal[685]={683,684,685,23,10,4} --血鳥
	-- Setmeal[686]={686,687,688,13,3,1} --伏魔金杵
	-- Setmeal[687]={686,687,688,22,11,3} --九黎輕裝
	-- Setmeal[688]={686,687,688,2,8,7} --黃牛
	-- Setmeal[689]={689,690,691,8,11,6} --碧水劍
	-- Setmeal[690]={689,690,691,3,13,1} --玉女云袖
	-- Setmeal[691]={689,690,691,11,11,1} --照夜白
	-- Setmeal[692]={692,693,694,14,13,5} --銀煙管
	-- Setmeal[693]={692,693,694,14,4,4} --凝玉紗索
	-- Setmeal[694]={692,693,694,8,10,1} --莽牯朱蛤
	-- Setmeal[695]={695,696,697,7,8,2} --紫薇軟劍
	-- Setmeal[696]={695,696,697,23,8,5} --鈞天瓏袖
	-- Setmeal[697]={695,696,697,24,4,1} --烏云蓋雪
	-- Setmeal[698]={698,699,700,8,10,4} --淑女劍
	-- Setmeal[699]={698,699,700,9,2,7} --朧影織衣
	-- Setmeal[700]={698,699,700,18,15,5} --玉蜂
	-- Setmeal[701]={701,702,703,9,7,1} --北霸銀鯊槍
	-- Setmeal[702]={701,702,703,5,6,2} --冰壁玉甲
	-- Setmeal[703]={701,702,703,1,7,7} --龍燕令
	-- Setmeal[704]={704,705,706,16,3,3} --鹿角杖
	-- Setmeal[705]={704,705,706,23,3,1} --蝕魄幽鎧
	-- Setmeal[706]={704,705,706,19,10,7} --黃犬
	-- Setmeal[707]={707,708,709,1,14,4} --鴛鴦寶刀
	-- Setmeal[708]={707,708,709,7,6,3} --玄羅輕袖
	-- Setmeal[709]={707,708,709,22,13,4} --銀霜逐電
	-- Setmeal[710]={710,711,712,20,4,4} --金龍鞭
	-- Setmeal[711]={710,711,712,24,15,4} --肅霜寶裘
	-- Setmeal[712]={710,711,712,18,10,7} --追風黃
	-- Setmeal[713]={713,714,715,15,8,7} --鐵鴛鴦
	-- Setmeal[714]={713,714,715,11,7,2} --黑天魔鎧
	-- Setmeal[715]={713,714,715,14,3,7} --九花?
	-- Setmeal[716]={716,717,718,5,9,6} --輝耀金斧
	-- Setmeal[717]={716,717,718,6,6,5} --駝紋金胄
	-- Setmeal[718]={716,717,718,23,2,3} --駱駝
	-- Setmeal[719]={719,720,721,3,11,2} --黑白雙劍
	-- Setmeal[720]={719,720,721,16,14,3} --朧影織衣
	-- Setmeal[721]={719,720,721,20,13,1} --墨蹄玉兔
	-- Setmeal[722]={722,723,724,9,9,3} --東皇鐘
	-- Setmeal[723]={722,723,724,2,8,1} --計都荒寰
	-- Setmeal[724]={722,723,724,15,6,1} --戰象
	-- Setmeal[725]={725,726,727,22,6,3} --圣火令
	-- Setmeal[726]={725,726,727,15,11,5} --幽日煌袍
	-- Setmeal[727]={725,726,727,8,14,5} --金銀血蛇
	-- Setmeal[728]={728,729,730,7,11,3} --圓月彎刀
	-- Setmeal[729]={728,729,730,5,4,1} --黃泉祭衣
	-- Setmeal[730]={728,729,730,22,11,4} --狻倪
	-- Setmeal[731]={731,732,733,9,6,1} --蒼狼天刃
	-- Setmeal[732]={731,732,733,5,7,3} --黑天魔鎧
	-- Setmeal[733]={731,732,733,7,12,3} --飛云騅
	-- Setmeal[734]={734,735,736,1,13,4} --銀絲拂塵
	-- Setmeal[735]={734,735,736,10,3,5} --霧幻云袍
	-- Setmeal[736]={734,735,736,20,6,2} --金錢豹
	-- Setmeal[737]={737,738,739,5,11,3} --玄鐵棋盤
	-- Setmeal[738]={737,738,739,16,3,7} --金絲背心
	-- Setmeal[739]={737,738,739,15,5,2} --黃驄驃
	-- Setmeal[740]={740,741,742,22,13,6} --琥珀神環
	-- Setmeal[741]={740,741,742,14,12,5} --紫靈天珠
	-- Setmeal[742]={740,741,742,3,12,5} --御風乘黃
	-- Setmeal[743]={743,744,745,25,3,3} --天蛇杖
	-- Setmeal[744]={743,744,745,5,13,5} --圣靈披風
	-- Setmeal[745]={743,744,745,17,9,2} --圣靈珠
	-- Setmeal[746]={746,747,748,1,2,4} --偷天劍
	-- Setmeal[747]={746,747,748,3,15,1} --雷絳紋帛
	-- Setmeal[748]={746,747,748,18,12,6} --小雪龍
	-- Setmeal[749]={749,750,751,12,4,2} --玄鐵令
	-- Setmeal[750]={749,750,751,4,12,3} --烏蠶寶衣
	-- Setmeal[751]={749,750,751,26,15,1} --黃犬
	-- Setmeal[752]={752,753,754,5,8,3} --冥煌刺
	-- Setmeal[753]={752,753,754,24,5,7} --百結鶉衣
	-- Setmeal[754]={752,753,754,13,14,5} --鱷魚
	-- Setmeal[755]={755,756,757,4,1,6} --北霸銀鯊槍
	-- Setmeal[756]={755,756,757,3,6,5} --紫金玄鎧
	-- Setmeal[757]={755,756,757,13,13,7} --五彩神龍
	-- Setmeal[758]={758,759,760,7,10,7} --血滴子
	-- Setmeal[759]={758,759,760,23,13,7} --九龍云胄
	-- Setmeal[760]={758,759,760,24,14,7} --玉花驄
	-- Setmeal[761]={761,762,763,17,8,7} --白玉瑤琴
	-- Setmeal[762]={761,762,763,4,13,1} --銀狐披肩
	-- Setmeal[763]={761,762,763,9,12,5} --貓
	-- Setmeal[764]={764,765,766,24,13,1} --黑狼鬼索
	-- Setmeal[765]={764,765,766,11,9,6} --辟法玄胄
	-- Setmeal[766]={764,765,766,22,7,2} --戰象
	-- Setmeal[767]={767,768,769,16,3,6} --真武劍
	-- Setmeal[768]={767,768,769,7,3,2} --神隱披風
	-- Setmeal[769]={767,768,769,24,11,7} --靈龜
	-- Setmeal[770]={770,771,772,3,9,6} --焦尾琴
	-- Setmeal[771]={770,771,772,4,15,3} --銀華月緞
	-- Setmeal[772]={770,771,772,22,7,5} --仙鶴
	-- Setmeal[773]={773,774,775,7,13,1} --蟠龍金棍
	-- Setmeal[774]={773,774,775,22,13,7} --錦斕袈裟
	-- Setmeal[775]={773,774,775,8,15,3} --小雪龍
	-- Setmeal[776]={776,777,778,17,12,1} --滿月雕弓
	-- Setmeal[777]={776,777,778,19,3,2} --駝紋金胄
	-- Setmeal[778]={776,777,778,23,11,7} --九花?
	-- Setmeal[779]={779,780,781,22,13,3} --玄鐵劍
	-- Setmeal[780]={779,780,781,19,14,5} --玄烏羽衣
	-- Setmeal[781]={779,780,781,1,15,4} --菩斯曲蛇
	-- Setmeal[782]={782,783,784,24,7,2} --龍牙擊
	-- Setmeal[783]={782,783,784,3,5,6} --騶虞皮裘
	-- Setmeal[784]={782,783,784,13,2,1} --白熊
	-- Setmeal[785]={785,786,787,24,4,2} --嵩陽鐵劍
	-- Setmeal[786]={785,786,787,18,14,1} --紫練華衣
	-- Setmeal[787]={785,786,787,9,4,6} --黑木令
	-- Setmeal[788]={788,789,790,5,9,4} --玄鐵匕首
	-- Setmeal[789]={788,789,790,16,5,5} --輕綢舞袖
	-- Setmeal[790]={788,789,790,23,14,1} --五彩神龍
	-- Setmeal[791]={791,792,793,2,7,2} --昆侖鏡
	-- Setmeal[792]={791,792,793,25,8,3} --飆風猿鎧
	-- Setmeal[793]={791,792,793,25,4,6} --白猿
	-- Setmeal[794]={794,795,796,2,13,5} --峨嵋分水刺
	-- Setmeal[795]={794,795,796,3,7,2} --七色蝶裳
	-- Setmeal[796]={794,795,796,12,1,3} --汗血寶馬
	-- Setmeal[797]={797,798,799,11,12,7} --劍盾珠索
	-- Setmeal[798]={797,798,799,26,7,6} --銀華月緞
	-- Setmeal[799]={797,798,799,22,5,7} --豺狼
	-- Setmeal[800]={800,801,802,12,7,1} --白虹劍
	-- Setmeal[801]={800,801,802,11,5,2} --火浣銀紗
	-- Setmeal[802]={800,801,802,19,3,7} --玉面火猴
	-- Setmeal[803]={803,804,805,22,6,7} --精鋼指套
	-- Setmeal[804]={803,804,805,10,10,1} --熒煌明光
	-- Setmeal[805]={803,804,805,16,4,2} --冰蠶
	-- Setmeal[806]={806,807,808,2,4,1} --金蜈鉤
	-- Setmeal[807]={806,807,808,21,5,4} --紫薇仙衣
	-- Setmeal[808]={806,807,808,6,10,7} --金蛇
	-- Setmeal[809]={809,810,811,5,10,4} --冥煌刺
	-- Setmeal[810]={809,810,811,24,13,3} --紫金玄鎧
	-- Setmeal[811]={809,810,811,8,8,4} --追風黃
	-- Setmeal[812]={812,813,814,21,15,4} --毒針指環
	-- Setmeal[813]={812,813,814,25,3,6} --仙符法袍
	-- Setmeal[814]={812,813,814,6,1,3} --鯊魚
	-- Setmeal[815]={815,816,817,22,7,3} --點鋼峨嵋刺
	-- Setmeal[816]={815,816,817,7,10,4} --舞風霓裳
	-- Setmeal[817]={815,816,817,20,6,7} --黑玫瑰
	-- Setmeal[818]={818,819,820,23,11,7} --金銀小劍
	-- Setmeal[819]={818,819,820,17,5,3} --羊皮長袍
	-- Setmeal[820]={818,819,820,16,14,2} --踏霜白
	-- Setmeal[821]={821,822,823,5,7,6} --真武劍
	-- Setmeal[822]={821,822,823,16,11,1} --繡金白袍
	-- Setmeal[823]={821,822,823,20,3,3} --血鳥
	-- Setmeal[824]={824,825,826,21,12,4} --屠龍刀
	-- Setmeal[825]={824,825,826,1,9,7} --幽日煌袍
	-- Setmeal[826]={824,825,826,7,9,5} --血蛙
	-- Setmeal[827]={827,828,829,4,4,6} --九儀天尊
	-- Setmeal[828]={827,828,829,15,3,5} --神隱披風
	-- Setmeal[829]={827,828,829,20,10,6} --騶虞
	-- Setmeal[830]={830,831,832,17,3,3} --蝎尾鞭
	-- Setmeal[831]={830,831,832,1,6,5} --凝玉紗索
	-- Setmeal[832]={830,831,832,17,1,4} --花斑毒蝎
	-- Setmeal[833]={833,834,835,25,1,6} --白龍劍
	-- Setmeal[834]={833,834,835,20,15,4} --玄武道裝
	-- Setmeal[835]={833,834,835,9,12,7} --青驢
	-- Setmeal[836]={836,837,838,22,13,2} --天蛇杖
	-- Setmeal[837]={836,837,838,25,12,2} --計都荒寰
	-- Setmeal[838]={836,837,838,3,7,7} --白駝怪蛇
	-- Setmeal[839]={839,840,841,23,12,4} --玄鐵劍
	-- Setmeal[840]={839,840,841,20,10,4} --天瑞華綾
	-- Setmeal[841]={839,840,841,25,11,4} --神雕
	-- Setmeal[842]={842,843,844,20,13,3} --海月清輝
	-- Setmeal[843]={842,843,844,25,6,4} --綴玉華裳
	-- Setmeal[844]={842,843,844,25,4,4} --九霄環佩
	-- Setmeal[845]={845,846,847,23,15,2} --玉劍
	-- Setmeal[846]={845,846,847,21,12,3} --輕綢舞袖
	-- Setmeal[847]={845,846,847,24,4,4} --碧云霞
	-- Setmeal[848]={848,849,850,7,10,6} --黑玉碎星鐲
	-- Setmeal[849]={848,849,850,21,1,2} --浮光錦裘
	-- Setmeal[850]={848,849,850,19,9,4} --青驢
	-- Setmeal[851]={851,852,853,8,3,6} --伏羲琴
	-- Setmeal[852]={851,852,853,6,9,7} --瑤池仙袖
	-- Setmeal[853]={851,852,853,24,11,7} --云狐
	-- Setmeal[854]={854,855,856,10,2,2} --鋸齒鋼盾
	-- Setmeal[855]={854,855,856,5,8,7} --龍神天鎧
	-- Setmeal[856]={854,855,856,19,12,5} --狴犴
	-- Setmeal[857]={857,858,859,8,6,4} --羅剎火槍
	-- Setmeal[858]={857,858,859,20,13,5} --天蠶寶甲
	-- Setmeal[859]={857,858,859,3,12,6} --玉花驄
	-- Setmeal[860]={860,861,862,11,5,7} --柔絲索
	-- Setmeal[861]={860,861,862,4,8,6} --黃泉祭衣
	-- Setmeal[862]={860,861,862,16,12,4} --冰蠶
	-- Setmeal[863]={863,864,865,23,9,6} --神農鼎
	-- Setmeal[864]={863,864,865,6,7,3} --冥契法衣
	-- Setmeal[865]={863,864,865,18,14,6} --白鹿
	-- Setmeal[866]={866,867,868,2,10,1} --降魔禪杖
	-- Setmeal[867]={866,867,868,24,11,3} --熒煌明光
	-- Setmeal[868]={866,867,868,26,8,5} --犀牛
	-- Setmeal[869]={869,870,871,18,1,6} --黑白雙劍
	-- Setmeal[870]={869,870,871,25,7,6} --黑緞籠衫
	-- Setmeal[871]={869,870,871,18,3,7} --烏云蓋雪
	-- Setmeal[872]={872,873,874,21,11,3} --洞佩蝶戀花
	-- Setmeal[873]={872,873,874,18,10,5} --玄武道裝
	-- Setmeal[874]={872,873,874,14,5,3} --靈龜
	-- Setmeal[875]={875,876,877,22,6,2} --血刀
	-- Setmeal[876]={875,876,877,23,8,3} --錦斕袈裟
	-- Setmeal[877]={875,876,877,2,4,4} --黃驄驃
	-- Setmeal[878]={878,879,880,11,2,3} --鑌鐵杖
	-- Setmeal[879]={878,879,880,17,3,5} --冰月皇衣
	-- Setmeal[880]={878,879,880,11,7,1} --醉人蜂
	-- Setmeal[881]={881,882,883,14,13,7} --君子劍
	-- Setmeal[882]={881,882,883,22,6,6} --黑緞籠衫
	-- Setmeal[883]={881,882,883,25,7,3} --黃騮自在
	-- Setmeal[884]={884,885,886,23,12,5} --妖刀村正
	-- Setmeal[885]={884,885,886,18,12,2} --化蘊神甲
	-- Setmeal[886]={884,885,886,16,10,4} --黑木令
	-- Setmeal[887]={887,888,889,25,2,1} --鐵浮屠
	-- Setmeal[888]={887,888,889,22,10,3} --冰月皇衣
	-- Setmeal[889]={887,888,889,3,10,2} --白雕
	-- Setmeal[890]={890,891,892,3,11,4} --龍泉劍
	-- Setmeal[891]={890,891,892,17,12,4} --白練單衣
	-- Setmeal[892]={890,891,892,14,2,1} --兔子
	-- Setmeal[893]={893,894,895,14,4,4} --燕語琴
	-- Setmeal[894]={893,894,895,22,8,5} --七色蝶裳
	-- Setmeal[895]={893,894,895,17,10,7} --墨蹄玉兔
	-- Setmeal[896]={896,897,898,24,9,1} --海月清輝
	-- Setmeal[897]={896,897,898,25,9,5} --珠璃瑩甲
	-- Setmeal[898]={896,897,898,16,9,5} --醉人蜂
	-- Setmeal[899]={899,900,901,9,2,5} --逍遙神仙環
	-- Setmeal[900]={899,900,901,11,8,4} --珠璃瑩甲
	-- Setmeal[901]={899,900,901,5,15,6} --仙鶴
	-- Setmeal[902]={902,903,904,13,12,3} --鉑絲掌套
	-- Setmeal[903]={902,903,904,7,4,2} --天瑞華綾
	-- Setmeal[904]={902,903,904,15,1,2} --玉蜂
	-- Setmeal[905]={905,906,907,26,5,5} --蟒神蛇鞭
	-- Setmeal[906]={905,906,907,6,1,1} --紫練華衣
	-- Setmeal[907]={905,906,907,22,11,7} --銀霜逐電
	-- Setmeal[908]={908,909,910,16,9,1} --黑狼鬼索
	-- Setmeal[909]={908,909,910,1,3,2} --羊皮長袍
	-- Setmeal[910]={908,909,910,14,12,4} --黑熊
	-- Setmeal[911]={911,912,913,25,13,3} --軒轅劍
	-- Setmeal[912]={911,912,913,7,8,6} --圣靈披風
	-- Setmeal[913]={911,912,913,1,7,2} --云狐
	-- Setmeal[914]={914,915,916,7,4,7} --倚天劍
	-- Setmeal[915]={914,915,916,20,14,4} --鳳凰織錦
	-- Setmeal[916]={914,915,916,14,9,3} --飛云騅
	-- Setmeal[917]={917,918,919,24,9,6} --暴雨梨花針
	-- Setmeal[918]={917,918,919,10,8,7} --冥契法衣
	-- Setmeal[919]={917,918,919,25,12,2} --兀鷹
	-- Setmeal[920]={920,921,922,4,4,4} --毒龍銀鞭
	-- Setmeal[921]={920,921,922,5,6,3} --天都霧月
	-- Setmeal[922]={920,921,922,4,3,2} --兔子
	-- Setmeal[923]={923,924,925,2,12,7} --秋水雁翎刀
	-- Setmeal[924]={923,924,925,24,13,7} --舞風霓裳
	-- Setmeal[925]={923,924,925,15,9,6} --閃電貂
	-- Setmeal[926]={926,927,928,21,1,5} --七星龍淵劍
	-- Setmeal[927]={926,927,928,2,4,5} --冰壁玉甲
	-- Setmeal[928]={926,927,928,9,2,6} --犀牛
	-- Setmeal[929]={929,930,931,25,15,5} --朱雀神焰扇
	-- Setmeal[930]={929,930,931,9,7,4} --霧幻云袍
	-- Setmeal[931]={929,930,931,16,7,2} --白鹿
	-- Setmeal[932]={932,933,934,25,2,3} --紫金珊瑚杖
	-- Setmeal[933]={932,933,934,23,14,2} --紫薇仙衣
	-- Setmeal[934]={932,933,934,12,13,7} --玉面火猴
	-- Setmeal[935]={935,936,937,15,7,2} --鶴嘴筆
	-- Setmeal[936]={935,936,937,5,5,4} --蝕魄幽鎧
	-- Setmeal[937]={935,936,937,3,13,1} --花斑毒蝎
	
	
	
	
	--CC.PTF = {}
    --前后对应一致的编号表示人物编号
    --比如CC.PTF[0] 和 [0] = 1 中的0都表示人物ID，
	
	
    --半身像手动偏移
    CC.Png = {}

    --复制队友
    CC.Copy = {}
    CC.Copy[93]=609
	CC.Copy[92]=709
    CC.Copy[528]=523
	CC.Copy[30]=55
	CC.Copy[530]=628
	CC.Copy[531]=457
	CC.Copy[608]=27
    CC.Copy[662]=1
    CC.Copy[663]=2
    CC.Copy[664]=9
    CC.Copy[665]=16
    CC.Copy[666]=17
    CC.Copy[667]=25
    CC.Copy[668]=28
    CC.Copy[669]=29
    CC.Copy[670]=35
    CC.Copy[671]=36
    CC.Copy[672]=37
    CC.Copy[673]=38
    CC.Copy[674]=44
    CC.Copy[675]=45
    CC.Copy[676]=47
    CC.Copy[677]=48
    CC.Copy[678]=49
    CC.Copy[679]=51
    CC.Copy[680]=52
    CC.Copy[681]=53
    CC.Copy[682]=54
    CC.Copy[683]=55
    CC.Copy[684]=56
    CC.Copy[685]=58
    CC.Copy[686]=59
    CC.Copy[687]=63
    CC.Copy[688]=66
    CC.Copy[689]=72
    CC.Copy[690]=73
    CC.Copy[690]=611
    CC.Copy[691]=74
    CC.Copy[692]=75
    CC.Copy[693]=76
    CC.Copy[694]=77
    CC.Copy[695]=78
    CC.Copy[696]=79
    CC.Copy[697]=80
    CC.Copy[698]=81
    CC.Copy[699]=82
    CC.Copy[700]=83
    CC.Copy[701]=84
    CC.Copy[702]=85
    CC.Copy[703]=86
    CC.Copy[704]=87
    CC.Copy[705]=88
    CC.Copy[706]=89
    CC.Copy[707]=90
    CC.Copy[708]=91
    CC.Copy[710]=151
    CC.Copy[711]=154
    CC.Copy[712]=502
    CC.Copy[712]=566
    CC.Copy[713]=569
    CC.Copy[714]=574
    CC.Copy[715]=589
    CC.Copy[716]=590
    CC.Copy[717]=601
    CC.Copy[718]=604
    CC.Copy[719]=4
    CC.Copy[720]=161
end

function rest()
	--银两
	CC.Gold = 0
	--天关残章奖励
	CC.Sp = 0
	--天关残章奖励判定是否触发，防止重复刷
	CC.Jl = 0

	CC.PTF = {}
    CC.PTF[0] = {[0] = 1}
    CC.PTF[1] = {[1] = 1}
    CC.PTF[2] = {[2] = 1}
    CC.PTF[3] = {[3] = 1}
    CC.PTF[4] = {[4] = 1}
    CC.PTF[5] = {[5] = 1}
    CC.PTF[6] = {[6] = 1}
    CC.PTF[7] = {[7] = 1}
    CC.PTF[8] = {[8] = 1}
    CC.PTF[9] = {[9] = 1}
    CC.PTF[10] = {[10] = 1}
    CC.PTF[11] = {[11] = 1}
    CC.PTF[12] = {[12] = 1}
    CC.PTF[13] = {[13] = 1}
    CC.PTF[14] = {[14] = 1}
    CC.PTF[15] = {[15] = 1}
    CC.PTF[16] = {[16] = 1}
    CC.PTF[17] = {[17] = 1}
    CC.PTF[18] = {[18] = 1}
    CC.PTF[19] = {[19] = 1}
    CC.PTF[20] = {[20] = 1}
    CC.PTF[21] = {[21] = 1}
    CC.PTF[22] = {[22] = 1}
    CC.PTF[23] = {[23] = 1}
    CC.PTF[24] = {[24] = 1}
    CC.PTF[25] = {[25] = 1}
    CC.PTF[26] = {[26] = 1}
    CC.PTF[27] = {[27] = 1}
    CC.PTF[28] = {[28] = 1}
    CC.PTF[29] = {[29] = 1}
    CC.PTF[30] = {[30] = 1}
    CC.PTF[31] = {[31] = 1}
    CC.PTF[32] = {[32] = 1}
    CC.PTF[33] = {[33] = 1}
    CC.PTF[34] = {[34] = 1}
	CC.PTF[35] = {[35] = 1}
    CC.PTF[36] = {[36] = 1}
    CC.PTF[37] = {[37] = 1}
    CC.PTF[38] = {[38] = 1}
    CC.PTF[39] = {[39] = 1}
    CC.PTF[40] = {[40] = 1}
    CC.PTF[41] = {[41] = 1}
    CC.PTF[42] = {[42] = 1}
    CC.PTF[43] = {[43] = 1}
    CC.PTF[44] = {[44] = 1}
    CC.PTF[45] = {[45] = 1}
    CC.PTF[46] = {[46] = 1}
    CC.PTF[47] = {[47] = 1}
    CC.PTF[48] = {[48] = 1}
    CC.PTF[49] = {[49] = 1}
    CC.PTF[50] = {[50] = 1}
    CC.PTF[51] = {[51] = 1}
    CC.PTF[52] = {[52] = 1}
    CC.PTF[53] = {[53] = 1}
    CC.PTF[54] = {[54] = 1}
    CC.PTF[55] = {[55] = 1}
    CC.PTF[56] = {[56] = 1}
    CC.PTF[57] = {[57] = 1}
    CC.PTF[58] = {[58] = 1}
    CC.PTF[59] = {[59] = 1}
    CC.PTF[60] = {[60] = 1}
    CC.PTF[61] = {[61] = 1}
    CC.PTF[62] = {[62] = 1}
    CC.PTF[63] = {[63] = 1}
    CC.PTF[64] = {[64] = 1}
    CC.PTF[65] = {[65] = 1}
    CC.PTF[66] = {[66] = 1}
    CC.PTF[67] = {[67] = 1}
    CC.PTF[68] = {[68] = 1}
    CC.PTF[69] = {[69] = 1}
    CC.PTF[70] = {[70] = 1}
    CC.PTF[71] = {[71] = 1}
    CC.PTF[72] = {[72] = 1}
    CC.PTF[73] = {[73] = 1}
    CC.PTF[74] = {[74] = 1}
    CC.PTF[75] = {[75] = 1}
    CC.PTF[76] = {[76] = 1}
    CC.PTF[77] = {[77] = 1}
    CC.PTF[78] = {[78] = 1}
    CC.PTF[79] = {[79] = 1}
    CC.PTF[80] = {[80] = 1}
    CC.PTF[81] = {[81] = 1}
    CC.PTF[82] = {[82] = 1}
    CC.PTF[83] = {[83] = 1}
    CC.PTF[84] = {[84] = 1}
    CC.PTF[85] = {[85] = 1}
    CC.PTF[86] = {[86] = 1}
    CC.PTF[87] = {[87] = 1}
    CC.PTF[88] = {[88] = 1}
    CC.PTF[89] = {[89] = 1}
    CC.PTF[90] = {[90] = 1}
    CC.PTF[91] = {[91] = 1}
    CC.PTF[92] = {[92] = 1,[9976] = 1,[9967] = 1,[9806] = 1}  --喵太极
    CC.PTF[93] = {[93] = 1}
    CC.PTF[94] = {[94] = 1}
    CC.PTF[95] = {[95] = 1}
    CC.PTF[96] = {[96] = 1}
    CC.PTF[97] = {[97] = 1}
    CC.PTF[98] = {[98] = 1}
    CC.PTF[99] = {[99] = 1}
    CC.PTF[100] = {[100] = 1}
    CC.PTF[101] = {[101] = 1}
    CC.PTF[102] = {[102] = 1}
    CC.PTF[103] = {[103] = 1}
    CC.PTF[104] = {[104] = 1}
    CC.PTF[105] = {[105] = 1}
    CC.PTF[106] = {[106] = 1}
    CC.PTF[107] = {[107] = 1}
    CC.PTF[108] = {[108] = 1}
    CC.PTF[109] = {[109] = 1}
    CC.PTF[110] = {[110] = 1}
    CC.PTF[111] = {[111] = 1}
    CC.PTF[112] = {[112] = 1}
    CC.PTF[113] = {[113] = 1}
    CC.PTF[114] = {[114] = 1}
    CC.PTF[115] = {[115] = 1}
    CC.PTF[116] = {[116] = 1}
    CC.PTF[117] = {[117] = 1}
    CC.PTF[118] = {[118] = 1}
    CC.PTF[119] = {[119] = 1}
    CC.PTF[120] = {[120] = 1}
    CC.PTF[121] = {[121] = 1}
    CC.PTF[122] = {[122] = 1}
    CC.PTF[123] = {[123] = 1}
    CC.PTF[124] = {[124] = 1}
    CC.PTF[125] = {[125] = 1}
    CC.PTF[126] = {[126] = 1}
    CC.PTF[127] = {[127] = 1}
    CC.PTF[128] = {[128] = 1}
    CC.PTF[129] = {[129] = 1}
    CC.PTF[130] = {[130] = 1}
    CC.PTF[131] = {[131] = 1}
    CC.PTF[132] = {[132] = 1}
    CC.PTF[133] = {[133] = 1}
    CC.PTF[134] = {[134] = 1}
    CC.PTF[135] = {[135] = 1}
    CC.PTF[136] = {[136] = 1}
    CC.PTF[137] = {[137] = 1}
    CC.PTF[138] = {[138] = 1}
    CC.PTF[139] = {[139] = 1}
    CC.PTF[140] = {[140] = 1,[9982] = 1,[9974]= 1}
    CC.PTF[141] = {[141] = 1}
    CC.PTF[142] = {[142] = 1}
    CC.PTF[143] = {[143] = 1}
    CC.PTF[144] = {[144] = 1}
    CC.PTF[145] = {[145] = 1}
    CC.PTF[146] = {[146] = 1}
    CC.PTF[147] = {[147] = 1}
    CC.PTF[148] = {[148] = 1}
    CC.PTF[149] = {[149] = 1,[9995] = 1}
    CC.PTF[150] = {[150] = 1}
    CC.PTF[151] = {[151] = 1}
    CC.PTF[152] = {[152] = 1}
    CC.PTF[153] = {[153] = 1}
    CC.PTF[154] = {[154] = 1}
    CC.PTF[155] = {[155] = 1}
    CC.PTF[156] = {[156] = 1}
    CC.PTF[157] = {[157] = 1}
    CC.PTF[158] = {[158] = 1}
    CC.PTF[159] = {[159] = 1}
    CC.PTF[160] = {[160] = 1}
    CC.PTF[161] = {[161] = 1}
    CC.PTF[162] = {[162] = 1}
    CC.PTF[163] = {[163] = 1}
    CC.PTF[164] = {[164] = 1}
    CC.PTF[165] = {[165] = 1}
    CC.PTF[166] = {[166] = 1}
    CC.PTF[167] = {[167] = 1}
    CC.PTF[168] = {[168] = 1}
    CC.PTF[169] = {[169] = 1}
    CC.PTF[170] = {[170] = 1}
    CC.PTF[171] = {[171] = 1}
    CC.PTF[172] = {[172] = 1}
    CC.PTF[173] = {[173] = 1}
    CC.PTF[174] = {[174] = 1}
    CC.PTF[175] = {[175] = 1}
    CC.PTF[176] = {[176] = 1}
    CC.PTF[177] = {[177] = 1}
    CC.PTF[178] = {[178] = 1}
    CC.PTF[179] = {[179] = 1}
    CC.PTF[180] = {[180] = 1}
    CC.PTF[181] = {[181] = 1}
    CC.PTF[182] = {[182] = 1}
    CC.PTF[183] = {[183] = 1}
    CC.PTF[184] = {[184] = 1}
    CC.PTF[185] = {[185] = 1}
    CC.PTF[186] = {[186] = 1}
    CC.PTF[187] = {[187] = 1}
    CC.PTF[188] = {[188] = 1}
    CC.PTF[189] = {[189] = 1}
    CC.PTF[190] = {[190] = 1}
    CC.PTF[191] = {[191] = 1}
    CC.PTF[192] = {[192] = 1}
    CC.PTF[193] = {[193] = 1}
    CC.PTF[194] = {[194] = 1}
    CC.PTF[195] = {[195] = 1}
    CC.PTF[196] = {[196] = 1}
    CC.PTF[197] = {[197] = 1}
    CC.PTF[198] = {[198] = 1}
    CC.PTF[199] = {[199] = 1}
    CC.PTF[200] = {[200] = 1}
    CC.PTF[201] = {[201] = 1}
    CC.PTF[202] = {[202] = 1}
    CC.PTF[203] = {[203] = 1}
    CC.PTF[204] = {[204] = 1}
    CC.PTF[205] = {[205] = 1}
    CC.PTF[206] = {[206] = 1}
    CC.PTF[207] = {[207] = 1}
    CC.PTF[208] = {[208] = 1}
    CC.PTF[209] = {[209] = 1}
    CC.PTF[210] = {[210] = 1}
    CC.PTF[211] = {[211] = 1}
    CC.PTF[212] = {[212] = 1}
    CC.PTF[213] = {[213] = 1}
    CC.PTF[214] = {[214] = 1}
    CC.PTF[215] = {[215] = 1}
    CC.PTF[216] = {[216] = 1}
    CC.PTF[217] = {[217] = 1}
    CC.PTF[218] = {[218] = 1}
    CC.PTF[219] = {[219] = 1}
    CC.PTF[220] = {[220] = 1}
    CC.PTF[221] = {[221] = 1}
    CC.PTF[222] = {[222] = 1}
    CC.PTF[223] = {[223] = 1}
    CC.PTF[224] = {[224] = 1}
    CC.PTF[225] = {[225] = 1}
    CC.PTF[226] = {[226] = 1}
    CC.PTF[227] = {[227] = 1}
    CC.PTF[228] = {[228] = 1}
    CC.PTF[229] = {[229] = 1}
    CC.PTF[230] = {[230] = 1}
    CC.PTF[231] = {[231] = 1}
    CC.PTF[232] = {[232] = 1}
    CC.PTF[233] = {[233] = 1}
    CC.PTF[234] = {[234] = 1}
    CC.PTF[235] = {[235] = 1}
    CC.PTF[236] = {[236] = 1}
    CC.PTF[237] = {[237] = 1}
    CC.PTF[238] = {[238] = 1}
    CC.PTF[239] = {[239] = 1}
    CC.PTF[240] = {[240] = 1}
    CC.PTF[241] = {[241] = 1}
    CC.PTF[242] = {[242] = 1}
    CC.PTF[243] = {[243] = 1}
    CC.PTF[244] = {[244] = 1}
    CC.PTF[245] = {[245] = 1}
    CC.PTF[246] = {[246] = 1}
    CC.PTF[247] = {[247] = 1}
    CC.PTF[248] = {[248] = 1}
    CC.PTF[249] = {[249] = 1}
    CC.PTF[250] = {[250] = 1}
    CC.PTF[251] = {[251] = 1}
    CC.PTF[252] = {[252] = 1}
    CC.PTF[253] = {[253] = 1}
    CC.PTF[254] = {[254] = 1}
    CC.PTF[255] = {[255] = 1}
    CC.PTF[256] = {[256] = 1}
    CC.PTF[257] = {[257] = 1}
    CC.PTF[258] = {[258] = 1}
    CC.PTF[259] = {[259] = 1}
    CC.PTF[260] = {[260] = 1}
    CC.PTF[261] = {[261] = 1}
    CC.PTF[262] = {[262] = 1}
    CC.PTF[263] = {[263] = 1}
    CC.PTF[264] = {[264] = 1}
    CC.PTF[265] = {[265] = 1}
    CC.PTF[266] = {[266] = 1}
    CC.PTF[267] = {[267] = 1}
    CC.PTF[268] = {[268] = 1}
    CC.PTF[269] = {[269] = 1}
    CC.PTF[270] = {[270] = 1}
    CC.PTF[271] = {[271] = 1}
    CC.PTF[272] = {[272] = 1}
    CC.PTF[273] = {[273] = 1}
    CC.PTF[274] = {[274] = 1}
    CC.PTF[275] = {[275] = 1}
    CC.PTF[276] = {[276] = 1}
    CC.PTF[277] = {[277] = 1}
    CC.PTF[278] = {[278] = 1}
    CC.PTF[279] = {[279] = 1}
    CC.PTF[280] = {[280] = 1}
    CC.PTF[281] = {[281] = 1}
    CC.PTF[282] = {[282] = 1}
    CC.PTF[283] = {[283] = 1}
    CC.PTF[284] = {[284] = 1}
    CC.PTF[285] = {[285] = 1}
    CC.PTF[286] = {[286] = 1}
    CC.PTF[287] = {[287] = 1}
    CC.PTF[288] = {[288] = 1}
    CC.PTF[289] = {[289] = 1}
    CC.PTF[290] = {[290] = 1}
    CC.PTF[291] = {[291] = 1}
    CC.PTF[292] = {[292] = 1}
    CC.PTF[293] = {[293] = 1}
    CC.PTF[294] = {[294] = 1}
    CC.PTF[295] = {[295] = 1}
    CC.PTF[296] = {[296] = 1}
    CC.PTF[297] = {[297] = 1}
    CC.PTF[298] = {[298] = 1}
    CC.PTF[299] = {[299] = 1}
    CC.PTF[300] = {[300] = 1}
    CC.PTF[301] = {[301] = 1}
    CC.PTF[302] = {[302] = 1}
    CC.PTF[303] = {[303] = 1}
    CC.PTF[304] = {[304] = 1}
    CC.PTF[305] = {[305] = 1}
    CC.PTF[306] = {[306] = 1}
    CC.PTF[307] = {[307] = 1}
    CC.PTF[308] = {[308] = 1}
    CC.PTF[309] = {[309] = 1}
    CC.PTF[310] = {[310] = 1}
    CC.PTF[311] = {[311] = 1}
    CC.PTF[312] = {[312] = 1}
    CC.PTF[313] = {[313] = 1,[9986] = 1,[9985] = 1}
    CC.PTF[314] = {[314] = 1}
    CC.PTF[315] = {[315] = 1}
    CC.PTF[316] = {[316] = 1}
    CC.PTF[317] = {[317] = 1}
    CC.PTF[318] = {[318] = 1}
    CC.PTF[319] = {[319] = 1}
    CC.PTF[320] = {[320] = 1}
    CC.PTF[321] = {[321] = 1}
    CC.PTF[322] = {[322] = 1}
    CC.PTF[323] = {[323] = 1}
    CC.PTF[324] = {[324] = 1}
    CC.PTF[325] = {[325] = 1}
    CC.PTF[326] = {[326] = 1}
    CC.PTF[327] = {[327] = 1}
    CC.PTF[328] = {[328] = 1}
    CC.PTF[329] = {[329] = 1}
    CC.PTF[330] = {[330] = 1}
    CC.PTF[331] = {[331] = 1}
    CC.PTF[332] = {[332] = 1}
    CC.PTF[333] = {[333] = 1}
    CC.PTF[334] = {[334] = 1}
    CC.PTF[335] = {[335] = 1}
    CC.PTF[336] = {[336] = 1}
    CC.PTF[337] = {[337] = 1}
    CC.PTF[338] = {[338] = 1}
    CC.PTF[339] = {[339] = 1}
    CC.PTF[340] = {[340] = 1}
    CC.PTF[341] = {[341] = 1}
    CC.PTF[342] = {[342] = 1}
    CC.PTF[343] = {[343] = 1}
    CC.PTF[344] = {[344] = 1}
    CC.PTF[345] = {[345] = 1}
    CC.PTF[346] = {[346] = 1}
    CC.PTF[347] = {[347] = 1}
    CC.PTF[348] = {[348] = 1}
    CC.PTF[349] = {[349] = 1}
    CC.PTF[350] = {[350] = 1}
    CC.PTF[351] = {[351] = 1}
    CC.PTF[352] = {[352] = 1}
    CC.PTF[353] = {[353] = 1}
    CC.PTF[354] = {[354] = 1}
    CC.PTF[355] = {[355] = 1}
    CC.PTF[356] = {[356] = 1}
    CC.PTF[357] = {[357] = 1}
    CC.PTF[358] = {[358] = 1}
    CC.PTF[359] = {[359] = 1}
    CC.PTF[360] = {[360] = 1}
    CC.PTF[361] = {[361] = 1}
    CC.PTF[362] = {[362] = 1}
    CC.PTF[363] = {[363] = 1}
    CC.PTF[364] = {[364] = 1}
    CC.PTF[365] = {[365] = 1}
    CC.PTF[366] = {[366] = 1}
    CC.PTF[367] = {[367] = 1}
    CC.PTF[368] = {[368] = 1}
    CC.PTF[369] = {[369] = 1}
    CC.PTF[370] = {[370] = 1}
    CC.PTF[371] = {[371] = 1}
    CC.PTF[372] = {[372] = 1}
    CC.PTF[373] = {[373] = 1}
    CC.PTF[374] = {[374] = 1}
    CC.PTF[375] = {[375] = 1}
    CC.PTF[376] = {[376] = 1}
    CC.PTF[377] = {[377] = 1}
    CC.PTF[378] = {[378] = 1}
    CC.PTF[379] = {[379] = 1}
    CC.PTF[380] = {[380] = 1}
    CC.PTF[381] = {[381] = 1}
    CC.PTF[382] = {[382] = 1}
    CC.PTF[383] = {[383] = 1}
    CC.PTF[384] = {[384] = 1}
    CC.PTF[385] = {[385] = 1}
    CC.PTF[386] = {[386] = 1}
    CC.PTF[387] = {[387] = 1}
    CC.PTF[388] = {[388] = 1}
    CC.PTF[389] = {[389] = 1}
    CC.PTF[390] = {[390] = 1}
    CC.PTF[391] = {[391] = 1}
    CC.PTF[392] = {[392] = 1}
    CC.PTF[393] = {[393] = 1}
    CC.PTF[394] = {[394] = 1}
    CC.PTF[395] = {[395] = 1}
    CC.PTF[396] = {[396] = 1}
    CC.PTF[397] = {[397] = 1}
    CC.PTF[398] = {[398] = 1}
    CC.PTF[399] = {[399] = 1}
    CC.PTF[400] = {[400] = 1}
    CC.PTF[401] = {[401] = 1}
    CC.PTF[402] = {[402] = 1}
    CC.PTF[403] = {[403] = 1}
    CC.PTF[404] = {[404] = 1}
    CC.PTF[405] = {[405] = 1}
    CC.PTF[406] = {[406] = 1}
    CC.PTF[407] = {[407] = 1}
    CC.PTF[408] = {[408] = 1}
    CC.PTF[409] = {[409] = 1}
    CC.PTF[410] = {[410] = 1}
    CC.PTF[411] = {[411] = 1}
    CC.PTF[412] = {[412] = 1}
    CC.PTF[413] = {[413] = 1}
    CC.PTF[414] = {[414] = 1}
    CC.PTF[415] = {[415] = 1}
    CC.PTF[416] = {[416] = 1}
    CC.PTF[417] = {[417] = 1}
    CC.PTF[418] = {[418] = 1}
    CC.PTF[419] = {[419] = 1}
    CC.PTF[420] = {[420] = 1}
    CC.PTF[421] = {[421] = 1}
    CC.PTF[422] = {[422] = 1}
    CC.PTF[423] = {[423] = 1}
    CC.PTF[424] = {[424] = 1}
    CC.PTF[425] = {[425] = 1}
    CC.PTF[426] = {[426] = 1}
    CC.PTF[427] = {[427] = 1}
    CC.PTF[428] = {[428] = 1}
    CC.PTF[429] = {[429] = 1}
    CC.PTF[430] = {[430] = 1}
    CC.PTF[431] = {[431] = 1}
    CC.PTF[432] = {[432] = 1}
    CC.PTF[433] = {[433] = 1}
    CC.PTF[434] = {[434] = 1}
    CC.PTF[435] = {[435] = 1}
    CC.PTF[436] = {[436] = 1}
    CC.PTF[437] = {[437] = 1}
    CC.PTF[438] = {[438] = 1}
    CC.PTF[439] = {[439] = 1}
    CC.PTF[440] = {[440] = 1}
    CC.PTF[441] = {[441] = 1}
    CC.PTF[442] = {[442] = 1}
    CC.PTF[443] = {[443] = 1}
    CC.PTF[444] = {[444] = 1}
    CC.PTF[445] = {[445] = 1}
    CC.PTF[446] = {[446] = 1}
    CC.PTF[447] = {[447] = 1}
    CC.PTF[448] = {[448] = 1}
    CC.PTF[449] = {[449] = 1}
    CC.PTF[450] = {[450] = 1}
    CC.PTF[451] = {[451] = 1}
    CC.PTF[452] = {[452] = 1}
    CC.PTF[453] = {[453] = 1}
    CC.PTF[454] = {[454] = 1}
    CC.PTF[455] = {[455] = 1}
    CC.PTF[456] = {[456] = 1,[9945] = 1,[9994] = 1}
    CC.PTF[457] = {[457] = 1}
    CC.PTF[458] = {[458] = 1}
    CC.PTF[459] = {[459] = 1}
    CC.PTF[460] = {[460] = 1}
    CC.PTF[461] = {[461] = 1,[9993] = 1}
    CC.PTF[462] = {[462] = 1,[9993] = 1}
    CC.PTF[463] = {[463] = 1,[9993] = 1}
    CC.PTF[464] = {[464] = 1,[9993] = 1}
    CC.PTF[465] = {[465] = 1,[9993] = 1}
    CC.PTF[466] = {[466] = 1,[9993] = 1}
    CC.PTF[467] = {[467] = 1,[9993] = 1}
    CC.PTF[468] = {[468] = 1,[9993] = 1}
    CC.PTF[469] = {[469] = 1,[9993] = 1}
    CC.PTF[470] = {[470] = 1,[9993] = 1}
    CC.PTF[471] = {[471] = 1,[9993] = 1}
    CC.PTF[472] = {[472] = 1,[9993] = 1}
    CC.PTF[473] = {[473] = 1,[9993] = 1}
    CC.PTF[474] = {[474] = 1,[9993] = 1}
    CC.PTF[475] = {[475] = 1,[9993] = 1}
    CC.PTF[476] = {[476] = 1,[9993] = 1}
    CC.PTF[477] = {[477] = 1,[9993] = 1}
    CC.PTF[478] = {[478] = 1,[9993] = 1}
    CC.PTF[479] = {[479] = 1,[9993] = 1}
    CC.PTF[480] = {[480] = 1,[9993] = 1}
    CC.PTF[481] = {[481] = 1,[9993] = 1}
    CC.PTF[482] = {[482] = 1,[9993] = 1}
    CC.PTF[483] = {[483] = 1,[9993] = 1}
    CC.PTF[484] = {[484] = 1,[9993] = 1}
    CC.PTF[485] = {[485] = 1,[9993] = 1}
    CC.PTF[486] = {[486] = 1,[9993] = 1}
    CC.PTF[487] = {[487] = 1,[9993] = 1}
    CC.PTF[488] = {[488] = 1,[9993] = 1}
    CC.PTF[489] = {[489] = 1,[9993] = 1}
    CC.PTF[490] = {[490] = 1,[9993] = 1}
    CC.PTF[491] = {[491] = 1,[9993] = 1}
    CC.PTF[492] = {[492] = 1,[9993] = 1}
    CC.PTF[493] = {[493] = 1,[9993] = 1}
    CC.PTF[494] = {[494] = 1,[9993] = 1}
    CC.PTF[495] = {[495] = 1,[9993] = 1}
    CC.PTF[496] = {[496] = 1,[9993] = 1}
    CC.PTF[497] = {[497] = 1}
    CC.PTF[498] = {[498] = 1}
    CC.PTF[499] = {[499] = 1}
    CC.PTF[500] = {[500] = 1,[9941] = 1}
    CC.PTF[501] = {[501] = 1}
    CC.PTF[502] = {[502] = 1}
    CC.PTF[503] = {[503] = 1}
    CC.PTF[504] = {[9934] = 1,[9976] = 1}
    CC.PTF[505] = {[505] = 1,[9979] = 1}
    CC.PTF[506] = {[506] = 1}
    CC.PTF[507] = {[507] = 1,[9969] = 1}
    CC.PTF[508] = {[508] = 1,[9969] = 1}
    CC.PTF[509] = {[509] = 1}
    CC.PTF[510] = {[510] = 1}
    CC.PTF[511] = {[511] = 1,[9967] = 1}
    CC.PTF[512] = {[512] = 1}
    CC.PTF[513] = {[513] = 1,[9961] = 1,[9962] = 1,[9963] = 1,[9964] = 1}
    CC.PTF[514] = {[514] = 1,[9739] = 1,[9738] = 1,[9948] = 1}
    CC.PTF[515] = {[515] = 1,[9737] = 1,[9736] = 1,[9735] = 1}
    CC.PTF[516] = {[516] = 1}
    CC.PTF[517] = {[517] = 1,[9991] = 1,[9949] = 1}
    CC.PTF[518] = {[518] = 1}
    CC.PTF[519] = {[519] = 1}
    CC.PTF[520] = {[520] = 1}
    CC.PTF[521] = {[521] = 1}
    CC.PTF[522] = {[522] = 1}
    CC.PTF[523] = {[523] = 1,[9796] = 1,[9738] = 1}
    CC.PTF[524] = {[524] = 1}
    CC.PTF[525] = {[525] = 1,[9950] = 1,[9951] = 1}
    CC.PTF[526] = {[526] = 1,[9941] = 1}
    CC.PTF[527] = {[527] = 1}
    CC.PTF[528] = {[528] = 1,[9796] = 1,[9738] = 1}
    CC.PTF[529] = {[529] = 1}
    CC.PTF[530] = {[530] = 1}
    CC.PTF[531] = {[531] = 1}
    CC.PTF[532] = {[532] = 1}
    CC.PTF[533] = {[533] = 1}
    CC.PTF[534] = {[534] = 1}
    CC.PTF[535] = {[535] = 1}
    CC.PTF[536] = {[536] = 1}
    CC.PTF[537] = {[537] = 1}
    CC.PTF[538] = {[538] = 1}
    CC.PTF[539] = {[539] = 1}
    CC.PTF[540] = {[540] = 1}
    CC.PTF[541] = {[541] = 1}
    CC.PTF[542] = {[542] = 1}
    CC.PTF[543] = {[543] = 1}
    CC.PTF[544] = {[544] = 1}
    CC.PTF[545] = {[545] = 1}
    CC.PTF[546] = {[546] = 1,[9949] = 1,[9948] = 1}
    CC.PTF[547] = {[547] = 1}
    CC.PTF[548] = {[548] = 1}
    CC.PTF[549] = {[549] = 1}
    CC.PTF[550] = {[550] = 1}
    CC.PTF[551] = {[551] = 1}
    CC.PTF[552] = {[552] = 1}
    CC.PTF[553] = {[553] = 1}
    CC.PTF[554] = {[554] = 1}
    CC.PTF[555] = {[555] = 1}
    CC.PTF[556] = {[556] = 1}
    CC.PTF[557] = {[557] = 1}
    CC.PTF[558] = {[558] = 1}
    CC.PTF[559] = {[559] = 1}
    CC.PTF[560] = {[560] = 1}
    CC.PTF[561] = {[561] = 1}
    CC.PTF[562] = {[562] = 1}
    CC.PTF[563] = {[563] = 1}
    CC.PTF[564] = {[564] = 1}
    CC.PTF[565] = {[565] = 1}
    CC.PTF[566] = {[566] = 1}
    CC.PTF[567] = {[567] = 1}
    CC.PTF[568] = {[568] = 1,[9968] = 1}
    CC.PTF[569] = {[569] = 1}
    CC.PTF[570] = {[570] = 1}
    CC.PTF[571] = {[571] = 1}
    CC.PTF[572] = {[572] = 1}
    CC.PTF[573] = {[573] = 1,[9998] = 1,[9999] = 1}
    CC.PTF[574] = {[574] = 1}
    CC.PTF[575] = {[575] = 1,[9997] = 1,[9996] = 1}
    CC.PTF[576] = {[576] = 1,[9928] = 1,[9994] = 1,[9993] = 1}
    CC.PTF[577] = {[577] = 1,[9983]=1,[9939]=1,[9940]=1}--
    CC.PTF[578] = {[578] = 1}
    CC.PTF[579] = {[579] = 1}
    CC.PTF[580] = {[580] = 1}
    CC.PTF[581] = {[581] = 1}
    CC.PTF[582] = {[582] = 1}
    CC.PTF[583] = {[583] = 1,[9998]=1}
    CC.PTF[584] = {[584] = 1}
    CC.PTF[585] = {[585] = 1}
    CC.PTF[586] = {[586] = 1}
    CC.PTF[587] = {[587] = 1}
    CC.PTF[588] = {[588] = 1}
    CC.PTF[589] = {[589] = 1}
    CC.PTF[590] = {[590] = 1}
    CC.PTF[591] = {[591] = 1}
    CC.PTF[592] = {[592] = 1}
    CC.PTF[593] = {[593] = 1}
    CC.PTF[594] = {[594] = 1}
    CC.PTF[595] = {[595] = 1}
    CC.PTF[596] = {[596] = 1}
    CC.PTF[597] = {[597] = 1}
    CC.PTF[598] = {[598] = 1}
    CC.PTF[599] = {[599] = 1}
    CC.PTF[600] = {[600] = 1}
    CC.PTF[601] = {[601] = 1}
    CC.PTF[602] = {[602] = 1}
    CC.PTF[603] = {[603] = 1}
    CC.PTF[604] = {[604] = 1,[9942] = 1}
    CC.PTF[605] = {[605] = 1}
    CC.PTF[606] = {[606] = 1}
    CC.PTF[607] = {[607] = 1}
    CC.PTF[608] = {[608] = 1}
    CC.PTF[609] = {[609] = 1}
    CC.PTF[610] = {[610] = 1,[9944] = 1,[9943] = 1,[9942] = 1}
    CC.PTF[611] = {[611] = 1}
    CC.PTF[612] = {[612] = 1}
    CC.PTF[613] = {[613] = 1}
    CC.PTF[614] = {[614] = 1,[9984] = 1}
    CC.PTF[615] = {[615] = 1}
    CC.PTF[616] = {[616] = 1}
    CC.PTF[617] = {[617] = 1}
    CC.PTF[618] = {[618] = 1}
    CC.PTF[619] = {[619] = 1}
    CC.PTF[620] = {[620] = 1}
    CC.PTF[621] = {[621] = 1}
    CC.PTF[622] = {[622] = 1}
    CC.PTF[623] = {[623] = 1}
    CC.PTF[624] = {[624] = 1}
    CC.PTF[625] = {[625] = 1}
    CC.PTF[626] = {[626] = 1}
    CC.PTF[627] = {[627] = 1}
    CC.PTF[628] = {[628] = 1}
    CC.PTF[629] = {[629] = 1}
    CC.PTF[630] = {[630] = 1}
    CC.PTF[631] = {[631] = 1}
    CC.PTF[632] = {[632] = 1}
    CC.PTF[633] = {[633] = 1}
    CC.PTF[634] = {[634] = 1}
    CC.PTF[635] = {[635] = 1}
    CC.PTF[636] = {[636] = 1}
    CC.PTF[637] = {[637] = 1}
    CC.PTF[638] = {[638] = 1,[9966] = 1}
    CC.PTF[639] = {[639] = 1}
    CC.PTF[640] = {[640] = 1}
    CC.PTF[641] = {[641] = 1,[9992] = 1,[9991] = 1,[9990] = 1}
    CC.PTF[642] = {[642] = 1}
    CC.PTF[643] = {[643] = 1}
    CC.PTF[644] = {[644] = 1}
    CC.PTF[645] = {[645] = 1}
    CC.PTF[646] = {[646] = 1}
    CC.PTF[647] = {[647] = 1}
    CC.PTF[648] = {[648] = 1}
    CC.PTF[649] = {[649] = 1}
    CC.PTF[650] = {[650] = 1}
    CC.PTF[651] = {[651] = 1}
    CC.PTF[652] = {[652] = 1}
    CC.PTF[653] = {[653] = 1}
    CC.PTF[654] = {[654] = 1}
    CC.PTF[655] = {[655] = 1}
    CC.PTF[656] = {[656] = 1}
    CC.PTF[657] = {[657] = 1,[9984] = 1,[9894] = 1}
    CC.PTF[658] = {[658] = 1,[9987] = 1,[9988] = 1}
    CC.PTF[659] = {[659] = 1}
    CC.PTF[660] = {[660] = 1}
    CC.PTF[661] = {[661] = 1}
    CC.PTF[670] = {[670] = 1,[9974] = 1,[9982] = 1}
	CC.PTF[683] = {[9929] = 1}
	CC.PTF[709] = {[709] = 1}
    CC.PTF[721] = {[721] = 1,[9965] = 1}
    CC.PTF[722] = {[722] = 1,[9922] = 1}
    CC.PTF[723] = {[723] = 1}
    CC.PTF[724] = {[724] = 1}
    CC.PTF[725] = {[725] = 1}
    CC.PTF[726] = {[726] = 1}
	CC.PTF[738] = {[738] = 1}
	CC.PTF[743] = {[743] = 1}
	CC.PTF[744] = {[744] = 1,[9944] = 1,[9894] = 1,[9986] = 1}
	CC.PTF[745] = {[745] = 1,[9987] = 1,[9894] = 1,[9738] = 1,[9740] = 1}
	CC.PTF[747] = {[747] = 1}
	CC.PTF[748] = {[748] = 1}
	CC.PTF[749] = {[749] = 1}
	CC.PTF[750] = {[750] = 1}
	CC.PTF[751] = {[751] = 1}
	CC.PTF[752] = {[752] = 1}
	CC.PTF[753] = {[753] = 1}
	CC.PTF[754] = {[754] = 1,[9868] = 1,[9867] = 1}
	CC.PTF[758] = {[758] = 1}
	CC.PTF[759] = {[759] = 1,[9931] = 1}
	CC.PTF[760] = {[760] = 1,[9832] = 1}
	CC.PTF[761] = {[761] = 1}
	CC.PTF[762] = {[762] = 1}
	CC.PTF[763] = {[763] = 1}
	CC.PTF[764] = {[764] = 1}
	CC.PTF[765] = {[765] = 1}
	CC.PTF[766] = {[766] = 1}
	CC.PTF[767] = {[767] = 1}
	CC.PTF[768] = {[768] = 1}
	CC.PTF[769] = {[769] = 1}
	CC.PTF[770] = {[770] = 1}
	CC.PTF[771] = {[771] = 1}
	CC.PTF[772] = {[772] = 1}
	CC.PTF[773] = {[773] = 1,[9967] = 1}
	CC.PTF[774] = {[774] = 1}
	CC.PTF[775] = {[775] = 1}
	CC.PTF[776] = {[776] = 1}
	CC.PTF[778] = {[778] = 1}
	CC.PTF[779] = {[779] = 1}
	CC.PTF[780] = {[780] = 1}
	--特效开启判定
	CC.TXM = {	'逆转乾坤',
				'迷踪步',
				'四神阵',
				'诛仙剑阵',
				'天关',	
				'杨过剑魔',
				'笑傲邪线',
				'胡苗战5',
				'龙门血案',
				'购买天赋',
				'天刀九问',
				'夜雨暗杀1',
				'夜雨暗杀2',
				'夜雨暗杀3',
				'雪羽灭宗战',
				'邪线判定',
				'死葬者身份',
				'少林掌院选择',
				'雪羽线轻功',
				'夜雨楼开启',
				--'六脉六',

} 

	--特效开启判定
	CC.TX = {['逆转乾坤'] = 0,
				['迷踪步'] = 0,
				['四神阵'] = 0,
				['诛仙剑阵'] = 0,
				['天关'] = 0,
				['杨过剑魔'] = 0,
				['笑傲邪线'] = 0,
				['胡苗战5'] = 0,
				['龙门血案'] = 0,
				['购买天赋'] = 0,
				['天刀九问'] = 0,
				['夜雨暗杀1'] = 0,
				['夜雨暗杀2'] = 0,
				['夜雨暗杀3'] = 0,
				['雪羽灭宗战'] = 0,
				['邪线判定'] = 0,
				['死葬者身份'] = 0,
				['少林掌院选择'] = 0, --1金刚殿 2罗汉堂 3达摩院
				['雪羽线轻功'] = 0,--'六脉六',
				['夜雨楼开启'] = 0,--'六脉六',
				--['六脉五'] = 0,
				--['六脉六'] = 0,
} 

	--天关
	CC.TG = {}
	
	--天关奖励
    CC.TGJL = {}
    
	CC.commodity = {
		{343,600,0,'可重新选择天赋內功',0},
		{344,600,0,'可重新选择天赋轻功',0},
		{345,600,0,'可重新选择天赋外功',0},
		{346,500,0,'可使用四大山战斗模型',0},
		{281,600,0,'可在小村商人处换银子',0},
    }
	
	local pic = {"1000.png","1001.png","1002.png"}
	
	CC.FirstFile=CONFIG.PicturePath..pic[math.random(3)];
   -- require("MP");
end

