--旧飞雪部分代码
newkdef[1130]=function()
	dark()
	instruct_17(-2,3,23,27,4922*2)
	light()
	--instruct_40(3)
	say("医生，胡大哥有事托你帮手。",0,1)
	Cls()
	say("但请吩咐。",4,0)
	Cls()
	say("明日一早，有人送信来。相烦你跟随他前去，送我的回信给金面佛苗大侠，就是你见过来喝酒的那位黄脸大爷。",0,1)
	Cls()
	say("定不负所托。",4,0)
	Cls()
	say("Ｄ＜沉吟片刻＞Ｂ我还是陪你走一遭。",0,1)
	Cls()
	say("那敢情好。",4,0)
	Cls()
	null(-2,37)
	dark()
	null(-2,35)
	addevent(-2,41,1,nil,nil,8896)
	light()
	Cls()
	addevent(-2,38,0,1132,3,nil)
	addevent(-2,39,0,1132,3,nil)	
	do return end
end	

newkdef[1131]=function()
	say("去见过苗人凤了吗？",633,0)
	Cls()
	do return end
end	


--袁紫衣线
newkdef[1200]=function()
--商家堡
if instruct_18(306) then
	dark()
	null(-2,0)
	addevent(-2,25,1,nil,nil,4952*2)
	addevent(-2,26,1,nil,nil,4831*2)
	light()
	say("苗人凤，命门、陶道！。胡一刀，大椎、阳关！",737,0)
	Cls()
	say("Ｄ＜“咦”的一声，定睛一看，只见木牌上原来写着的“胡一刀”个黑字已然不见。他招叫那持牌家丁过来，待那木牌拿近，看清楚“胡一刀”字已被人用利器刮去，却用刀尖刻了歪歪斜斜的“商剑鸣”个字，这一来适才这两镖不是打了仇人，却是打了自己父亲。。＞",739,0)
	Cls()
	say("且住！",737,0)
	Cls()
	dark()
	addevent(-2,27,1,nil,nil,5144*2)
	light()
	say("不敢去找真人动，却将人家的名字写在牌上出气，这才是卑鄙行径，鬼祟勾当！",1,1)
	Cls()
	say("阿斐，是你。",737,0)
	Cls()
	say("Ｄ＜点头道＞Ｂ不错，是我干的。",1,1)
	Cls()
	say("你这么干，为了什么？",737,0)
	Cls()
	say("我瞧不过眼！是英雄好汉，就不该如此。",1,1)
	Cls()	
	say("Ｄ＜点头＞Ｂ你说得很对，好孩子，你很有骨气，你过来，让我好好地瞧瞧你。Ｄ＜说着缓缓伸出去。胡斐倒不料她竟会不怒，便走近身去。商老太轻轻握住他双手低声道＞Ｂ好孩子，真是好孩子！Ｄ＜突然间双一翻，一扣住他左腕“会宗穴”，一扣住他右腕“外关穴”。＞Ｂ",737,0)
	Cls()
	say("小心！",0,1)
	Cls()
	instruct_19(27,18)
	if WarMain(378) == false then
		instruct_15()
		Cls()
		do return end
	end
	say("小贼，是奸贼胡一刀派你来的是不是？",737,0)
	Cls()
	say("我是大侠胡一刀的儿子胡斐便是。Ｄ＜说罢纵声长笑＞",1,1)
	Cls()
	say("Ｄ＜原来他就是当年那个孩子都这么大了。＞Ｂ跟我走，此地不宜久留！",737,0)
	Cls()
	dark()
	null(-2,27)
	addevent(-2,5,1,nil,nil,2583*2)
    instruct_19(36,20)
	instruct_40(0)
	light()
	say("平四叔还在商家堡，我不能走。",1,0)
	Cls()
	say("我们晚上再来。",0,1)
	Cls()
	say("你是什么人？我如何信你？",1,0)
	Cls()
	say("我认识你爹爹胡一刀大侠和你娘胡夫人。",0,1)
	Cls()
	say("平四叔说我爹爹死在苗人凤的刀下，我要练好武功找他报仇。",1,0)
	Cls()
	say("此事中原委以后我再跟你细述，你先跟我走,我不会害你。",0,1)
	Cls()
	say("那好吧，一定要救平四叔出来。",1,0)
	Cls()	
	null(-2,3)	
	addevent(-2,3,0,1201,3,nil)			
	if instruct_20() then  --判断队伍是否已满
		Cls()  --清屏
		say("你的队伍已满，我就直接去小村吧。", 1, 0)  --对话
		Cls()  --清屏
		dark()
		null(-2,5)
		null(-2,28)
		null(-2,25)
		null(-2,26)
		addevent(-2,0,1141,1,9662)
		addevent(-2,1,1141,1,4953*2)
		light()
		instruct_3(0, -2,0,0,0,0,0,0,0,0,0,-2,-2)  --修改场景事件
		instruct_3(70, 5,1,0,101,0,0,5166,5166,5166,-2,-2,-2)  --修改场景事件
		Cls()  --清屏
		do return end  --无条件结束事件	
	end
	dark()
	null(-2,5)
	null(-2,28)
	null(-2,25)
	null(-2,26)
	addevent(-2,0,1,1141,1,9662)
	addevent(-2,1,1141,1,4953*2)
	light()
	instruct_10(1)  --加入队伍
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(0, -2,0,0,0,0,0,0,0,0,0,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	Cls()  --清屏
	do return end  --无条件结束事件
end
do return end  --无条件结束事件	
end

newkdef[1201]=function()
	if instruct_16(1) then
		instruct_30(25,23,21,23)
		dark()
		addevent(-2,9,1,nil,nil,5144*2)
		addevent(-2,11,1,nil,nil,4949*2)
		addevent(-2,12,1,nil,nil,4947*2)
		light()
		say("好啊，小贼你还敢回来！师伯，师叔，就是这个小贼的爹害了我爹爹的性命。",739,0)
		Cls()
		say("Ｄ＜无视商宝震，问商老太太＞Ｂ我平四叔在哪？。",1,1)
		Cls()		
		say("你爹爹胡一刀怎么不来？",737,0)
		Cls()		
		say("我爹爹早已过世。你要报仇，就找我吧。",1,1)
		Cls()		
		say("Ｄ＜面如死灰＞Ｂ此话当真？",737,0)
		Cls()		
		say("我爹爹若是在世，你敢打我一鞭么？",1,1)
		Cls()			
		say("Ｄ＜胡一刀，胡一刀，你死得好早啊！你不该这么早就死啊！＞Ｂ胡一刀，胡一刀，你死得好早啊！你不该这么早就死啊！",737,0)
		Cls()
		say("Ｄ＜怎么这老太婆忽起好心，哭起我爹爹来？＞Ｂ",1,1)
		Cls()
		say("商家嫂子，是这小子的爹害了我商师兄的性命？待我擒来给你出气。",740,0)
		Cls()
		say("大人欺负小孩，算什么事？",0,1)
		Cls()
		say("我帮手要来啦，不再怕你们这许多大人齐心合力欺侮我一个孩子。",1,1)
		Cls()
		if WarMain(380) ==  false then
			instruct_15()
			Cls()
			do return end
		end
		--赵半山现在坐标13
		dark()
		addevent(-2,13,1,nil,nil,4877*2)
		light()
		say("恭喜发财。",153,1)
		Cls()
		say("Ｄ＜抱拳说道＞Ｂ尊驾高姓大名？暮夜光临，有何见教？",741,0)
		Cls()		
		say("Ｄ＜抱拳还礼＞Ｂ不敢，兄弟姓赵。",153,1)
		Cls()	
		say("Ｄ＜猛地省起，说道＞Ｂ啊，原来是红花会赵爷光临，真得恕小弟眼拙。赵爷是一人前来山东，还是红花会众位英雄一齐出山了？先父生前常提及红花会众位英雄，好生记挂。",741,0)
		Cls()			
		say("是小弟一人有点私事，来到山东。请问令尊是……",153,1)
		Cls()
		say("先父是镇远镖局……",741,0)
		Cls()		
		say("啊，原来是王老镖头的贤郎，怎么老镖头仙游了啦？",153,1)
		Cls()
		say("先父已去世五年了。这是舍弟剑杰。Ｄ＜转头向王剑杰＞Ｂ赵爷太极拳、太极剑、暗器功夫，绝天下无双，今日真是幸会。",741,0)
		Cls()
		say("这地方原来是王家的宅子，叨扰了。",153,1)
		Cls()
		say("这是我师弟家，我兄弟二人也是路过，Ｄ＜回头一望不见了商老太太跟商宝震＞Ｂ咦，刚才女主人还在。",741,0)
		Cls()
		--放火
		dark()
		null(-2,0)
		null(-2,1)
		addevent(-2,3,1,nil,nil,1843*2)
		for i = 2159,2161 do
			addevent(-2,20,1,nil,nil,i*2)
			addevent(-2,19,1,nil,nil,i*2)
			addevent(-2,21,1,nil,nil,i*2)
		end	
		addevent(-2,17,1,nil,nil,4955*2)
		addevent(-2,16,1,nil,nil,4830*2)
		Cls()
		light()
		--商家母子出现在门外
		say("哈哈，这里面没一个是好人。姓胡的小杂种，厅上好风凉吧？再过半个时辰，你们人人都化成焦炭。",737,0)
		Cls()
		say("商家弟妹，你放我们出来，我兄弟为你取那姓胡的小杂种性命。赵爷，商老太的对头只有这孩子一人。冤有头，债有主！大伙儿犯不着一齐陪一个孩子做鬼。各位说冤是不冤？赵爷，不是兄弟不顾义气，倘是你赵爷……",741,0)
		Cls()
		say("Ｄ＜厉声喝道＞Ｂ你们有六个，我们只有两人。咱们倒先瞧瞧，是姓赵姓胡的先死呢，还是你们姓王姓殷的先死。",153,1)
		Cls()
		say("赵爷，兄弟今日要得罪了",741,0)
		Cls()
		say("大家且莫动。这里一定有机关，设置机关的人不可能不妨自己被困这铁屋里。",1,1)
		Cls()
		say("小兄弟说的是。大伙四处找找机关。",153,1)
		Cls()
		dark()
		null(-2,9)
		Cls()
		light()
		addevent(-2,22,1,1202,1,nil)	
		do return end
	end
end		
	
newkdef[1202]=function()
	PlayWavE(78)
	null(-2,15)
	say("有机关响关..",1,1)
	Cls()
	addevent(-2,15,0,1203,3,nil)
	do return end
end	

newkdef[1203]=function()
	instruct_30(21,15,21,13)
	instruct_30(21,13,27,13)
	instruct_30(27,13,27,22)
	say("你……小杂种，这都烧不死你。纳命来",737,0)
	Cls()
	if WarMain(381) == false then
		instruct_15()
		Cls()
		do return end		
	end
	--商夫人被火烧死
	--赵半山出现在事件23 平阿四出现在24
	dark()
	null(-2,16)
	null(-2,17)
	null(-2,19)
	null(-2,20)
	null(-2,21)
	null(-2,13)
	addevent(-2,24,1,nil,nil,4877*2)
	addevent(-2,23,1,nil,nil,4956*2)
	addevent(-2,17,1,nil,nil,5143*2)
	null(-2,11)
	null(-2,12)
	Cls()
	light()
	say("小兄弟，今天的事很惨，是不是？商老太的性子，唉！",153,1)
	Cls()
	say("赵伯伯……",1,1)
	Cls()
	say("小兄弟，你我今日萍水相逢，意气相投，虽然我年纪大了几岁，但我见你侠义仁厚，实是相敬。他日你必名扬天下，我何敢以长辈自居？我与你结义为异姓兄弟，可好？",153,1)
	Cls()
	say("Ｄ＜胡斐听了此言，不由得感激不胜，两道泪水从眼流下，扑翻身躯，纳头便拜＞Ｂ赵……赵……",1,1)
	Cls()
	say("贤弟，从今后你叫我哥便了.我看你内功颇有根基，咱们兄弟二人互相佐证，希望兄弟你来日做个象你爹一样的大侠。",153,1)
	Cls()
	say("小弟定不负大哥所望。",1,1)
	Cls()
	say("贤弟，我们就此别过，来日江湖再见。",153,1)
	Cls()
	say("平四叔，我要去游历江湖，这里有一些银子，你拿着找个地方先安顿下来。",1,1)
	Cls()	
	say("阿斐长大了……",132,0,"平阿四")
	Cls()
	--胡斐洗武功
	dark()
	addevent(-2,1,1,1209,1,4953*2)
	null(-2,3)
	addevent(-2,15,1,nil,nil,3688)
	null(-2,23)
	null(-2,24)
	null(-2,17)
	addevent(158,12,0,1205,3,nil)
	light()	
	do return end
end
newkdef[1204]=function()	
	say("佛山镇上的大财主凤天南，有一个绰号，叫作南霸天。哎，可怜了钟四嫂一家子了惹上了这个南霸天，好好的孩子就没了。",618,0,"酒客甲")
	Cls()
	say("可不是？死的真惨啊，连官府都不敢管。",902,0,"酒客乙")
	Cls()
	do return end
end
newkdef[1205]=function()
	if instruct_16(1) then
		instruct_30(38,32,40,32)
		instruct_30(40,32,40,35)
		dark()
		--instruct_19(2,3)
		addevent(158,19,1,nil,nil,5145*2)
		light()
		say("客官吃点什么。", 220, 0,"店小二")  --对话
		Cls()  --清屏
		say("来一壶好酒，一斤牛肉", 1, 1)  --对话
		Cls()  --清屏
		say("好呢，客官您请稍等。", 220, 0,"店小二")  --对话
		Cls()  --清屏
		dark()
		Cls()
		light()
		instruct_25(40,36,43,33)		
		say("凤老爷这件事，做得也太急躁了些，活生生逼死一条人命，只怕将来要遭报应。",618,0,"酒客甲")
		Cls()
		say("Ｄ＜听到“活生生逼死一条人命”这九个字，心一凛＞Ｂ", 1, 1)  --对话
		Cls()  --清屏		
		say("那也不能说是凤老爷的过错，家里不见了东西，问一声也是十分平常。谁叫这女人失心疯了，竟把自己的亲生儿子剖开了肚子。",902,0,"酒客乙")
		Cls()
		dark()
		null(-2,19)
		addevent(158,4,1,nil,nil,5146*2)
		light()
		say("两位老板，自在广州一别，已有数年不见了，两位好啊？",1,1)
		Cls()  --清屏
		say("你好，你好。",618,0,"酒客甲")
			Cls()  --清屏
		say("适才听两位言道，什么活生生的逼死了一条人命，倒要请教。Ｄ＜低声道＞Ｂ我本是个杀人不眨眼的大盗，现下改邪归正，学做生意，要一万两银子办货，可是短了本钱，只得向二位各借五千两。",1, 1)  --对话
		Cls()  --清屏
		say("我来说，我来说。小爷，这件事我说便说了，可不能让人知道是我说的。",618,0,"酒客甲")
		Cls()  --清屏
		say("你不说也罢，那就让他说。",1, 1)  --对话
		Cls()  --清屏
		say("我说，我说。小爷，这位凤老爷名字叫作凤天南，乃是佛山镇上的大财主，有一个绰号，叫作……",618,0,"酒客甲")
		Cls()  --清屏
		say("叫作南霸天",902,0,"酒客乙")
		Cls()	
		say("又不是说相声，你插口干么？",1, 1)  --对话
		Cls()  --清屏	
		say("凤老爷在佛山镇上开了一家大典当，叫作英雄当铺；一家酒楼，便是这家英雄楼；又有一家大赌场，叫作英雄会馆。他财雄势大，交游广阔，武艺算得全广东第一。镇上的人私下里还说，每个月有人从粤东、粤西、粤北处送银子来孝敬他，听说他是什么五虎派的掌门人，凡是五虎派的弟兄们在各处发财，便得抽个份儿给他。这些江湖上的事，小的也弄不明白。",618,0,"酒客甲")
		Cls()  --清屏
		say("是了，他是大财主，又是坐地分赃的大强盗。Ｄ＜二人向他望了一眼，心想：“那你与他是同行哪。”胡斐早已明白他们的心意，笑道＞Ｂ常言道同行是冤家。我跟这位凤老爷不是朋友。你们有好说好，有歹说歹，不必隐瞒。",1, 1)  --对话
		Cls()  --清屏
		say("这凤老爷的宅子一连五进，本来已够大啦，可是他新近娶了一房姨太，又要在后进旁边起一座什么凤楼，给这位新姨太太住。他看的地皮，便是锺四嫂家传的菜园。这块地只有两亩几分，但锺阿四种菜为生，一家五口全靠着这菜园子吃饭。凤老爷把锺阿四叫去，说给五两银子买他的地。锺阿四自然不肯。凤老爷加到十两。锺阿四还是不肯，说道便是一百两银子，也吃得完，可是在这菜园子扒扒土、浇浇水，只要力气花上去，一家几口便饿不死了。凤老爷恼了，将他赶了出来，昨天便起了这偷鹅的事儿。“原来凤老爷后院养了十只肥鹅，昨天忽然不见了一只。家丁说是锺家的小二子、小子俩偷了，寻到他菜园子里，果然见菜地里有许多鹅毛。锺四嫂叫起屈来，说她两个儿子向来规矩，决不会偷人家的东西，这鹅毛准是旁人丢在菜园子里的。家丁们找小二小去问，两个都说没偷。凤老爷问道：‘今儿早晨你们吃了什么？’小子道：‘吃我，吃我。’凤老爷拍桌大骂，说：‘小子自己都招了，还说没偷？’于是叫人到巡检衙门去告了一状，差役便来将锺阿四锁了去。“锺四嫂知道自己家里虽穷，两个儿子却乖，平时一家又很惧怕凤家，决不会去偷他们的鹅吃，便到凤家去理论，却给凤老爷的家丁踢了出来。她赶到巡检衙门去叫冤，也给差役轰出。巡检老爷受了凤老爷的嘱托，又是板子，又是夹棍，早已将锺阿四整治得奄奄一息。锺四嫂去探监，见丈夫满身血肉模糊，话也说不出了，只是胡里胡涂地叫道：‘不卖地，不卖地！没有偷，没有偷。’锺四嫂心里一急，便横了心。她赶回家里，一拖了小子，一拿了柄菜刀，叫了左右乡邻，一齐上祖庙去。乡邻们只道她要在神前发誓，便同去作个见证。小人和她住得近，也跟去瞧瞧热闹。“锺四嫂在北帝爷爷座前磕了几个响头，说道：‘北帝爷爷，我孩子决不能偷人家的鹅。他今年还只四岁，刁嘴拗舌，说不清楚，在财主爷面前说什么吃我，吃我！小妇人一家横遭不白，赃官受了贿，断事不明，只有请北帝爷爷伸冤！’说着提起刀来，一刀便将小子的肚子剖了。",618,0,"酒客甲")
		Cls()  --清屏
		say("Ｄ＜胡斐一路听下来，早已目眦欲裂，听到此处，不禁大叫一声，霍地站起，砰的一掌，打得桌上碗盏跃起，汤汁飞溅，叫道＞Ｂ竟有此事？",1, 1)  --对话
		Cls()  --清屏
		say("Ｄ＜胖瘦二商人见他神威凛凛，一齐颤声道＞Ｂ此事千真万确！",902,0,"酒客乙")
		Cls()
		say("快说下去！快说，小子肚可有鹅肉？",1, 1)  --对话
		Cls()  --清屏
		say("没有鹅肉，没有鹅肉。他肚腹之，全是一颗颗螺肉。原来锺家家贫寒，没什么东西裹腹，小二小哥儿俩就到田里摸田螺吃。螺肉很硬，小子咬不烂，一颗颗都囫囵的吞了下去，因此隔了大半天还没化。他说：‘吃我，吃我！’却是说的‘吃螺！’唉，好好一个孩子，便这么死在祖庙之。锺四嫂也就此疯了",618,0,"酒客甲")
		Cls()
		say("这姓凤的住在哪里？",1, 1)  --对话
		Cls()  --清屏
		say("Ｄ＜忽听得远处隐隐传来一阵犬吠之声＞Ｂ作孽，作孽！",902,0,"酒客乙")
		Cls()
		say("还有什么事？",1, 1)  --对话
		Cls()  --清屏
		say("这会估计那是凤老爷的家丁带了恶狗，正在追拿锺家的小二子。",902,0,"酒客乙")
		Cls()
		say("冤枉已然辨明，还拿人干什么？",1, 1)  --对话
		Cls()  --清屏
		say("凤老爷言道：小子既然没吃，定是小二子吃了，因此要拿他去追问。邻居知道凤老爷恼羞成怒，非把这件冤枉套在小二子头上不可，暗暗叫小二子逃走。今日凤老爷的家丁已到处搜拿了半天呢。",902,0,"酒客乙")
		Cls()
		say("Ｄ＜此时胡斐反而抑住怒气，笑道＞Ｂ好好，两位说得明白，这一万两银子我便向凤老爷借去。",1, 1)  --对话
		Cls()  --清屏
		dark()
		instruct_19(42,34)
		null(-2,4)
		addevent(-2,4,1,1204,1,10084)
		addevent(-2,22,0,1208,3,nil)
		addevent(-2,23,0,1208,3,nil)
		addevent(-2,13,1,1206,1,9834)
		addevent(-2,21,1,1206,1,nil)
		light()
		null(-2,12)
	end																											
	do return end
end	

newkdef[1206]=function()	
	say("五虎派私地，外人勿入。",1053,0,"五虎派弟子")
	Cls()
	if instruct_5() == false then  --是否与之过招
		Cls()  --清屏
		say("打扰了。",0,1)
		Cls()
		do return end  --无条件结束事件
	end
	if WarMain(8, 1) == false then  --战斗开始
		instruct_15()
		Cls()	
		do return end
	end
	say("大胆贼子，我爹是凤天南。",1053,0,"凤一鸣")
	Cls()  --清屏
	say("找的就是你，Ｄ＜伸手扣住凤一鸣脉门，凤一鸣顿时如阉了的公鸡混身无力。＞",1, 1)  --对话
	Cls()  --清屏
	null(-2,13)	
	null(-2,21)	
	null(-2,22)
	null(-2,23)
	addevent(-2,22,0,1207,3,nil)
	addevent(-2,23,0,1207,3,nil)
	instruct_37(1)
	do return end
end

newkdef[1207]=function()		
	say("什么人？",748,0)
	dark()
	instruct_19(5,6)
	stands()
	addevent(-2,32,1,nil,nil,5144*2)
	addevent(-2,33,1,nil,nil,4735*2)
	light()	
	say("阁下是哪一位老师的门下？凤某什么地方得罪了阁下，犬子有什么做错了，却要请教。",748, 0)  --对话
	Cls()  --清屏
	say("我一块凤凰肉给你儿子偷吃了，非剖开他肚子瞧个明白不可。",1, 1)  --对话
	Cls()  --清屏
	say("在下素来爱交朋友，与尊驾素不相识，何苦为一个穷家小子伤了江湖义气？是友是敌，但凭尊驾一言而决。",748, 1)  --对话
	Cls()  --清屏
	say("是啊，你的话再对也没有，你只须割一块凤凰肉赔我，我立即拍拍灰尘走路，你看可好？",1, 1)  --对话
	Cls()  --清屏
	say("既是如此，咱们兵刃上分高下便了。",748, 1)  --对话
	Cls()  --清屏
	say("老爷行不改姓，坐不改名，大名鼎鼎‘杀官殴吏拔凤毛’便是。凤毛拔不到，臭鸡臭鸭的屁股毛拔几根也是好的。大家瞧清楚了。",748, 1)  --对话
	Cls()  --清屏
	if WarMain(383) == false then
		instruct_15()
		Cls()	
		do return end
	end
	dark()
	addevent(-2,25,1,nil,nil,4942*2)
	addevent(-2,26,1,nil,nil,4928*2)
	addevent(-2,27,1,nil,nil,4944*2)
	light()
	say("凤老爷，北帝爷爷在上，你凭良心说一句，我家小子有没偷你的鹅吃？",132, 1,"钟阿四")  --对话
	Cls()  --清屏
	say("没有。是……是我弄错了。",748, 0)  --对话
	Cls()  --清屏
	say("凤老爷，你再凭良心说，你叫官府打我关我，逼死我的儿子，全是为了要占我的菜园，是不是？",132, 1,"钟阿四")  --对话
	Cls()  --清屏
	say("Ｄ＜凤天南向他脸上望了一眼，只见这个平时忠厚老实的菜农，咬紧牙关，目喷怒火，神情极是可怕，不由得低下了头，不敢回答。＞Ｂ",748, 0)  --对话
	Cls()  --清屏
	say("Ｄ＜凤天南抬起头来＞Ｂ不错，杀人偿命，你杀我便了。？",748, 0)  --对话
	Cls()  --清屏
	dark()
	addevent(-2,28,1,nil,nil,4932*2)
	null(-2,32)
	light()
	instruct_25(5,6,15,10)
	say("自称拔凤毛的小贼，你敢不敢出来斗百回合？你在北帝庙缩头缩颈，干么不敢出来啊？Ｄ＜这几句话极是响亮，屋里人人相顾愕然，听那声音粗鲁重浊，满是无赖地痞的口气。＞Ｂ缩头乌龟，料你也不敢和老子动手。",587, 0)  --对话
	Cls()
	say("Ｄ＜胡斐大怒＞Ｂ谁怕谁!",1, 1)  --对话
	Cls()  --清屏
	dark()
	addevent(-2,29,1,nil,nil,5144*2)
	light()
	say("Ｄ＜胡斐大怒＞Ｂ谁怕谁!",1, 1)  --对话
	instruct_21(1)
	Cls()  --清屏
	say("Ｄ＜这地方太小了，跟我来。＞Ｂ。",587, 0)  --对话
	Cls()
	dark()
	addevent(-2,30,1,1211,1,5144*2)
	addevent(-2,31,1,1211,1,4932*2)
	addevent(-2,34,1,1211,1,4793*2)
	null(-2,29)
	null(-2,28)
	light()
	say("Ｄ＜他不会出了什么事吧，我跟去看看。＞Ｂ。",0, 1)  --对话
	Cls()
	instruct_19(15,6)
	instruct_40(1)
	null(-2,22)
	null(-2,23)
	
	addevent(-2,22,0,1208,3,nil)
	addevent(-2,23,0,1208,3,nil)
	instruct_37(2)
	do return end
end

newkdef[1208]=function()
	say("Ｄ＜还是先看看胡斐怎么样了。＞Ｂ。",0, 1)  --对话
	Cls()
	instruct_19(15,6)
	do return end
end

newkdef[1209]=function()
	say("我要拼命练武报仇，我还是收拾一下去找马姑娘吧。",739, 1)  --对话
	Cls()
	do return end
end
newkdef[1210]=function()
	say("v………….5…………",1067, 1,"衙役")  --对话
	Cls()
	do return end
end

newkdef[1211]=function()
	say("别嘴上逞强，比划比划。",587, 1)  --对话
	Cls()
	say("怕你不成！",1, 0)  --对话
	Cls()
	if WarMain(384) ==  false then
		instruct_15()
		Cls()
		do return end
	end
	say("小贼，今日我有急事，不与你多纠缠。",587, 1)  --对话
	Cls()
	dark()
	null(-2,31)
	null(-2,34)
	light()
	say("我们还是回去看看凤天南与钟四一家。",0, 1)  --对话
	Cls()
	say("糟啦，糟啦！我恁地胡涂，竟中了敌人调虎离山之计。",1, 0)  --对话
	instruct_10(1)
	null(-2,30)
	addevent(-2,22,0,1212,3,nil)
	addevent(-2,23,0,1212,3,nil)
	null(-2,16)
	null(-2,33)
	addevent(-2,25,1,1213,1,4782*2)
	addevent(-2,26,1,1213,1,4783*2)
	addevent(-2,27,1,1213,1,4784*2)
	do return end
end

newkdef[1212]=function()
	Cls()
	instruct_30(13,6,9,6)
	instruct_30(9,6,9,8)
	instruct_30(9,8,7,8)
	addevent(-2,35,1,nil,nil,3286*2)
	say("锺四哥四嫂，锺家兄弟，是我胡斐无能，竟然害了你们性命。Ｄ＜只见人虽死，眼睛不闭，脸上充满愤怒之色＞Ｂ今日要你作个见证，我胡斐若不杀凤天南父子给锺家满门报仇，我回来你面前自刎。",1, 0)  --对话
	Cls()
	say("我与你一起去寻这恶心贼，说来也是我冒失，我要不去寻你也至于如此。是这凤天南太过狡诈，谁能想到他还能安排个帮手在外头。我们一把火烧了这宅子。怎么有烟火味，不火，有人放火。我们先出去，别又中了奸计。 ",0, 1)  --对话
	Cls()
	dark()
	null(-2,35)
	null(-2,25)
	null(-2,26)
	null(-2,27)
	instruct_19(44,22)
	--火起
	addevent(-2,22,1,nil,nil,2159*2)
	addevent(-2,23,1,nil,nil,2159*2)
	addevent(-2,28,1,nil,nil,2159*2)
	addevent(-2,37,1,nil,nil,5144*2)
	light()
	say("我们把他们葬了吧",1, 0)  --对话
	Cls()
	dark()
	null(-2,37)
	addevent(-2,36,1,nil,nil,3348*2)
	addevent(-2,38,1,nil,nil,3286*2)
	light()
	say("我年幼无知，不明江湖上的鬼蜮伎俩，却来出头打抱不平，枉自害了人命。锺四哥四嫂，锺家兄弟，你们安息吧。",1, 0)  --对话
	Cls()
	dark()
	null(-2,38)
	addevent(-2,37,1,nil,nil,5144*2)
	light()
	say("我们回去看看。",1, 0)  --对话
	Cls()
	dark()
	null(-2,37)
	light()
	addevent(-2,13,0,1213,3,nil)
	addevent(-2,21,0,1213,3,nil)
	do return end
end

newkdef[1213]=function()
	dark()
	null(-2,13)
	null(-2,21)	
	addevent(-2,39,0,nil,nil,4318*2)
	addevent(-2,40,0,nil,nil,4318*2)
	addevent(-2,41,0,nil,nil,4318*2)
	light()
	say("捉拿杀人放火的凶手！莫走了无法无天的江洋大盗！",445, 1)  --对话
	Cls()
	say("这凤天南惊动官府，明知拿我不住，却是要挡我一阵。",1, 0)  --对话
	Cls()
	say("此人这般工于心计，定有藏身避祸的妙策，该当到何处找他才是？",1, 0)  --对话
	Cls()
	say("这凤天南惊动官府，明知拿我不住，却是要挡我一阵。",1, 0)  --对话
	Cls()
	if WarMain(385) == false then
		instruct_15()
		Cls()
		do return end
	end	
	say("我们是来请五虎门参加福大帅的天下掌门人大会的。",443, 1)  --对话
	Cls()
	say("天下掌门人聚会，那可热闹得紧哪。凤天南便算不去，他落脚何方，多少也能在会打听到一些消息。但不知那福大帅邀会各派掌门人，却是为了何事？",1, 0)  --对话
	Cls()
	say("且去看看。",0, 1)  --对话
	Cls()
	say("Ｒ衡阳Ｂ是北上要道，我们去那里打探一下。",1, 0)  --对话
	Cls()
	dark()
	null(-2,39)
	null(-2,40)
	null(-2,41)
	light()
	addevent(128,45,1,1216,1,4960*2)
	addevent(128,35,1,nil,nil,4888*2)
	addevent(128,43,1,nil,nil,4957*2)
	addevent(128,44,1,nil,nil,4946*2)
	addevent(128,36,1,nil,nil,4910*2)
	addevent(128,39,1,nil,nil,4917*2)	
	addevent(128,46,1,nil,nil,4792*2)	
	addevent(128,42,0,1215,3,nil)
	instruct_37(1)
	do return end
end

newkdef[1214]=function()
	say("韦陀门的人在争夺掌门人呢，小的不敬老，老的不爱小，哎，真是一代不如一代。",1051, 1,"酒客")  --对话
	Cls()
	do return end
end

newkdef[1215]=function()
	stands()
	say("敝门今日在先师灵前选立掌门。请姑娘上坐观礼。",725, 1,"尉迟连")  --对话
	Cls()
	say("少林韦陀门是武林有名门派，却从这些人选立掌门，岂不堕了无相大师以下列祖的威名？",587, 1)  --对话
	Cls()
	say("姑娘奉哪一位前辈之命而来？对敝门有何指教？",725, 1,"尉迟连")  --对话
	Cls()
	say("我自己要来便来，何必奉人之命？我和韦陀门有点儿渊源，见这里闹得太不成话，不得不来说几句话。",587, 1)  --对话
	Cls()
	say("你跟韦陀门有什么渊源？谁也不认得你是老几。我们正有要事，快站开些，别在这儿碍碍脚！大师兄，咱哥儿俩胜败未分，再来吧。",902, 1,"杨宾")  --对话
	Cls()
	say("今日少林韦陀门选立掌门，是也不是？",587, 1)  --对话
	Cls()
	say("是啊",725, 1,"尉迟连")  --对话
	Cls()
	say("姑娘，你不是我门人。韦陀门跟你无冤无仇，你何苦来拆这个档子？",742, 1)  --对话
	Cls()
	say("难道你便是韦陀门的？你姓什么？叫什么名字？",587, 1)  --对话
	Cls()
	say("我姓刘，名叫刘鹤真。‘韦陀双鹤’的名头你听见过么？我若不是韦陀门的弟子，怎能与万鹤声合称‘韦陀双鹤’？",742, 1)  --对话
	Cls()
	say("什么双鹤双鸭，没听见过。你要想做掌门，是不是？",587, 1)  --对话
	Cls()
	say("不是，不是，千万不可冤枉。我是师兄，万鹤声是师弟。我要做掌门，当年便做了，何必等到今日？",742, 1)  --对话
	Cls()	
	say("哼，胡说八道，谁信你的话？那你要干什么？",587, 1)  --对话
	Cls()
	say("以武功定掌门，这话先就不通。不论学武，都是人品第一。若是一个卑鄙小人武功最强，大伙儿也推他做掌门么？",742, 1)  --对话
	Cls()
	say("你这第一、第二、第几，我一件也不依，那便怎样？",587, 1)  --对话
	Cls()
	say("那又能怎样了？只好让我几根枯瘦精干的老骨头，来挨姑娘的粉拳罢啦！",742, 1)  --对话
	Cls()
	if WarMain(386) == false then
		instruct_15()
		Cls()
		do return end
	end
	instruct_35(587,0,347,0) 
	Cls()
	say("姑娘武功神妙，在下从所未见，敢问姑娘是哪一门哪一派高人所授？",742, 1)  --对话
	Cls()
	say("哼，你定然不认我是本门弟子。也罢，倘若我只用韦陀拳胜你，那便怎地？",742, 1)  --对话
	Cls()	
	say("Ｄ＜刘鹤真正要她说这句话，恭恭敬敬地答道＞Ｂ姑娘如真用本门武功折服在下，那是光大本门的天大喜事。小老儿便是跟姑娘提马鞭儿，也所甘愿。",742, 1)  --对话
	Cls()
	addevent(-2,46,1,1217,1,nil)
	null(-2,42)
	addevent(-2,42,1,1216,3,nil)
	do return end
end

newkdef[1216]=function()
	say("Ｄ＜我去牵了她的马儿，气气她。＞",1, 1)  --对话
	Cls()
	instruct_19(11,32)
	do return end
end	

newkdef[1217]=function()	
	dark()
	null(-2,43)
	null(-2,46)
	light()
	instruct_2(397,1)
	say("Ｄ＜胡斐笑道＞Ｂ偷包贼，咱们掉换了吧！",1, 1)  --对话
	Cls()
	say("Ｄ＜纵声大叫，这白马大有灵性，怎能容这小贼偷了便跑，毫不反抗？＞Ｂ偷马贼，快停下！",587, 1)  --对话
	Cls()
	say("Ｄ＜胡斐笑道＞Ｂ你本领这么大，你追上我就停下！",1, 1)  --对话
	Cls()
	instruct_19(13,16)
	stands()
	instruct_40(1)
	dark()
	addevent(-2,47,1,nil,nil,5144*2)
	addevent(-2,48,1,nil,nil,4932*2)
	light()
	say("小胡斐，你怎敢如此无礼？",587, 1)  --对话
	Cls()
	say("Ｄ＜胡斐一惊＞Ｂ你怎知我名字？",1, 1)  --对话
	Cls()
	say("Ｄ＜袁紫衣小嘴微扁，冷笑道＞Ｂ赵叔夸你英雄了得，我瞧也稀松平常。",587, 1)  --对话
	Cls()
	say("Ｄ＜胡斐听到“赵叔”字，心大喜，忙道＞Ｂ你识得赵半山赵哥么？他在哪里？",1, 1)  --对话
	Cls()
	say("Ｄ＜袁紫衣俏脸上更增了一层怒气，喝道＞Ｂ姓胡的小子，你敢讨我便宜？",587, 1)  --对话
	Cls()
	say("我讨什么便宜了？",1, 1)  --对话
	Cls()
	say("怎么我叫赵叔，你便叫赵哥，这不是想做我长辈么？",587, 1)  --对话
	Cls()
	say("不敢，不敢！你当真叫他赵叔？",1, 1)  --对话
	Cls()
	say("难道骗你了？",587, 1)  --对话
	Cls()
	say("Ｄ＜胡斐将脸一板，道＞Ｂ好，那我便长你一辈，你叫我胡叔叔吧，喂，紫衣，赵哥在哪里啊？",1, 1)  --对话
	Cls()
	say("这小子胡说八道，我教训教训你。",587, 1)  --对话
	Cls()
	say("你先别恼，你也打了几场架了，肚子也饿了吧，我们找个地儿吃点东西。",1, 1)  --对话
	Cls()
	say("你有钱请客吗？Ｄ＜望着胡斐笑道＞Ｂ",587, 1)  --对话
	Cls()
	say("Ｄ＜胡斐笑着拿出一把碎银子，足有五两多＞Ｂ行走江湖，怎能不防偷防盗呢。",1, 1)  --对话
	Cls()
	say("Ｄ＜袁紫衣脸色绯红＞Ｂ算你厉害，我们走。",587, 1)  --对话
	Cls()
	if instruct_20()  then
		Cls()  --清屏
		say("你的队伍已满，我无法加入。", 587, 0)  --对话
		Cls()  --清屏
		do return end  --无条件结束事件
	end
	instruct_10(587)
	dark()
	null(-2,47)
	null(-2,48)
	addevent(-2,51,1,nil,nil,4963*2)
	addevent(-2,50,1,nil,nil,4318*2)
	addevent(-2,52,1,nil,nil,4312*2)
	addevent(-2,55,0,1218,3,nil)
	light()
	do return end
end

newkdef[1218]=function()
	dark()
	null(-2,55)
	addevent(-2,53,nil,nil,4933*2)
	addevent(-2,54,nil,nil,5143*2)	
	instruct_19(33,40)
	stands()
	instruct_40(0)
	light()
	say("小二，给我们来两间上房。",743, 1)  --对话
	Cls()
	say("客官对不住您呢，小店已经客满。", 220, 0,"店小二")  --对话
	Cls()  --清屏
	say("混账东西，别人没有，我们来了就有了。",442, 1)  --对话
	Cls()
	say("我道是谁，原来是广西梧州八仙剑的掌门人蓝秦。阁下可是去京师参与掌门人大会么？",587, 1)  --对话
	Cls()
	say("我正要找你，在这里撞见，那是再好也没有。你把掌门人让给我，我替你去参加掌门人大会。",587, 1)  --对话
	Cls()
	say("姑娘高姓大名，找蓝某有何指教？",743,0)  --对话
	Cls()
	say("我叫你不用上京去啦，由我代你去便是。",587, 1)  --对话
	Cls()
	say("此话怎讲？",743,0)  --对话
	Cls()
	say("哼，这还不明白？我叫你把八仙剑的掌门之位让了给我！",587, 1)  --对话
	Cls()
	say("Ｄ＜蓝秦听她言语无礼，不由得大是恼怒＞Ｂ姑娘尊姓大名？令师是谁？",743,0)  --对话
	Cls()	
	say("我又不跟你套交情，问我姓名干么？我师父的名头更加不能说给你知。我师父曾跟你有一面之缘。若是提起往事，我倒不便硬要你让这掌门之位了。你这掌门之位到底让是不让？",587, 1)  --对话
	Cls()
	say("好，那要看你有没有这份本事。",743,0)  --对话
	Cls()	
	if WarMain(387) == false then
		instruct_15()
		Cls()
		do return end
	end
	instruct_35(587,0,326,5)
	instruct_2(483,1)
	say("在下这便还乡，终身不提剑字。只是旁人问起，在下输在哪一派哪一位英雄豪杰剑底，却叫在下如何回答？",743,0)  --对话
	Cls()
	say("我姓袁名紫衣，至于家师的名讳吗？……Ｄ＜走到蓝秦耳旁，凑近身去，在他耳边轻说了几个字＞Ｂ",587, 1)  --对话
	Cls()
	say("Ｄ＜蓝秦一听之下，脸色又变，脸上沮丧恼恨之色立消，变为惶恐恭顺＞Ｂ早知如此，小人如何敢与姑娘动？姑娘见到尊师之时，便说梧州蓝某向他老人家请安。",743,0)  --对话
	Cls()	
	dark()
	null(-2,53)
	null(-2,54)
	light()
	say("小胡斐，我要去Ｒ北京Ｂ参加掌门人大会了，你不要跟着我。",587, 1)  --对话
	Cls()
	instruct_21(587)	
	instruct_37(2)
	dark()
	light()
	say("从此处往北有个Ｒ药王庙Ｂ是上京必经之路,不妨顺路去游戏玩一番。",1, 0)  --对话
	addevent(103,31,0,1219,3,nil)
	do return end
end	
newkdef[1219]=function()
	dark()
	addevent(-2,32,1,nil,nil,4932*2)
	instruct_19(17,24)
	stands()
	instruct_40(3)
	light()
	say("袁姑娘，好巧啊。",1, 0)  --对话
	Cls()
	say("Ｄ（陡然看到胡斐竟然一路跟着自己，袁紫衣心里跟吃了蜜似的甜）Ｂ小胡斐，没想到你不但是个偷马贼还是个跟屁虫。",587, 0)  --对话
	Cls()
	say("Ｄ（胡斐心中甚是愉悦，也不与她扮嘴，笑吟吟说）Ｂ袁姑娘，我孤陋寡闻，有个问题要请教你，这天下武学，共有多少门派？",1, 0)  --对话
	Cls()
	say("Ｄ（笑道）Ｂ不知道啊，你说有多少门派？",587, 0)  --对话
	Cls()
	say("Ｄ（摇头）Ｂ我说不上，这才请教。你现下已当了韦陀门、八仙剑、九龙派几家的大掌门啦。还得再做几派掌门，方才心满意足？",1, 0)  --对话
	Cls()
	say("少林、武当、太极这些大门派的掌门人，我是不敢去抢的。再收十家破铜烂铁，也就够啦。",587, 0)  --对话
	Cls()
	say("Ｄ（胡斐伸了伸舌头）Ｂ武林十家总掌门，这名头可够威风啊。",1, 0)  --对话
	Cls()
	say("Ｄ（笑道）Ｂ胡大哥，你武艺这般强，何不也抢几家掌门人做做？咱们一路收过去。你收一家，我收一家，轮流着张罗。到得北京，我是十家总掌门，你也是十家总掌门。咱哥儿俩一同去参与福大帅的什么天下掌门人大会，岂不有趣？",587, 0)  --对话
	Cls()
	say("Ｄ（胡斐听她称自己为大哥，心中更喜）Ｂ我可没这个胆子，更没姑娘的好武艺。多半掌门人半个也没抢着，便给人家一招‘吕洞宾推狗’，摔在河里，变成了一条拖泥带水的落水狗！若是单做泥鳅派掌门人呢，可又不大光彩。",1, 0)  --对话
	Cls()
	say("Ｄ（笑弯了腰，抱拳道）Ｂ胡大哥，小妹这里跟你陪不是啦。Ｄ（这一说，不知不觉天竟然暗下来，天空中猛的一个霹雳，黄豆大的雨点已洒将下来）Ｂ",587, 0)  --对话
	Cls()
	say("这雨下不长，待会雨收了，再找家客栈投宿。",1, 0)  --对话
	Cls()
	say("Ｄ（袁紫衣“嗯”了一声，不再说话。两人本来一直说说笑笑，如今孤男寡女共处暗室，袁紫衣心微感异样，瞧着胡斐，不自禁地有些腼腆，有些尴尬。两人并肩坐着，突然间同时转过头来，目光相触，微微一笑，各自把头转了开去）Ｂ",587, 0)  --对话
	Cls()
end
newkdef[1251]=function()--飞雪邪线 若兰线开始

end


---1220